[
  {
    "title": "Nominations Sent to the Senate for U.S. Attorney and District Judge Positions",
    "summary": "The White House announced nominations to the Senate for federal offices, including James Bishop of North Carolina to be United States Attorney for the Middle District of North Carolina for a four-year term; Megan Blair Benton of Missouri to be United States District Judge for the Western District of Missouri; and Christopher Michael De Bono of the District of Columbia to be an Associate Judge of the District of Columbia.",
    "link": "https://www.whitehouse.gov/presidential-actions/2025/12/nominations-sent-to-the-senate-a9f3/"
  },
  {
    "title": "Proclamation by the President: Thanksgiving Day, 2025",
    "summary": "A presidential proclamation designating Thanksgiving Day, 2025 as a national observance. The document recounts the origins of the holiday in 1789 when President George Washington established the first National Day of Thanksgiving and describes the longstanding tradition of expressing gratitude. It references the idea that nations have a duty to acknowledge the providence of Almighty God and to be grateful, and it invites the American people to observe Thanksgiving Day in a manner that reflects on blessings and encourages charitable acts.",
    "link": "https://www.whitehouse.gov/presidential-actions/2025/11/thanksgiving-day-2025/"
  },
  {
    "title": "Proclamation on the Role of Steel in the United States Economy and Infrastructure",
    "summary": "The proclamation emphasizes the critical role of steel in the United States economy and daily life, highlighting its foundational use in construction, transportation, energy systems, military equipment, and related manufacturing. It notes steel's contribution to national economic output and its importance across infrastructure and defense sectors, underscoring the ongoing significance of a robust domestic steel industry for economic resilience.",
    "link": "https://www.whitehouse.gov/presidential-actions/2025/11/regulatory-relief-for-certain-stationary-sources-to-promote-american-coke-oven-processing-security/"
  },
  {
    "title": "Nominations Sent to the Senate for ATF Director, EEOC General Counsel, CFPB Director, and Other Nominations",
    "summary": "The White House announced nominations sent to the Senate for multiple positions, including Robert Cekada to be Director of the Bureau of Alcohol, Tobacco, Firearms, and Explosives; Carter Crow to be General Counsel of the Equal Employment Opportunity Commission for a four-year term; Stuart Levenbach to be Director of the Bureau of Consumer Financial Protection for a five-year term; and David Clay Fowlkes among others.",
    "link": "https://www.whitehouse.gov/presidential-actions/2025/11/nominations-sent-to-the-senate-d2ae/"
  },
  {
    "title": "Proclamation: National Adoption Month, 2025",
    "summary": "This presidential proclamation designates November 2025 as National Adoption Month and emphasizes that every child deserves a safe and nurturing home. It notes that adoption provides stability and belonging for children who need a permanent family and acknowledges the importance of adoptive families. The proclamation highlights the role of individuals, communities, and government agencies in supporting foster care and adoption efforts, and it calls for awareness, outreach, and continued commitment to improving outcomes for children in or at risk of entering foster care. It serves as a formal recognition of adoption as a national priority and an invitation to participate in efforts to assist children in need of permanent families.",
    "link": "https://www.whitehouse.gov/presidential-actions/2025/11/national-adoption-month-2025/"
  }
]