[
  {
    "title": "Proclamation: National Black History Month, 2026",
    "summary": "A presidential proclamation designating February 2026 as National Black History Month, marking the 250th anniversary of American independence and acknowledging the historical contributions and impact of Black Americans on the nation's history. The proclamation underscores education and reflection on Black history and the roles Black Americans have played in the country's development.",
    "link": "https://www.whitehouse.gov/presidential-actions/2026/02/national-black-history-month-2026/"
  },
  {
    "title": "Executive Order Recognizing American Motor Racing and Its Contributions to American Sports",
    "summary": "This presidential action, issued under the President's constitutional and statutory authority, establishes the purpose and policy of recognizing American motor racing, with emphasis on INDYCAR racing. The text notes that American INDYCAR racing has a history spanning more than a century and that the cars reach speeds of over 200 miles per hour. The summary indicates the order seeks to acknowledge the significance of American motor racing in the nation's sports landscape and to outline related objectives for recognition and promotion. The complete order would specify the actions to be taken to implement these aims.",
    "link": "https://www.whitehouse.gov/presidential-actions/2026/01/celebrating-american-greatness-with-american-motor-racing/"
  },
  {
    "title": "Proclamation for National School Choice Week, 2026",
    "summary": "This presidential proclamation designates National School Choice Week for 2026 and states that the American people have the right to secure their own destiny in education, emphasizing the role of families in choosing educational options over government-imposed decisions. It reflects on the nation's historical values and highlights support for parental choice in K-12 education, recognizing the availability of diverse educational opportunities for children across the United States.",
    "link": "https://www.whitehouse.gov/presidential-actions/2026/01/national-school-choice-week-2026/"
  },
  {
    "title": "Executive Order to Address Competition in the Residential Real Estate Market Between Institutional Investors and Individual Homebuyers",
    "summary": "This executive order states the policy goal of reducing the competitive advantages held by Wall Street–affiliated investors in the purchase of single-family homes and ensuring fair access for individual homebuyers. It outlines the rationale for government action in the residential real estate market and directs federal agencies to develop and implement measures to address factors that disproportionately favor institutional buyers, monitor market developments, and report on progress and implementation. The order emphasizes the importance of homeownership and seeks to maintain equitable opportunities for Main Street buyers.",
    "link": "https://www.whitehouse.gov/presidential-actions/2026/01/stopping-wall-street-from-competing-with-main-street-homebuyers/"
  },
  {
    "title": "Proclamation: National Day of Patriotic Devotion, 2026",
    "summary": "This proclamation designates a National Day of Patriotic Devotion in 2026 and describes the intended observances and purposes of the day, including reflection on the nation’s sovereignty, security, the administration of justice, and progress toward prosperity, and encourages citizens to participate in appropriate ceremonies and expressions of national unity.",
    "link": "https://www.whitehouse.gov/presidential-actions/2026/01/national-day-of-patriotic-devotion-2026/"
  }
]