[
  {
    "title": "Executive Order Launching the Genesis Mission",
    "summary": "This presidential action issues an order to launch the Genesis Mission, a federal government program intended to advance scientific discovery and technological innovation. It places the initiative within the historical context of science driving American progress and identifies the objective as enhancing the United States' position in global technology competition. The document begins with Section 1, Purpose, outlining the mission's aim to organize and coordinate federal efforts across agencies to implement and oversee the initiative, establishing the framework for its execution and governance.",
    "link": "https://www.whitehouse.gov/presidential-actions/2025/11/launching-the-genesis-mission/"
  },
  {
    "title": "Designation of Certain Muslim Brotherhood Chapters as Foreign Terrorist Organizations and Specially Designated Global Terrorists",
    "summary": "Under the authority of the President, this executive order designates certain chapters of the Muslim Brotherhood as Foreign Terrorist Organizations and as Specially Designated Global Terrorists under the Immigration and Nationality Act and the International Emergency Economic Powers Act. The designation provides the legal basis for related sanctions and enforcement measures intended to restrict support, assets, and other forms of assistance to or from the designated entities, and to implement the designation in accordance with applicable law.",
    "link": "https://www.whitehouse.gov/presidential-actions/2025/11/designation-of-certain-muslim-brotherhood-chapters-as-foreign-terrorist-organizations-and-specially-designated-global-terrorists/"
  },
  {
    "title": "Executive Order Modifying the Scope of Tariffs on the Government of Brazil",
    "summary": "An executive action issued by the President under the Constitution and laws of the United States, including the International Emergency Economic Powers Act, the National Emergencies Act, and section 604 of the Trade Act of 1974, to modify the scope of tariffs applied to the Government of Brazil. The action adjusts which goods, transactions, or categories involving the Government of Brazil are subject to United States tariff measures, and may modify tariff rates, exemptions, or other tariff-related requirements as authorized by these statutes. The order supersedes prior tariff-related guidance regarding Brazil and becomes effective on a date specified in the order.",
    "link": "https://www.whitehouse.gov/presidential-actions/2025/11/modifying-the-scope-of-tariffs-on-the-government-of-brazil/"
  },
  {
    "title": "Presidential Action Modifying the Scope of the Reciprocal Tariff with Respect to Certain Agricultural Products",
    "summary": "Under authorities including the International Emergency Economic Powers Act (IEEPA), the National Emergencies Act, and section 604 of the Trade Act of 1974, as amended, the President modified the scope of the reciprocal tariff program as it applies to certain agricultural products, updating the coverage of the tariff treatment for those products.",
    "link": "https://www.whitehouse.gov/presidential-actions/2025/11/modifying-the-scope-of-the-reciprocal-tariff-with-respect-to-certain-agricultural-products/"
  },
  {
    "title": "Proclamation on Veterans Day, 2025",
    "summary": "The President proclaims November 11, 2025, as Veterans Day to honor the service and sacrifice of American veterans, acknowledge their role in safeguarding freedom and the nation’s way of life, and invites the nation to observe the day with appropriate ceremonies and activities. The proclamation references the long history of veterans' service and emphasizes recognition and support for those who have served, as well as a call for renewed national commitment to veterans and their families.",
    "link": "https://www.whitehouse.gov/presidential-actions/2025/11/veterans-day-2025/"
  }
]