[
  {
    "title": "Executive Order on Improving Government Design and Digital Services",
    "summary": "This executive order establishes the objective of modernizing and standardizing the design of United States Government digital and service offerings. It emphasizes user-centered, accessible, and inclusive design across federal agencies and calls for coordination to reduce fragmentation in government design practices. The order outlines plans to adopt comprehensive design standards, integrate design considerations into policy, procurement, and program execution, and improve the usability, reliability, and transparency of government services for the public. It seeks to promote efficiency and innovation by applying design thinking to the development and delivery of government services, while ensuring implementation through interagency collaboration, leadership roles in design, metrics for evaluating design outcomes, and adherence to applicable laws and regulations.",
    "link": "https://www.whitehouse.gov/presidential-actions/2025/08/improving-our-nation-through-better-design/"
  },
  {
    "title": "Proclamation Celebrating the 90th Anniversary of the Social Security Act",
    "summary": "A presidential proclamation commemorating the 90th anniversary of the Social Security Act. The proclamation notes that the act was signed into law on August 14, 1935 by President Franklin D. Roosevelt and describes the act’s role in establishing social insurance programs to support retirees and workers, reflecting the government's ongoing commitment to social welfare.",
    "link": "https://www.whitehouse.gov/presidential-actions/2025/08/90th-anniversary-of-the-social-security-act/"
  },
  {
    "title": "Revocation of Executive Order 14036 (Promoting Competition in the American Economy)",
    "summary": "The document announces a presidential order revoking Executive Order 14036, issued on July 9, 2021, titled Promoting Competition in the American Economy. Section 1 formally revokes EO 14036. Section 2 provides general provisions; the excerpt shows a clause beginning with 'Nothing in this order shall be construed', indicating standard interpretive language, but the remainder of that provision is not shown in the excerpt. The link points to the White House page containing the full text of the action.",
    "link": "https://www.whitehouse.gov/presidential-actions/2025/08/revocation-of-executive-order-on-competition/"
  },
  {
    "title": "Executive Order on Enabling Competition in the Commercial Space Industry",
    "summary": "This executive order establishes a policy framework to promote competition within the United States commercial space sector. It references the historical context of the 1969 Moon landing and notes the involvement of premier space companies worldwide in rocket launches. The order directs federal agencies to coordinate policies and actions to encourage fair competition, support innovation, reduce barriers to entry, and foster a robust domestic commercial space industry while maintaining national security considerations.",
    "link": "https://www.whitehouse.gov/presidential-actions/2025/08/enabling-competition-in-the-commercial-space-industry/"
  },
  {
    "title": "Executive Order Ensuring American Pharmaceutical Supply Chain Resilience by Filling the Strategic Active Pharmaceutical Ingredients Reserve",
    "summary": "This executive order directs federal agencies to strengthen the domestic pharmaceutical supply chain by increasing production capacity for essential pharmaceutical products and by filling the Strategic Active Pharmaceutical Ingredients Reserve (SAPIR). Building on prior administration efforts to protect public health and national security, the order requires identifying critical active pharmaceutical ingredients (APIs), coordinating procurement and stockpile activities, and assessing vulnerabilities in the supply chain. It tasks relevant agencies with establishing procedures to prioritize production and acquisition of priority APIs, maintaining adequate stockpiles, and streamlining regulatory and administrative processes to support rapid manufacturing, replenishment, and contingency planning during shortages or emergencies.",
    "link": "https://www.whitehouse.gov/presidential-actions/2025/08/ensuring-american-pharmaceutical-supply-chain-resilience-by-filling-the-strategic-active-pharmaceutical-ingredients-reserve/"
  },
  {
    "title": "Executive Action Modifying Reciprocal Tariff Rates in Light of Ongoing Discussions with the People's Republic of China",
    "summary": "Presidential action issued under constitutional authority and the International Emergency Economic Powers Act, the National Emergencies Act, and provisions of the Trade Act of 1974 to adjust the United States reciprocal tariff schedule with the People's Republic of China. The action modifies existing tariff rates on imported goods as a result of ongoing bilateral discussions with China. It authorizes changes to duties to reflect the current state of negotiations and the administration's trade policy, and it specifies the legal basis and intended effect of the tariff adjustments within the framework of U.S. trade and national security authorities.",
    "link": "https://www.whitehouse.gov/presidential-actions/2025/08/further-modifying-reciprocal-tariff-rates-to-reflect-ongoing-discussions-with-the-peoples-republic-of-china/"
  },
  {
    "title": "Presidential Memorandum to the Secretary of Defense on Restoring Law and Order in the District of Columbia",
    "summary": "A presidential memorandum addressed to the Secretary of Defense that directs coordination of federal efforts to restore public safety and order in the District of Columbia. The document references the President's constitutional role as Commander in Chief of the District of Columbia National Guard and articulates the duty to protect law-abiding citizens from criminal activity. It outlines the authority and framework for mobilizing or coordinating resources to address disturbances and to support local authorities, including planning, timing considerations, and reporting as applicable.",
    "link": "https://www.whitehouse.gov/presidential-actions/2025/08/restoring-law-and-order-in-the-district-of-columbia/"
  },
  {
    "title": "Presidential Declaration of a Crime Emergency in the District of Columbia",
    "summary": "This presidential action, issued under constitutional and statutory authority, declares a crime emergency in the District of Columbia. It relies on the District of Columbia Self-Government and Governmental Reorganization Act (Public Law 93-198), as amended (section 740 of the Home Rule Act), and 3 U.S.C. § 301. The declaration identifies the existence of a crime emergency in the District and authorizes the use of federal resources, tools, and authorities to support public safety operations and law enforcement coordination in the District as appropriate under law.",
    "link": "https://www.whitehouse.gov/presidential-actions/2025/08/declaring-a-crime-emergency-in-the-district-of-columbia/"
  },
  {
    "title": "Executive Order Expanding Access to Alternative Asset Investments for 401(k) Plans",
    "summary": "This executive order establishes the objective of broadening the range of investments permitted in 401(k) plans to include certain alternative assets and directs federal agencies to review current regulations and consider actions to facilitate wider participation by 401(k) investors in these asset classes. The document notes that high-income individuals and some public pension participants already have access to or benefit from investments in alternative assets, and it aims to remove barriers and expand access within tax-advantaged retirement accounts.",
    "link": "https://www.whitehouse.gov/presidential-actions/2025/08/democratizing-access-to-alternative-assets-for-401k-investors/"
  }
]