[
  {
    "title": "Executive Order to Restore the United States Department of War",
    "summary": "This presidential action asserts authority to restore the United States Department of War, reviving its historic role to oversee the operation and maintenance of its duties. The document invokes constitutional and statutory authority to issue the order and includes Section 1, Purpose, which references the original establishment of the Department by President George Washington on August 7, 1789. The order is framed to reestablish the department and its organizational framework to manage the department's responsibilities, aligning the government structure with the department’s historic function. The excerpt reflects the formal structure of the order and its basis in history, with the full text providing additional provisions to implement the restoration.",
    "link": "https://www.whitehouse.gov/presidential-actions/2025/09/restoring-the-united-states-department-of-war/"
  },
  {
    "title": "Executive Action Modifying Scope of Reciprocal Tariffs and Establishing Procedures for Implementing Trade and Security Agreements",
    "summary": "This presidential action asserts authority under the Constitution and federal law, including the International Emergency Economic Powers Act, the National Emergencies Act, and section 232 of the Trade Expansion Act of 1962, to modify the scope of reciprocal tariffs and to establish procedures for implementing trade and security agreements. The action outlines the scope of tariff modifications and provides a procedural framework for engaging with and enforcing such trade and security arrangements.",
    "link": "https://www.whitehouse.gov/presidential-actions/2025/09/modifying-the-scope-of-reciprocal-tariffs-and-establishing-procedures-for-implementing-trade-and-security-agreements/"
  },
  {
    "title": "Executive Order to Strengthen Efforts to Protect U.S. Nationals from Wrongful Detention Abroad under the Levinson Act",
    "summary": "This executive order, issued under the President's authority and the Robert Levinson Hostage Recovery and Hostage-Taking Accountability Act (22 U.S.C. 1741 et seq.), references Section 1: Purpose, which states that the United States must strengthen its efforts to protect U.S. nationals from wrongful detention abroad. Citing the Levinson Act as the enabling authority, the order directs federal agencies to coordinate and implement policy actions to deter, prevent, and respond to wrongful detention, with emphasis on enhanced consular support, interagency coordination, and accountability for detainees. The document outlines the objective of clarifying responsibilities across relevant departments to improve protections for U.S. nationals overseas.",
    "link": "https://www.whitehouse.gov/presidential-actions/2025/09/strengthening-efforts-to-protect-u-s-nationals-from-wrongful-detention-abroad/"
  },
  {
    "title": "Nominations Sent to Senate for Bureau of Labor Statistics Commissioner, Federal Maritime Commissioner, and Assistant Secretary",
    "summary": "The White House announced nominations sent to the Senate for three federal positions: Erwin Antoni, of Pennsylvania, to be Commissioner of the Bureau of Labor Statistics, Department of Labor, for a four-year term, to succeed Erika L. McEntarfer; Laura DiBella, of Florida, to be Federal Maritime Commissioner for a term expiring June 30, 2028, to succeed L. E. Sola; and Steven Haines, of Virginia, to be an Assistant Secretary (portfolio not specified in the excerpt). The announcement appeared on the White House website under the Nominations Sent to the Senate post.",
    "link": "https://www.whitehouse.gov/presidential-actions/2025/09/nominations-sent-to-the-senate-f7c7/"
  },
  {
    "title": "Executive Order on Improving Design Quality of Federal Public Architecture",
    "summary": "This executive order directs federal agencies to prioritize high-quality architectural design in the construction and renovation of federal public buildings and spaces. It establishes policy to improve the visual quality of federal architecture, outlines the role of design standards and review processes, and calls for coordination with professional architects and designers to ensure consistent application across federal projects.",
    "link": "https://www.whitehouse.gov/presidential-actions/2025/08/making-federal-architecture-beautiful-again/"
  },
  {
    "title": "Proclamation: Overdose Prevention Week, 2025",
    "summary": "This presidential proclamation designates Overdose Prevention Week for 2025. It notes that the safety, health, and well-being of the American people are essential to building a resilient nation and identifies the drug overdose crisis as a grave threat to lives and families. The proclamation designates Overdose Prevention Week to raise awareness and to emphasize federal efforts related to overdose prevention and associated public health initiatives.",
    "link": "https://www.whitehouse.gov/presidential-actions/2025/08/overdose-prevention-week-2025/"
  },
  {
    "title": "Proclamation on Labor Day, 2025 Recognizing the Contributions of American Workers",
    "summary": "This proclamation designates Labor Day as a day to recognize the contributions of the American workforce to national development and prosperity. It notes that the nation's history has been shaped by the skill, determination, and resilience of workers from the earliest days to the present, and emphasizes the essential role of workers in building infrastructure and advancing innovation. The proclamation describes a commitment to safe and fair workplaces, opportunities for workforce development, and policies that support economic growth. It invites Americans to observe Labor Day with appropriate ceremonies and reflections on the achievements and ongoing challenges faced by workers.",
    "link": "https://www.whitehouse.gov/presidential-actions/2025/08/labor-day-2025/"
  },
  {
    "title": "Memorandum Directing Investigations into the Use of Federal Grant Funds for Illegal Lobbying and Partisan Political Activity by Federal Grantees",
    "summary": "A presidential memorandum issued under the President's constitutional and legal authority directing the Attorney General to conduct investigations into whether federal grant funds were used for illegal lobbying or for partisan political activity by federal grantees. The document references Section 1, Investigations Into Use of Federal Grant Funds, and outlines steps to assess compliance with applicable laws governing the use of federal funds by grantees and to pursue appropriate enforcement actions.",
    "link": "https://www.whitehouse.gov/presidential-actions/2025/08/use-of-appropriated-funds-for-illegal-lobbying-and-partisan-political-activity-by-federal-grantees/"
  }
]