[
  {
    "title": "Proclamation: Martin Luther King Jr. Federal Holiday, 2026",
    "summary": "The President issues a proclamation designating Martin Luther King Jr. Federal Holiday for 2026 to honor Reverend Dr. Martin Luther King Jr. and his work toward civil rights and justice. The proclamation references the nation's founding principles and emphasizes the ongoing obligation to advance equal rights. It invites federal agencies and the public to observe the holiday through appropriate ceremonies, educational programs, and service opportunities aligned with the holiday's objectives.",
    "link": "https://www.whitehouse.gov/presidential-actions/2026/01/martin-luther-king-jr-federal-holiday-2026/"
  },
  {
    "title": "Nominations Sent to the Senate for Five-Year Terms: Ademola Adewale-Sadik for U.S. Director of the African Development Bank; Charlton Allen for General Counsel of the Federal Labor Relations Authority; and Matthew Anderson",
    "summary": "The White House announced nominations sent to the Senate for three individuals. Ademola Adewale-Sadik, of New York, is nominated to be United States Director of the African Development Bank for a five-year term, succeeding Oren E. Whyche-Shaw. Charlton Allen, of North Carolina, is nominated to be General Counsel of the Federal Labor Relations Authority for a five-year term, succeeding Julia Akins Clark. Matthew Anderson is also named in the nominations, but the excerpt does not specify his location or the exact position. This release is consistent with the administration's routine nominations to the Senate.",
    "link": "https://www.whitehouse.gov/presidential-actions/2026/01/nominations-sent-to-the-senate-078c/"
  },
  {
    "title": "Executive Order Directing Withdrawal from Certain International Organizations, Conventions, and Treaties and Termination of Funding",
    "summary": "This executive action directs the United States to withdraw from specified international organizations, conventions, and treaties and to terminate funding to those entities. The memorandum references Executive Order 14199, issued February 4, 2025, and directs the heads of executive departments and agencies to implement the withdrawal and funding termination in accordance with applicable law. The action targets international agreements deemed by the President to be contrary to United States interests and specifies administrative steps to cease participation and funding.",
    "link": "https://www.whitehouse.gov/presidential-actions/2026/01/withdrawing-the-united-states-from-international-organizations-conventions-and-treaties-that-are-contrary-to-the-interests-of-the-united-states/"
  }
]