[
  {
    "title": "Nominations Sent to the Senate for U.S. Attorney for the District of Maine, U.S. District Judge for the Western District of Missouri, and Other Nominations",
    "summary": "The White House reports that nominations have been sent to the Senate for several federal offices. Andrew Benson, of Maine, is nominated to be United States Attorney for the District of Maine for a four-year term, to succeed Darcie N. McElwee. Megan Blair Benton, of Missouri, is nominated to be United States District Judge for the Western District of Missouri, to fill the seat vacated by the retirement of M. Douglas Harpool. William Boyle, of North Carolina, is nominated to a United States position (specific office not provided in the excerpt). The announcement forms part of ongoing nominations to the Senate.",
    "link": "https://www.whitehouse.gov/presidential-actions/2026/01/nominations-sent-to-the-senate-3f7b/"
  },
  {
    "title": "Proclamation Amending Adjustments to Imports of Timber, Lumber, and Their Derivative Products into the United States under Section 232",
    "summary": "This presidential proclamation references a report transmitted by the Secretary of Commerce on July 1, 2025 concerning the effects of imports of timber, lumber, and their derivative products on the national security of the United States under section 232. It describes amendments to the framework for adjusting imports of timber, lumber, and their derivative products into the United States, as reflected in the linked document titled 'Amendments to Adjusting Imports of Timber, Lumber, and their Derivative Products into the United States.'",
    "link": "https://www.whitehouse.gov/presidential-actions/2025/12/amendments-to-adjusting-imports-of-timber-lumber-and-their-derivative-products-into-the-united-states/"
  },
  {
    "title": "To Implement the United States-Israel Agreement on Trade in Agricultural Products and for Other Purposes",
    "summary": "This presidential action announces and directs the implementation of the United States-Israel Agreement on Trade in Agricultural Products and related provisions, within the framework of the United States-Israel Free Trade Area (USIFTA) established by an agreement signed on April 22, 1985. The agreement was approved by Congress in section 3 of the United States–Israel Free Trade Area Implementation Act. The action outlines steps for U.S. government agencies to carry out the agreement’s provisions governing trade in agricultural products and related purposes, in coordination with the Government of Israel.",
    "link": "https://www.whitehouse.gov/presidential-actions/2025/12/to-implement-the-united-states-israel-agreement-on-trade-in-agricultural-products-and-for-other-purposes/"
  },
  {
    "title": "Executive Order Adjustments of Certain Rates of Pay for Statutory Pay Systems",
    "summary": "This executive order, issued by the President under constitutional authority, governs adjustments to the rates of basic pay for statutory pay systems as defined in 5 U.S.C. 5302(1). It designates Section 1 as Statutory Pay Systems and states that these rates are to be set as adjusted under 5 U.S.C. 5303, thereby establishing updated pay rates for those systems.",
    "link": "https://www.whitehouse.gov/presidential-actions/2025/12/adjustments-of-certain-rates-of-pay/"
  },
  {
    "title": "Executive Order on Ensuring American Space Superiority",
    "summary": "Issued under the President's constitutional and statutory authority, this executive order states that national space superiority is a central objective and that the technologies developed to achieve it contribute to the United States' strength, security, and prosperity. Section 1 designates the purpose of the order, describing space superiority as a measure of national vision and willpower and outlining the intended focus of the policy. The excerpt indicates the document is structured to establish a policy framework guiding federal actions related to space capabilities.",
    "link": "https://www.whitehouse.gov/presidential-actions/2025/12/ensuring-american-space-superiority/"
  },
  {
    "title": "Executive Order Providing for the Closure of Federal Executive Departments and Agencies on December 24, 2025, and December 26, 2025",
    "summary": "This executive order directs that all executive departments and agencies of the Federal Government shall be closed and their employees excused from duty on Wednesday, December 24, 2025, and Friday, December 26, 2025, pursuant to the President's constitutional authority.",
    "link": "https://www.whitehouse.gov/presidential-actions/2025/12/providing-for-the-closure-of-executive-departments-and-agencies-of-the-federal-government-on-december-24-2025-and-december-26-2025/"
  },
  {
    "title": "Increasing Medical Marijuana and Cannabidiol Research",
    "summary": "This presidential action outlines a policy to expand and accelerate medical marijuana and cannabidiol research by addressing regulatory and logistical barriers identified in the Food and Drug Administration's 2023 review. It describes the purpose of facilitating research infrastructure, clarifying regulatory processes, and coordinating among federal agencies to support clinical trials, data collection, and evidence development related to marijuana and cannabidiol for medical use.",
    "link": "https://www.whitehouse.gov/presidential-actions/2025/12/increasing-medical-marijuana-and-cannabidiol-research/"
  },
  {
    "title": "Restricting and Limiting the Entry of Foreign Nationals to Protect the Security of the United States",
    "summary": "This presidential action reinstates restrictions on the entry of certain foreign nationals into the United States, with the stated aim of preventing threats to national security and public safety at the border. The action notes that the Supreme Court upheld these restrictions and renews the policy through Executive Order 14161, issued January 20, 2025, titled Protecting the United States From Foreign Terrorists and Other National Security Threats. The order directs relevant federal agencies to enforce the entry restrictions and apply the criteria established by the order, continuing the policy implementation described as having been successful during the previous administration.",
    "link": "https://www.whitehouse.gov/presidential-actions/2025/12/restricting-and-limiting-the-entry-of-foreign-nationals-to-protect-the-security-of-the-united-states/"
  }
]