[
  {
    "title": "Restoration of the Public Service Loan Forgiveness Program",
    "summary": "This executive order aims to renew and reinforce the Public Service Loan Forgiveness (PSLF) Program, which was created by Congress in 2007 to incentivize individuals to pursue careers in public service by offering a pathway for the forgiveness of their federal student loans after a period of qualifying employment. The order outlines the intention to enhance the program's effectiveness and accessibility for eligible participants.",
    "link": "https://www.whitehouse.gov/presidential-actions/2025/03/restoring-public-service-loan-forgiveness/"
  },
  {
    "title": "Establishment of the White House Task Force for FIFA World Cup 2026 Preparation",
    "summary": "This executive order establishes a task force within the White House to oversee preparations for the FIFA Club World Cup 2025 and the FIFA World Cup 2026, which the United States will host. The task force aims to coordinate efforts across various governmental and organizational sectors to ensure successful planning and execution of the events, addressing logistics, security, and public engagement in anticipation of these international sporting events.",
    "link": "https://www.whitehouse.gov/presidential-actions/2025/03/establishing-the-white-house-task-force-on-the-fifa-world-cup-2026/"
  },
  {
    "title": "Amendment to Import Duties Related to Synthetic Opioids from China",
    "summary": "This executive order addresses modifications to import duties on goods related to the synthetic opioid supply chain originating from the People's Republic of China. It is supported by presidential authorities granted through various acts, including the International Emergency Economic Powers Act and the National Emergencies Act. The order aims to manage economic implications and public health concerns associated with synthetic opioids, although detailed provisions of the amendment are not specified in the summary provided.",
    "link": "https://www.whitehouse.gov/presidential-actions/2025/03/further-amendment-to-duties-addressing-the-synthetic-opioid-supply-chain-in-the-peoples-republic-of-china/"
  }
]