[
  {
    "title": "Executive Order Addressing Security Risks from Price Fixing and Anti-Competitive Behavior in the Food Supply Chain",
    "summary": "The order identifies an affordable and secure food supply as vital to national and economic security and characterizes price fixing and anti-competitive practices as risks to that supply. It notes concerns about foreign-controlled corporations contributing to instability and outlines the federal government's approach to mitigating these risks, including assessing vulnerabilities in the food supply chain, promoting competition, and coordinating actions across federal agencies to strengthen resilience and safeguard the supply chain.",
    "link": "https://www.whitehouse.gov/presidential-actions/2025/12/addressing-security-risks-from-price-fixing-and-anti-competitive-behavior-in-the-food-supply-chain/"
  },
  {
    "title": "Proclamation by the President of the United States Honoring the Memory of Specialist Sarah Beckstrom, West Virginia Army National Guard",
    "summary": "A presidential proclamation announcing that the flag of the United States will be flown at half-staff as a mark of respect for Specialist Sarah Beckstrom, a member of the West Virginia Army National Guard. The proclamation memorializes her service and directs that national flags be displayed at half-staff in observance of her memory, reflecting the standard practice for honoring fallen service members.",
    "link": "https://www.whitehouse.gov/presidential-actions/2025/12/honoring-the-memory-of-specialist-sarah-beckstrom-west-virginia-army-national-guard/"
  },
  {
    "title": "Presidential Message on the Anniversary of the Monroe Doctrine (America 250 Initiative)",
    "summary": "This presidential action presents a message commemorating the Monroe Doctrine and reaffirming the United States' commitment to defend the homeland, national interests, and the well-being of its citizens, echoing the 1823 assertion that the United States will not waver in these defenses. The message places this reaffirmation in the context of the America 250 initiative.",
    "link": "https://www.whitehouse.gov/presidential-actions/2025/12/america-250-presidential-message-on-the-anniversary-of-the-monroe-doctrine/"
  },
  {
    "title": "America 250 Presidential Message Commemorating Mark Twain's 190th Birthday",
    "summary": "The White House issued a presidential message under the America 250 initiative to commemorate the 190th birthday of Mark Twain. The message describes Twain as a major American author whose works and public persona have influenced American literature and culture, and it highlights his use of humor and storytelling. It notes Twain's enduring impact on American life and values, and it places the commemoration within the broader context of the America 250 program, reflecting on the nation's effort to honor historical figures who have shaped the national narrative.",
    "link": "https://www.whitehouse.gov/presidential-actions/2025/11/america-250-presidential-message-on-mark-twains-190th-birthday/"
  }
]