[
  {
    "title": "Presidential Letter Regarding Military Strike on Iranian Nuclear Facilities",
    "summary": "The President communicated to the Speaker of the House and the President Pro Tempore of the Senate about a military operation conducted on June 21, 2025, in which United States forces executed a precision strike against three nuclear facilities in Iran. The operation aimed to address Iran's nuclear weapons development program and to further U.S. national security interests. The letter provides details about the timing, objectives, and strategic considerations of the military action.",
    "link": "https://www.whitehouse.gov/presidential-actions/2025/06/text-of-a-letter-from-the-president-to-the-speaker-of-the-house-of-representatives/"
  },
  {
    "title": "Order to Further Extend Enforcement Delay Related to TikTok Under Executive Order 14166",
    "summary": "This presidential order extends the enforcement delay specified in Executive Order 14166 issued on January 20, 2025, which pertains to the application of the Protecting Americans from Foreign Adversary Controlled Applications Act to TikTok. The extension maintains the current enforcement delay related to TikTok's compliance requirements under that order for an additional period. The order is issued under the authority vested in the President by the Constitution and the laws of the United States.",
    "link": "https://www.whitehouse.gov/presidential-actions/2025/06/further-extending-the-tiktok-enforcement-delay/"
  },
  {
    "title": "Presidential Proclamation Marking the 250th Anniversary of the Battle of Bunker Hill",
    "summary": "The President issued a proclamation commemorating the 250th anniversary of the Battle of Bunker Hill, recognizing the historical significance of the event and honoring the bravery of the individuals involved in the American Revolutionary War during that historic battle.",
    "link": "https://www.whitehouse.gov/presidential-actions/2025/06/250th-anniversary-of-the-battle-of-bunker-hill/"
  },
  {
    "title": "Nomination of Individuals for Various Positions in the Department of State and Department of Veterans Affairs",
    "summary": "The President has submitted nominations to the Senate for appointments including Riley Barnes as Assistant Secretary of State for Democracy, Human Rights, and Labor; Alan Boehme as Assistant Secretary of Veterans Affairs for Information and Technology; Karen Brazell as Under Secretary for Benefits at the Department of Veterans Affairs; and Jeremy Carl for an additional position. These nominations are part of the process to fill multiple senior roles within the federal government agencies.",
    "link": "https://www.whitehouse.gov/presidential-actions/2025/06/nominations-sent-to-the-senate-3c08/"
  },
  {
    "title": "Proclamation Recognizing Father's Day 2025",
    "summary": "The proclamation acknowledges the role of fathers as custodians of strength, leaders within families, and protectors of security and safety. It expresses appreciation for fathers' love, devotion, and examples set to inspire future generations, and recognizes the significance of Father's Day as a time to honor these contributions.",
    "link": "https://www.whitehouse.gov/presidential-actions/2025/06/fathers-day-2025/"
  },
  {
    "title": "Proclamation Recognizing Flag Day and National Flag Week in 2025",
    "summary": "The proclamation commemorates June 14, 1777, as the date when the Continental Congress adopted the flag of the United States, establishing the Stars and Stripes as the national flag. It also designates the week centered around Flag Day to promote patriotism and awareness of the flag's history and significance during the year 2025.",
    "link": "https://www.whitehouse.gov/presidential-actions/2025/06/flag-day-and-national-flag-week-2025/"
  },
  {
    "title": "Order Regarding the Proposed Acquisition of United States Steel Corporation by Nippon Steel Corporation",
    "summary": "This executive order authorizes a review process by the Committee on Foreign Investment in the United States (CFIUS) concerning the proposed acquisition of United States Steel Corporation by Nippon Steel Corporation. The order uses authority granted under the Defense Production Act of 1950, as amended, to evaluate national security implications related to the acquisition and to determine whether further actions are warranted.",
    "link": "https://www.whitehouse.gov/presidential-actions/2025/06/regarding-the-proposed-acquisition-of-the-united-states-steel-corporation-by-nippon-steel-corporation/"
  },
  {
    "title": "Proclamation Celebrating the 250th Anniversary of the Establishment of the United States Army",
    "summary": "A presidential proclamation commemorating the 250th anniversary of the founding of the United States Army, which was established by the Second Continental Congress on June 14, 1775. The proclamation highlights the historical significance of the Army's formation and acknowledges its ongoing role in the nation's history, strength, service, and values.",
    "link": "https://www.whitehouse.gov/presidential-actions/2025/06/250th-anniversary-of-the-founding-of-the-united-states-army/"
  }
]