[
  {
    "title": "Proclamation Adjusting Imports of Timber, Lumber, and Their Derivative Products into the United States",
    "summary": "This proclamation notes that on July 1, 2025, the Secretary of Commerce transmitted a report regarding the impact of imports of timber, lumber, and their derivative products on the United States' national security under section 232 of the Trade Expansion Act of 1962. Relying on the findings of the investigation and the President's authority, the proclamation authorizes adjustments to the importation of these wood products into the United States in order to address identified national security concerns.",
    "link": "https://www.whitehouse.gov/presidential-actions/2025/09/adjusting-imports-of-timber-lumber-and-their-derivative-products-into-the-united-states/"
  },
  {
    "title": "Executive Order on the Continuance of Certain Federal Advisory Committees",
    "summary": "This presidential action, issued under the authority of the Constitution and applicable laws, continues the operation of certain federal advisory committees listed in the order under the Federal Advisory Committee Act (5 U.S.C. Chapter 10). Section 1 directs that each advisory committee named in the order is continued through September 30, 2027, ensuring their continued existence and ability to carry out advisory functions through that date. The order cites authority under chapter 10 of title 5, United States Code, and applies to the committees listed within the order.",
    "link": "https://www.whitehouse.gov/presidential-actions/2025/09/continuance-of-certain-federal-advisory-committees/"
  },
  {
    "title": "Memorandum on Federal Enforcement of Death Penalty Laws in the District of Columbia for Severe Crimes",
    "summary": "A presidential memorandum directed to the Attorney General and the United States Attorney for the District of Columbia, citing constitutional and statutory authority, outlining the administration’s plan to enforce federal death penalty provisions within the District of Columbia in cases involving the most serious offenses. The document describes objectives related to deterrence and punishment, identifies the scope of cases eligible for federal capital punishment, and discusses procedural and coordination considerations among federal agencies to ensure compliance with legal requirements and due process in such prosecutions.",
    "link": "https://www.whitehouse.gov/presidential-actions/2025/09/enforcing-the-death-penalty-laws-in-the-district-of-columbia-to-deter-and-punish-the-most-heinous-crimes/"
  },
  {
    "title": "Executive Order to Regulate Foreign Adversary Controlled Applications Under the Protecting Americans from Foreign Adversary Controlled Applications Act, Including TikTok",
    "summary": "The Executive Order directs federal agencies to implement measures authorized by the Protecting Americans from Foreign Adversary Controlled Applications Act (Public Law 118-50, Division H) to address applications designated as foreign adversary controlled, with a focus on TikTok and similar platforms. It outlines the Act's objective to regulate such applications and describes authorities and responsibilities for interagency risk assessment, data protection, access controls, and compliance monitoring. The order directs actions to protect national security by evaluating data handling practices, restricting risky operations where appropriate, and overseeing enforcement and reporting. It emphasizes maintaining lawful user access where feasible while implementing safeguards and requires ongoing coordination among agencies to implement the Act's requirements.",
    "link": "https://www.whitehouse.gov/presidential-actions/2025/09/saving-tiktok-while-protecting-national-security/"
  }
]