[
  {
    "title": "Establishment of the National Energy Dominance Council",
    "summary": "This executive order establishes the National Energy Dominance Council to promote the utilization of the United States' natural resources and enhance the country’s energy leadership through innovative technologies. The Council will focus on policies that support economic prosperity and ensure national security by leveraging the abundance of America's energy resources.",
    "link": "https://www.whitehouse.gov/presidential-actions/2025/02/establishing-the-national-energy-dominance-council/"
  },
  {
    "title": "Nominations Submitted for Senate Confirmation",
    "summary": "The document outlines several nominations made for positions within the federal government that are sent to the Senate for confirmation. The nominees include Gary Andres from Virginia, who is nominated for the position of Assistant Secretary of Health and Human Services; Daniel Aronowitz from Virginia, nominated for the position of Assistant Secretary of Labor; James Baehr from Louisiana, nominated to serve as General Counsel for the Department of Veterans Affairs; and Kirsten Baesler from North Dakota, nominated for the role of Assistant Secretary for Elementary and Secondary Education, among others.",
    "link": "https://www.whitehouse.gov/presidential-actions/2025/02/nominations-sent-to-the-senate/"
  },
  {
    "title": "Proclamation on Adjusting Aluminum Imports Based on National Security Considerations",
    "summary": "This proclamation addresses the findings of a report submitted by the Secretary of Commerce regarding the implications of aluminum imports on U.S. national security, following an investigation conducted under section 232 of the Trade Expansion Act of 1962. The document outlines the assessment of the aluminum industry and its potential risks to national security, aiming to inform policy decisions regarding import adjustments.",
    "link": "https://www.whitehouse.gov/presidential-actions/2025/02/adjusting-imports-of-aluminum-into-the-united-states/"
  },
  {
    "title": "Announcement of the President's Intelligence Advisory Board",
    "summary": "President Donald J. Trump has announced the establishment of the President's Intelligence Advisory Board (PIAB), which will consist of a select group of individuals. This board is tasked with providing advice to the President on key national security issues and monitoring the activities of the Intelligence Community to ensure alignment with the President's strategic objectives.",
    "link": "https://www.whitehouse.gov/presidential-actions/2025/02/president-trump-announces-the-presidents-intelligence-advisory-board/"
  },
  {
    "title": "Proclamation on Adjusting Steel Imports into the United States",
    "summary": "This proclamation addresses the adjustments made to the importation of steel into the United States following discussions and agreements with various countries, including the Argentine Republic and the Commonwealth of Australia. The proclamation outlines the outcomes of these discussions and their implications for trade and import policies related to steel. It emphasizes the importance of adhering to the established agreements in order to manage imports sustainably and in accordance with the international trade framework.",
    "link": "https://www.whitehouse.gov/presidential-actions/2025/02/adjusting-imports-of-steel-into-the-united-states/"
  },
  {
    "title": "Temporary Suspension of Enforcement of the Foreign Corrupt Practices Act to Support Economic and National Security",
    "summary": "This executive order outlines the temporary suspension of the enforcement of the Foreign Corrupt Practices Act (FCPA), a law originally enacted in 1977 that prohibits U.S. companies from making corrupt payments to foreign officials to obtain or retain business. The suspension is positioned as a measure to bolster American economic interests and enhance national security. The order articulates that this pause in enforcement will allow for a review of the Act's impact on American businesses and international competitiveness, with a consideration of the balance between regulatory requirements and economic growth. The policy aims to reassess how best to achieve both anti-corruption objectives and support for American enterprises in the global market.",
    "link": "https://www.whitehouse.gov/presidential-actions/2025/02/pausing-foreign-corrupt-practices-act-enforcement-to-further-american-economic-and-national-security/"
  }
]