[
  {
    "title": "Presidential Executive Order Extending Enforcement Delay for TikTok Regulations",
    "summary": "This executive order, issued by the President, extends the period during which enforcement actions related to the application of the Protecting Americans from Foreign Adversary Controlled Applications Act to TikTok are delayed, building upon the previous extension specified in Executive Order 14166 issued on January 20, 2025.",
    "link": "https://www.whitehouse.gov/presidential-actions/2025/06/further-extending-the-tiktok-enforcement-delay/"
  },
  {
    "title": "Proclamation Recognizing the 250th Anniversary of the Battle of Bunker Hill",
    "summary": "The proclamation commemorates the 250th anniversary of the Battle of Bunker Hill, highlighting the historical significance of the event and honoring the courage of the individuals involved in this pivotal moment during the American Revolutionary War.",
    "link": "https://www.whitehouse.gov/presidential-actions/2025/06/250th-anniversary-of-the-battle-of-bunker-hill/"
  },
  {
    "title": "Nominations Submitted to the Senate for Various Government Positions",
    "summary": "The President has submitted multiple nominations to the Senate for appointment to various positions within the federal government, including roles related to democracy, human rights, labor, veterans' affairs, and information technology. The individuals nominated hold or have held positions in different states and professional backgrounds relevant to their proposed roles.",
    "link": "https://www.whitehouse.gov/presidential-actions/2025/06/nominations-sent-to-the-senate-3c08/"
  },
  {
    "title": "Proclamation Recognizing Father's Day 2025",
    "summary": "The presidential proclamation honors fathers as custodians of strength, family leaders, and protectors of security and safety. It pays tribute to the love, devotion, and example set by fathers and acknowledges their role in shaping the next generation. The proclamation is issued in observance of Father's Day 2025.",
    "link": "https://www.whitehouse.gov/presidential-actions/2025/06/fathers-day-2025/"
  },
  {
    "title": "Proclamation on Flag Day and National Flag Week, 2025",
    "summary": "This proclamation commemorates Flag Day and National Flag Week in 2025, highlighting the historical significance of June 14, 1777, when the Second Continental Congress adopted the flag of the United States, and emphasizes the importance of recognizing the American flag as a symbol of national identity and unity. The document marks the occasion with reflections on the history and meaning of the flag, supporting the observance of the week dedicated to its celebration.",
    "link": "https://www.whitehouse.gov/presidential-actions/2025/06/flag-day-and-national-flag-week-2025/"
  },
  {
    "title": "Order for Review of Proposed Acquisition of United States Steel Corporation by Nippon Steel Corporation",
    "summary": "This executive order authorizes the Committee on Foreign Investment in the United States to review a proposed acquisition of the United States Steel Corporation by Nippon Steel Corporation, as part of the president's authority under the Defense Production Act of 1950, Section 721, to evaluate national security considerations related to the transaction.",
    "link": "https://www.whitehouse.gov/presidential-actions/2025/06/regarding-the-proposed-acquisition-of-the-united-states-steel-corporation-by-nippon-steel-corporation/"
  },
  {
    "title": "250th Anniversary of the Founding of the United States Army",
    "summary": "This proclamation marks the 250th anniversary of the founding of the United States Army, which was established by the Second Continental Congress on June 14, 1775. The document recognizes the history of the Army's service, strength, and discipline over two and a half centuries and celebrates its role in the nation's history.",
    "link": "https://www.whitehouse.gov/presidential-actions/2025/06/250th-anniversary-of-the-founding-of-the-united-states-army/"
  }
]