[
  {
    "title": "Nominations Sent to the Senate for United States Attorney for the District of Nevada and for Assistant Secretaries of State and the Interior",
    "summary": "The President transmitted nominations to the Senate for three positions: George Kelesis, of Nevada, to be United States Attorney for the District of Nevada for a four-year term, to succeed Jason M. Frierson; Catherine Dillon, of Maryland, to be an Assistant Secretary of State (Educational and Cultural Affairs), to succeed Lee Satterfield; and William Hague, of Washington, to be an Assistant Secretary of the Interior. The notice appears on the White House 'Nominations Sent to the Senate' page.",
    "link": "https://www.whitehouse.gov/presidential-actions/2026/02/nominations-sent-to-the-senate-b65f/"
  },
  {
    "title": "Presidential Action to Strengthen United States National Defense Through Clean Coal Power Generation Fleet",
    "summary": "This presidential action addresses the resilience and reliability of the electric grid that supports military installations, operations, and defense industrial production. It proposes expanding a fleet of clean coal power generation facilities as part of a strategy to reduce dependence on intermittent energy sources and to ensure a stable energy supply for national defense and related economic activity. The measure aims to enhance grid stability and security in the face of potential energy disruptions and outlines considerations for integrating clean coal capacity with defense infrastructure.",
    "link": "https://www.whitehouse.gov/presidential-actions/2026/02/strengthening-united-states-national-defense-with-americas-beautiful-clean-coal-power-generation-fleet/"
  },
  {
    "title": "Presidential Action Addressing Threats to the United States by the Government of Iran",
    "summary": "This presidential action, issued under the International Emergency Economic Powers Act, the National Emergencies Act, and additional authorities including section 604 of the Trade Act of 1974 and related provisions, addresses threats to the United States attributed to the Government of Iran. The document specifies the legal basis for the action, the authorized measures, and the intended implementation to address those threats.",
    "link": "https://www.whitehouse.gov/presidential-actions/2026/02/addressing-threats-to-the-united-states-by-the-government-of-iran/"
  },
  {
    "title": "Proclamation by the President of the United States: National Black History Month, 2026",
    "summary": "This proclamation designates February 2026 as National Black History Month and acknowledges the contributions of Black Americans to the United States over more than two centuries. It references the nation's 250th anniversary of independence and highlights the historical significance and ongoing impact of Black Americans on the nation's development and culture.",
    "link": "https://www.whitehouse.gov/presidential-actions/2026/02/national-black-history-month-2026/"
  }
]