[
  {
    "title": "Exclusions from Federal Labor-Management Relations Programs",
    "summary": "This executive order is issued under the constitutional authority of the President, aimed at enhancing the national security of the United States. It includes determinations regarding specific exclusions from certain federal labor-management relations programs. The order references legal provisions in Title 5 and Title 22 of the U.S. Code, and outlines the responsibilities and requirements for various agencies in implementing these exclusions.",
    "link": "https://www.whitehouse.gov/presidential-actions/2025/03/exclusions-from-federal-labor-management-relations-programs/"
  },
  {
    "title": "Executive Order on Promoting Accurate Historical Narratives",
    "summary": "This executive order aims to address the perceived alterations to American history that have emerged in recent years. It emphasizes the importance of maintaining objective historical facts and outlines the administration's policy goals regarding the teaching and presentation of American history in educational and public contexts. The order seeks to ensure that factual accuracy prevails in historical narratives shared across various platforms and institutions.",
    "link": "https://www.whitehouse.gov/presidential-actions/2025/03/restoring-truth-and-sanity-to-american-history/"
  },
  {
    "title": "Executive Order on Addressing Risks Associated with Certain Law Firms",
    "summary": "This executive order outlines the commitment of the U.S. Administration to address potential risks posed by large law firms, particularly those identified as 'Big Law.' The order emphasizes the need to monitor and mitigate the adverse conduct of these firms that may conflict with critical American interests. The directive aims to put in place measures that ensure law firms operate within parameters that uphold the national interest.",
    "link": "https://www.whitehouse.gov/presidential-actions/2025/03/addressing-risks-from-wilmerhale/"
  },
  {
    "title": "Executive Order on Addressing Risks Associated with Large Law Firms",
    "summary": "This Executive Order outlines the commitment of the Administration to mitigate risks posed by large law firms, often referred to as 'Big Law', which may engage in practices harmful to important national interests. The order establishes a directive to identify and address behaviors that could threaten these interests, aiming to enhance oversight and accountability within the legal sector.",
    "link": "https://www.whitehouse.gov/presidential-actions/2025/03/addressing-risks-from-jenner-block/"
  },
  {
    "title": "Preservation and Protection of Elections Integrity in the United States",
    "summary": "This executive order outlines the intention to enhance election integrity in the United States by implementing modern election protection measures. It emphasizes the need for the United States to adopt necessary practices for safeguarding elections that are standard in both developed and developing nations. The order seeks to address current shortcomings in the enforcement of election protections, thereby aiming to strengthen the democratic process.",
    "link": "https://www.whitehouse.gov/presidential-actions/2025/03/preserving-and-protecting-the-integrity-of-american-elections/"
  },
  {
    "title": "Executive Order on Enhancing Financial Integrity and Operational Efficiency in Federal Disbursements",
    "summary": "This executive order outlines measures aimed at promoting financial integrity and operational efficiency within the Federal Government. It emphasizes the government's responsibility to manage the disbursement of trillions of dollars annually to individuals, businesses, and organizations, and aims to implement strategies to reduce fraud, waste, and abuse in these financial transactions.",
    "link": "https://www.whitehouse.gov/presidential-actions/2025/03/protecting-americas-bank-account-against-fraud-waste-and-abuse/"
  },
  {
    "title": "Immediate Declassification of Materials Related to the FBI's Crossfire Hurricane Investigation",
    "summary": "This memorandum outlines the directive from the President to declassify materials associated with the Federal Bureau of Investigation's Crossfire Hurricane investigation. The aim is to promote transparency regarding this investigation, utilizing the authority granted to the President by the U.S. Constitution and federal law. The memorandum specifically addresses the Attorney General, the Director of National Intelligence, and the Director of the Central Intelligence Agency, indicating that the immediate release of these materials is warranted.",
    "link": "https://www.whitehouse.gov/presidential-actions/2025/03/immediate-declassification-of-materials-related-to-the-federal-bureau-of-investigations-crossfire-hurricane-investigation/"
  },
  {
    "title": "Executive Order on the Modernization of Federal Payment Systems",
    "summary": "This executive order aims to address the use of paper-based payment methods by the Federal Government, such as checks and money orders. It outlines the intention to modernize the payment systems for transactions involving the United States General Fund, thereby enhancing efficiency and optimizing financial processes. The order seeks to improve the overall management of government payments to align with contemporary technological standards.",
    "link": "https://www.whitehouse.gov/presidential-actions/2025/03/modernizing-payments-to-and-from-americas-bank-account/"
  }
]