[
  {
    "title": "Guidance on the Enforcement of Federal Rule of Civil Procedure 65(c)",
    "summary": "This memorandum outlines directives for the heads of executive departments and agencies concerning the enforcement of Federal Rule of Civil Procedure 65(c). It addresses recent instances where activist organizations, supported by significant financial contributions and government grants, have received broad injunctions that exceed the intended relief under the Federal Rules. The memorandum emphasizes the importance of adhering to established legal standards and procedural frameworks in the issuance and enforcement of such injunctions.",
    "link": "https://www.whitehouse.gov/presidential-actions/2025/03/ensuring-the-enforcement-of-federal-rule-of-civil-procedure-65c/"
  },
  {
    "title": "Nominations Submitted to the Senate for Confirmation",
    "summary": "The President has submitted nominations to the Senate for confirmation, including Richard Anderson of Virginia for the position of Assistant Secretary of the Air Force and John Arrigo of Florida as Ambassador Extraordinary and Plenipotentiary to the Portuguese Republic. Additional nominees include Thomas Barrack of Colorado for another diplomatic position. These nominations are part of the process where the Senate reviews and confirms individuals appointed to key government roles.",
    "link": "https://www.whitehouse.gov/presidential-actions/2025/03/nominations-sent-to-the-senate-8355/"
  },
  {
    "title": "Restoration of the Public Service Loan Forgiveness Program",
    "summary": "This executive order aims to restore and enhance the Public Service Loan Forgiveness (PSLF) Program, originally established by Congress in 2007. The PSLF Program was designed to incentivizeAmericans to pursue careers in public service by providing a pathway for the forgiveness of federal student loans after a certain period of qualifying employment. The order outlines the intent to address and resolve issues that have previously hindered the effectiveness of the program, ensuring that eligible borrowers receive the benefits promised under its guidelines.",
    "link": "https://www.whitehouse.gov/presidential-actions/2025/03/restoring-public-service-loan-forgiveness/"
  },
  {
    "title": "Establishment of a Task Force for the FIFA World Cup 2026",
    "summary": "This executive order establishes a task force to prepare for the United States' role as a host nation for the FIFA World Cup 2026 and the FIFA Club World Cup 2025. The task force is intended to coordinate efforts and resources among relevant federal, state, and local agencies to ensure a successful international sporting event. The order outlines the responsibilities and objectives of the task force in anticipation of these major events.",
    "link": "https://www.whitehouse.gov/presidential-actions/2025/03/establishing-the-white-house-task-force-on-the-fifa-world-cup-2026/"
  }
]