[
  {
    "title": "Executive Order on Adjustments of Certain Rates of Pay",
    "summary": "This executive order establishes the adjusted rates of basic pay for statutory pay systems, as defined in 5 U.S.C. 5302(1), with adjustments made under 5 U.S.C. 5303. Specifically, Section 1 sets the rates of basic pay or salaries for these statutory pay systems at the adjusted levels and cites the statutory authority for these adjustments.",
    "link": "https://www.whitehouse.gov/presidential-actions/2025/12/adjustments-of-certain-rates-of-pay/"
  },
  {
    "title": "Executive Order to Maintain United States Space Superiority",
    "summary": "This executive order establishes national policy to preserve and advance United States space superiority. It characterizes space leadership as fundamental to national security, economic vitality, and scientific progress, and directs federal agencies to coordinate policy and budgeting, develop and deploy space systems and technologies, enhance the resilience and security of space infrastructure, and engage with international partners to maintain a robust competitive position, with oversight and accountability mechanisms to monitor implementation.",
    "link": "https://www.whitehouse.gov/presidential-actions/2025/12/ensuring-american-space-superiority/"
  },
  {
    "title": "Executive Order Directing the Closure of Federal Executive Departments and Agencies on December 24, 2025, and December 26, 2025",
    "summary": "This presidential executive order, issued under the President's constitutional and statutory authority, directs all executive departments and agencies of the federal government to close and to excuse their employees from duty on Wednesday, December 24, 2025, and Friday, December 26, 2025. The order requires agency heads to implement the closure and take the necessary steps to comply with the directive on the specified dates.",
    "link": "https://www.whitehouse.gov/presidential-actions/2025/12/providing-for-the-closure-of-executive-departments-and-agencies-of-the-federal-government-on-december-24-2025-and-december-26-2025/"
  },
  {
    "title": "Executive Action to Increase Medical Marijuana and Cannabidiol Research",
    "summary": "This executive action asserts the President's authority to advance medical research by increasing federal capacity to study medical uses of marijuana and cannabidiol, references the FDA's 2023 review, and emphasizes a policy goal of providing access to advanced medical treatments and robust research infrastructure.",
    "link": "https://www.whitehouse.gov/presidential-actions/2025/12/increasing-medical-marijuana-and-cannabidiol-research/"
  },
  {
    "title": "Executive Order Reinstating Restrictions on Entry of Foreign Nationals to Protect the Security of the United States",
    "summary": "This Executive Order reinstates restrictions on the entry of certain foreign nationals into the United States with the aim of reducing national security and public safety risks at the border. It notes that prior restrictions were upheld by the Supreme Court and ties the current measures to Executive Order 14161, issued January 20, 2025, under the broader framework of Protecting the United States From Foreign Terrorists and Other National Security Threats. The order describes the continuation of these entry-control policies and their implementation at U.S. borders and immigration processing.",
    "link": "https://www.whitehouse.gov/presidential-actions/2025/12/restricting-and-limiting-the-entry-of-foreign-nationals-to-protect-the-security-of-the-united-states/"
  }
]