[
  {
    "title": "Memorandum on Addressing Discrimination and Equity Ideology in the Foreign Service",
    "summary": "This memorandum outlines the policy directives aimed at addressing discrimination and the application of equity ideology within the Foreign Service. It identifies various departmental leaders and agency heads who are expected to implement measures that align with this initiative. The document emphasizes the importance of ensuring that the Foreign Service operates without bias and promotes equitable practices in its operations and employee interactions. It signals a call for the evaluation and reform of existing policies that may contribute to discriminatory practices.",
    "link": "https://www.whitehouse.gov/presidential-actions/2025/03/removing-discrimination-and-discriminatory-equity-ideology-from-the-foreign-service/"
  },
  {
    "title": "Enhancing National Security Through State and Local Infrastructure Investments",
    "summary": "This Executive Order aims to promote effective strategies and investments by state and local governments to strengthen national security and enhance the resilience of the nation. It emphasizes the necessity for federal policies to appropriately acknowledge the roles that state and local efforts play in the development and maintenance of infrastructure critical to national security. The order establishes a framework for collaboration and efficiency in preparedness activities across various levels of government.",
    "link": "https://www.whitehouse.gov/presidential-actions/2025/03/test/"
  },
  {
    "title": "Proclamation Regarding Tren de Aragua as a Foreign Terrorist Organization",
    "summary": "This proclamation formally designates Tren de Aragua (TdA) as a Foreign Terrorist Organization due to its significant presence and activities within the United States. The organization has been identified as having thousands of members, some of whom are alleged to have unlawfully entered the United States and are reportedly engaging in irregular warfare and hostile actions against U.S. interests. The proclamation cites concerns over TdA's operations and its potential threat to national security.",
    "link": "https://www.whitehouse.gov/presidential-actions/2025/03/invocation-of-the-alien-enemies-act-regarding-the-invasion-of-the-united-states-by-tren-de-aragua/"
  },
  {
    "title": "Guidance on the Enforcement of Federal Rule of Civil Procedure 65(c)",
    "summary": "This memorandum outlines directives for the heads of executive departments and agencies to ensure compliance with Federal Rule of Civil Procedure 65(c). It addresses concerns regarding the broad injunctions being issued by activist organizations, which have reportedly exceeded the intended scope of relief defined by the Federal Rules. The memorandum emphasizes the importance of adhering to the established legal framework in the issuance and enforcement of such injunctions.",
    "link": "https://www.whitehouse.gov/presidential-actions/2025/03/ensuring-the-enforcement-of-federal-rule-of-civil-procedure-65c/"
  },
  {
    "title": "Presidential Nominations Submitted to the Senate",
    "summary": "This document outlines the nominations made by the President to the United States Senate, including Richard Anderson for the position of Assistant Secretary of the Air Force, John Arrigo to serve as Ambassador Extraordinary and Plenipotentiary to the Portuguese Republic, and Thomas Barrack for an unspecified ambassadorial position. The document provides the names and proposed roles of nominees put forward for Senate consideration as part of the executive nomination process.",
    "link": "https://www.whitehouse.gov/presidential-actions/2025/03/nominations-sent-to-the-senate-8355/"
  },
  {
    "title": "Restoration of the Public Service Loan Forgiveness Program",
    "summary": "This executive order aims to restore and improve the Public Service Loan Forgiveness (PSLF) Program, which was established by Congress in 2007 to incentivize individuals to pursue careers in public service by offering loan forgiveness for eligible federal student loans. The order lays out the intention to enhance access to the program and ensure that qualifying public service employees can benefit from student loan forgiveness as originally intended.",
    "link": "https://www.whitehouse.gov/presidential-actions/2025/03/restoring-public-service-loan-forgiveness/"
  }
]