[
  {
    "title": "Proclamation Restricting Entry of Certain Nonimmigrant Workers",
    "summary": "A presidential proclamation that restricts the entry of certain nonimmigrant workers into the United States. The document notes concerns that the H-1B visa program has been used to replace American workers with lower-paid, lower-skilled labor rather than supplementing the domestic workforce, and it outlines the scope and implementation of restrictions on entry under specified nonimmigrant programs to protect American workers.",
    "link": "https://www.whitehouse.gov/presidential-actions/2025/09/restriction-on-entry-of-certain-nonimmigrant-workers/"
  },
  {
    "title": "Proclamation for National POW/MIA Recognition Day, 2025",
    "summary": "A proclamation issued by the President of the United States designates National POW/MIA Recognition Day for 2025 and commemorates U.S. service members who were captured, held as prisoners of war, or listed as missing in action. The document acknowledges the historical sacrifices of servicemembers from earlier conflicts and emphasizes the government's ongoing commitment to accounting for missing personnel and supporting their families and communities. The proclamation also calls for national remembrance and appropriate observances.",
    "link": "https://www.whitehouse.gov/presidential-actions/2025/09/national-pow-mia-recognition-day-2025/"
  },
  {
    "title": "Executive Order Reassessing Immigration Policies Implemented by the Prior Administration",
    "summary": "This executive order, issued by the President, asserts constitutional and statutory authority to issue directives modifying or reversing immigration policies implemented by the prior administration. Section 1 outlines the purpose as reversing those prior policies and notes that they contributed to a large number of immigrant arrivals, with insufficient consideration of how they were implemented. The order indicates the administration will reassess immigration policy and enforcement to better manage immigration flows, with further provisions detailing the scope and methods of policy changes.",
    "link": "https://www.whitehouse.gov/presidential-actions/2025/09/the-gold-card/"
  },
  {
    "title": "Presidential Memorandum: Restoring Law and Order in Memphis",
    "summary": "A presidential memorandum directing the coordination of federal agencies to assist Memphis authorities in addressing public safety and law enforcement challenges. The memorandum instructs the Secretary of the Treasury, Secretary of Defense, Attorney General, Secretary of Health and Human Services, Secretary of Housing and Urban Development, Secretary of Transportation, Secretary of Homeland Security, and other specified officials to collaborate with local authorities, assess needs, and implement measures using available federal resources to support law enforcement, public safety, and related operations in Memphis. The objective is to restore public order and safety while coordinating interagency actions and ensuring compliance with applicable laws and policies.",
    "link": "https://www.whitehouse.gov/presidential-actions/2025/09/restoring-law-and-order-in-memphis/"
  },
  {
    "title": "Presidential Proclamation: Patriot Day 2025, the 24th Anniversary of the September 11 Attacks",
    "summary": "A presidential proclamation designates September 11, 2025 as Patriot Day to commemorate the 24th anniversary of the September 11, 2001 terrorist attacks. The proclamation calls on government agencies and the public to observe appropriate remembrance ceremonies, moments of reflection, and other activities to honor victims and first responders.",
    "link": "https://www.whitehouse.gov/presidential-actions/2025/09/patriot-day-2025-the-24th-annivresary-of-the-september-11-terrorist-attacks/"
  }
]