[
  {
    "title": "Presidential Proclamation Directing the United States Flag to be Flown at Half-Staff in Memory of Charlie Kirk",
    "summary": "A proclamation issued by the President directs that the flag of the United States be flown at half-staff for a specified period as a mark of respect for the memory of Charlie Kirk. The proclamation refers to authority vested in the President by the Constitution and federal law and defines the duration of the half-staff observance.",
    "link": "https://www.whitehouse.gov/presidential-actions/2025/09/honoring-the-memory-of-charlie-kirk/"
  },
  {
    "title": "Presidential Action Implementing the United States–Japan Agreement",
    "summary": "This presidential action, issued under authorities including the International Emergency Economic Powers Act, the National Emergencies Act, and section 232 of the Trade Expansion Act of 1962, directs the implementation of the United States–Japan Agreement. It delineates the legal authorities invoked, the objectives of implementing the agreement, and the framework for applying its provisions. The action directs relevant federal agencies to take the necessary steps to carry out the agreement, and establishes procedures for compliance, reporting, and potential adjustments as permitted by law.",
    "link": "https://www.whitehouse.gov/presidential-actions/2025/09/implementing-the-united-states-japan-agreement/"
  },
  {
    "title": "Tammy Bruce Nominated for Deputy United States Representative to the United Nations and Deputy Representative to the United Nations Security Council",
    "summary": "This notice announces the nomination of Tammy Bruce of California to serve as the Deputy Representative of the United States to the United Nations, with the rank of Ambassador Extraordinary and Plenipotentiary, and as Deputy Representative to the United Nations Security Council. The nomination also indicates that she would serve concurrently in a related capacity without additional compensation, as specified in the nomination.",
    "link": "https://www.whitehouse.gov/presidential-actions/2025/09/nominations-sent-to-the-senate-8a96/"
  }
]