[
  {
    "title": "Adjustments of Certain Rates of Pay",
    "summary": "This executive order, issued by the President under constitutional and statutory authority, adjusts the rates of basic pay for the statutory pay systems as defined in 5 U.S.C. 5302(1). The adjustments are made under 5 U.S.C. 5303. Section 1 concerns Statutory Pay Systems and states that the rates of basic pay or salaries for these systems are set at the adjusted levels. The order applies to federal employees covered by the statutory pay schedules and establishes the updated pay rates in accordance with applicable law.",
    "link": "https://www.whitehouse.gov/presidential-actions/2025/12/adjustments-of-certain-rates-of-pay/"
  },
  {
    "title": "Executive Order on Maintaining American Space Leadership",
    "summary": "This executive order, issued under the President's constitutional and statutory authority, articulates the purpose of maintaining American leadership in space as a national objective. The provided opening section, labeled Section 1: Purpose, states that leadership in space reflects national vision and will, and that the technologies developed to achieve space leadership contribute to the United States' strength, security, and prosperity. The excerpt indicates the document begins by outlining high-level objectives and signals that subsequent provisions will address actions to prioritize space capability development and interagency coordination to sustain United States leadership in space domains.",
    "link": "https://www.whitehouse.gov/presidential-actions/2025/12/ensuring-american-space-superiority/"
  },
  {
    "title": "Providing for the Closure of Executive Departments and Agencies of the Federal Government on December 24, 2025, and December 26, 2025",
    "summary": "Executive Order directing the temporary closure of all executive departments and agencies of the Federal Government and excusing their employees from duty on Wednesday, December 24, 2025, and Friday, December 26, 2025, under the President’s constitutional and legal authority.",
    "link": "https://www.whitehouse.gov/presidential-actions/2025/12/providing-for-the-closure-of-executive-departments-and-agencies-of-the-federal-government-on-december-24-2025-and-december-26-2025/"
  },
  {
    "title": "Executive Order to Increase Medical Marijuana and Cannabidiol Research",
    "summary": "This executive action directs federal agencies to expand and coordinate research on the medical uses of marijuana and cannabidiol (CBD). It aims to reduce regulatory barriers to conducting federally regulated cannabis research, improve access to research materials for approved studies, and promote interagency collaboration for study design, funding, data collection, and dissemination of findings while ensuring compliance with safety and privacy requirements.",
    "link": "https://www.whitehouse.gov/presidential-actions/2025/12/increasing-medical-marijuana-and-cannabidiol-research/"
  },
  {
    "title": "Executive Order Reinstating Restrictions on Entry of Foreign Nationals to Protect National Security",
    "summary": "This executive order reinstates entry restrictions on certain foreign nationals entering the United States, with the stated objective of preventing national security and public safety threats from reaching U.S. borders. It references restrictions enacted during the president's first administration and notes that the Supreme Court upheld those restrictions in related litigation. The order codifies these policies as Executive Order 14161, issued January 20, 2025, under the title Protecting the United States From Foreign Terrorists and Other National Security Threats, and directs agencies to implement screening and limitations consistent with the policy.",
    "link": "https://www.whitehouse.gov/presidential-actions/2025/12/restricting-and-limiting-the-entry-of-foreign-nationals-to-protect-the-security-of-the-united-states/"
  }
]