[
  {
    "title": "Proclamation for Loyalty Day and Law Day, U.S.A., 2025",
    "summary": "This proclamation recognizes Loyalty Day and Law Day, U.S.A., highlighting the significance of the rule of law in American society. It emphasizes the foundational role of law in the constitutional order and its importance both domestically and internationally. The proclamation serves as a reminder of the values that underpin the United States as a nation regarded as a guiding example for others.",
    "link": "https://www.whitehouse.gov/presidential-actions/2025/05/loyalty-day-and-law-day-u-s-a-2025/"
  },
  {
    "title": "Proclamation of National Day of Prayer for 2025",
    "summary": "This proclamation designates a specific day in 2025 as National Day of Prayer, emphasizing the historical significance of prayer in American society and acknowledging its role in fostering unity and strength among citizens. The proclamation reflects on the tradition of prayer since the establishment of the Nation, reiterating its importance in public life.",
    "link": "https://www.whitehouse.gov/presidential-actions/2025/05/national-day-of-prayer-2025/"
  },
  {
    "title": "Proclamation for the National Fallen Firefighters Memorial Weekend, 2025",
    "summary": "This proclamation recognizes the National Fallen Firefighters Memorial Weekend, which takes place in Emmitsburg, Maryland, honoring the service and sacrifice of both volunteer and professional firefighters who have lost their lives in the line of duty. This event serves as an opportunity to acknowledge the dedication and bravery of firefighters, who consistently respond to emergencies and risks to safeguard their communities. The proclamation underscores the importance of remembering and commemorating these individuals for their contributions and sacrifices.",
    "link": "https://www.whitehouse.gov/presidential-actions/2025/05/national-fallen-firefighters-memorial-weekend-2025/"
  },
  {
    "title": "Executive Order on Funding for Public Media Organizations",
    "summary": "This executive order addresses the funding structure for National Public Radio (NPR) and the Public Broadcasting Service (PBS), which receive financial support through the Corporation for Public Broadcasting (CPB). The order seeks to review and adjust the taxpayer funding model in light of contemporary media landscape changes since the establishment of the CPB in 1967. The implications of this order may affect the allocation of federal funds for these broadcasting entities.",
    "link": "https://www.whitehouse.gov/presidential-actions/2025/05/ending-taxpayer-subsidization-of-biased-media/"
  },
  {
    "title": "Establishment of the Religious Liberty Commission",
    "summary": "This executive order establishes the Religious Liberty Commission within the executive branch with the objective of ensuring the enforcement of federal laws that protect religious liberty. It emphasizes the importance of upholding the constitutional rights related to religious expression and outlines the government's commitment to enforcing these protections as envisioned by the Founders.",
    "link": "https://www.whitehouse.gov/presidential-actions/2025/05/establishment-of-the-religious-liberty-commission/"
  },
  {
    "title": "Modification of Tariffs on Imported Goods",
    "summary": "This executive order addresses the imposition and modification of tariffs on certain imported articles, authorized by the President under constitutional and statutory provisions, including the International Emergency Economic Powers Act and the National Emergencies Act. The action reflects the administration's intent to regulate international trade and economic conditions affecting the United States.",
    "link": "https://www.whitehouse.gov/presidential-actions/2025/04/addressing-certain-tariffs-on-imported-articles/"
  },
  {
    "title": "Proclamation Recognizing the 418th Anniversary of the First Landing and the Raising of the Cape Henry Cross",
    "summary": "This proclamation commemorates the 418th anniversary of the arrival of settlers from England to the Chesapeake Bay area, marking their 144-day journey commissioned by King James I and the Virginia Company. The document reflects on the historical significance of this event in the context of American history, acknowledging both the challenges faced by the settlers and the broader implications of their arrival in the New World.",
    "link": "https://www.whitehouse.gov/presidential-actions/2025/04/418th-anniversary-of-the-first-landing-and-the-raising-of-the-cape-henry-cross/"
  },
  {
    "title": "Proclamation on Amendments to Adjusting Imports of Automobiles and Automobile Parts",
    "summary": "This proclamation addresses the findings from a report transmitted by the Secretary of Commerce regarding the impact of imported passenger vehicles and light trucks on the U.S. automotive industry. The report evaluates various categories of vehicles and outlines adjustments related to their importation into the United States, with a focus on balancing domestic economic interests and international trade regulations. Specific changes and actions are proposed to manage the importation of these products effectively.",
    "link": "https://www.whitehouse.gov/presidential-actions/2025/04/amendments-to-adjusting-imports-of-automobiles-and-automobile-parts-into-the-united-states/"
  }
]