[
  {
    "title": "Nominations for Assistant Secretaries and General Counsel Submitted to the Senate",
    "summary": "This document outlines the nominations submitted to the Senate for various positions within the federal government. The nominees include Gary Andres from Virginia for the position of Assistant Secretary of Health and Human Services, Daniel Aronowitz from Virginia for the role of Assistant Secretary of Labor, James Baehr from Louisiana for General Counsel at the Department of Veterans Affairs, and Kirsten Baesler from North Dakota for Assistant Secretary for Elementary and Secondary Education. These nominations are part of the administration's efforts to fill key leadership roles across federal departments.",
    "link": "https://www.whitehouse.gov/presidential-actions/2025/02/nominations-sent-to-the-senate/"
  },
  {
    "title": "Proclamation Regarding Adjustments to Aluminum Imports in Response to National Security Findings",
    "summary": "This proclamation addresses the findings of a report from the Secretary of Commerce regarding the impact of aluminum imports on the national security of the United States. It outlines measures to adjust the importation of aluminum in light of these findings, as mandated by section 232 of the Trade Expansion Act of 1962. The action reflects an effort to ensure that aluminum imports do not adversely affect the national security interests of the country, following an investigation initiated by the Secretary of Commerce.",
    "link": "https://www.whitehouse.gov/presidential-actions/2025/02/adjusting-imports-of-aluminum-into-the-united-states/"
  },
  {
    "title": "Announcement of the President's Intelligence Advisory Board",
    "summary": "President Donald J. Trump has announced the formation of a new President’s Intelligence Advisory Board (PIAB), which will consist of a selected group of individuals tasked with providing advice on national security issues. The board is expected to support the objectives of the Intelligence Community and participate in addressing the nation’s key security challenges. This initiative highlights the administration’s intention to focus on its national agenda in relation to intelligence matters.",
    "link": "https://www.whitehouse.gov/presidential-actions/2025/02/president-trump-announces-the-presidents-intelligence-advisory-board/"
  },
  {
    "title": "Proclamation Regarding Adjustments to Steel Imports from Various Countries",
    "summary": "This proclamation outlines the conclusion of discussions and agreements with the Argentine Republic and the Commonwealth of Australia concerning the adjustment of steel imports into the United States. It references prior proclamations and measures that have been agreed upon to regulate and monitor the importation of steel products, indicating ongoing efforts to address trade relations and the effects of imports on the U.S. market.",
    "link": "https://www.whitehouse.gov/presidential-actions/2025/02/adjusting-imports-of-steel-into-the-united-states/"
  },
  {
    "title": "Review of Foreign Corrupt Practices Act Enforcement Policy",
    "summary": "This executive order addresses the administration's decision to pause the enforcement of the Foreign Corrupt Practices Act (FCPA) in order to reassess its implications for American economic and national security. Since its introduction in 1977, the FCPA has evolved in its application and enforcement. The order outlines the reason for this pause, indicating a review period to analyze the impact of the Act on U.S. interests.",
    "link": "https://www.whitehouse.gov/presidential-actions/2025/02/pausing-foreign-corrupt-practices-act-enforcement-to-further-american-economic-and-national-security/"
  },
  {
    "title": "Policy on Procurement and Use of Straws in Federal Agencies",
    "summary": "This executive order addresses the use of straws in federal procurement by establishing guidelines related to the use of plastic and paper straws. It reflects concerns regarding local bans and initiatives related to plastic straws, and mandates a review of straw usage policies. The order seeks to allow federal agencies the discretion to choose the type of straws they procure and use, rather than being mandated to use specific types. This aims to balance waste reduction efforts with practicality in federal operations.",
    "link": "https://www.whitehouse.gov/presidential-actions/2025/02/ending-procurement-and-forced-use-of-paper-straws/"
  }
]