[
  {
    "title": "Memorandum on Transparency in Government Spending",
    "summary": "This memorandum outlines directives for heads of executive departments and agencies regarding the importance of transparency in government spending. It emphasizes the need to review and disclose expenditures on programs, contracts, and grants to ensure that taxpayer funds are allocated effectively and in alignment with national interests. The memorandum aims to promote accountable fiscal practices that are responsive to the concerns of the American public regarding the management of government resources.",
    "link": "https://www.whitehouse.gov/presidential-actions/2025/02/memorandum-for-the-heads-of-executive-departments-and-agencies-7c05/"
  },
  {
    "title": "Proclamation for George Washington's Birthday, 2025",
    "summary": "This proclamation by the President of the United States recognizes and commemorates the birthday of George Washington, the first President of the United States. It highlights Washington's significant contributions to the nation and his enduring legacy as a leader. The proclamation serves to reflect on the principles of freedom and the values associated with Washington's role in American history.",
    "link": "https://www.whitehouse.gov/presidential-actions/2025/02/president-george-washingtons-birthday-2025/"
  },
  {
    "title": "Presidential Emergency Declaration for Severe Storms in Kentucky",
    "summary": "On February 14, 2025, an emergency was declared by President Donald J. Trump for the Commonwealth of Kentucky due to the impact of severe storms, straight-line winds, flooding, and landslides. This declaration allows for federal assistance to support the response efforts of state and local authorities affected by these emergency conditions.",
    "link": "https://www.whitehouse.gov/presidential-actions/2025/02/president-donald-j-trump-approves-kentucky-emergency-declaration/"
  },
  {
    "title": "Establishment of the National Energy Dominance Council",
    "summary": "This executive order establishes the National Energy Dominance Council, which aims to enhance the utilization of natural resources and promote advancements in energy technologies. The Council is tasked with developing strategies that support the economic growth of the nation and ensure national security through energy independence and innovation in the energy sector.",
    "link": "https://www.whitehouse.gov/presidential-actions/2025/02/establishing-the-national-energy-dominance-council/"
  },
  {
    "title": "Nominations for Assistant Secretary and General Counsel Positions Submitted to the Senate",
    "summary": "This document details the nominations sent to the Senate for various positions within the federal government. Among the nominees are Gary Andres of Virginia for Assistant Secretary of Health and Human Services, Daniel Aronowitz of Virginia for Assistant Secretary of Labor, and James Baehr of Louisiana for General Counsel at the Department of Veterans Affairs. Additionally, Kirsten Baesler of North Dakota has been nominated for the role of Assistant Secretary for Elementary and Secondary Education. These nominations are part of the process of filling key administrative positions within the executive branch.",
    "link": "https://www.whitehouse.gov/presidential-actions/2025/02/nominations-sent-to-the-senate/"
  },
  {
    "title": "Proclamation on the Adjustment of Aluminum Imports into the United States",
    "summary": "This proclamation addresses the findings of a report submitted by the Secretary of Commerce regarding the impact of aluminum imports on the national security of the United States. It outlines the measures proposed to adjust the importation of aluminum to align with national security interests, referencing the investigations conducted under section 232 of the Trade Expansion Act of 1962. The document emphasizes the ongoing evaluation of import policies and their implications for the domestic aluminum industry and national security.",
    "link": "https://www.whitehouse.gov/presidential-actions/2025/02/adjusting-imports-of-aluminum-into-the-united-states/"
  },
  {
    "title": "Formation of the President's Intelligence Advisory Board",
    "summary": "On a specified date, President Donald J. Trump announced the establishment of the President’s Intelligence Advisory Board (PIAB), which is composed of a selected group of individuals aimed at providing advice on national security issues. The board's primary function is to support the President in addressing significant security challenges and to ensure the alignment of the Intelligence Community's efforts with the President's strategic objectives.",
    "link": "https://www.whitehouse.gov/presidential-actions/2025/02/president-trump-announces-the-presidents-intelligence-advisory-board/"
  }
]