[
  {
    "title": "Executive Order Reinstating Entry Restrictions for Foreign Nationals to Protect United States National Security",
    "summary": "This executive action describes restricting the entry of certain foreign nationals into the United States to reduce potential national security and public safety risks at the borders. It notes that prior restrictions were upheld by the Supreme Court and states that the policies were reinstated through Executive Order 14161, issued January 20, 2025, under the title Protecting the United States From Foreign Terrorists and Other National Security Threats. The action presents the scope and objectives of the policy and situates it as a continuation or revival of existing border security measures.",
    "link": "https://www.whitehouse.gov/presidential-actions/2025/12/restricting-and-limiting-the-entry-of-foreign-nationals-to-protect-the-security-of-the-united-states/"
  },
  {
    "title": "Executive Order on Mitigating Price Fixing and Anti-Competitive Practices in the U.S. Food Supply Chain",
    "summary": "The order establishes a framework to address security risks associated with price fixing and anti-competitive practices in the U.S. food supply chain. It states that a stable and affordable food supply is essential to national and economic security and notes concerns about such conduct, including in cases involving foreign-controlled corporations. The order directs federal agencies to coordinate efforts to identify, assess, and mitigate these risks, with the objective of maintaining affordability and resilience in the food system. It envisions actions such as monitoring compliance with antitrust laws, evaluating policy options, and implementing measures to reduce vulnerabilities across the supply chain, as well as reporting and accountability mechanisms as part of a comprehensive response.",
    "link": "https://www.whitehouse.gov/presidential-actions/2025/12/addressing-security-risks-from-price-fixing-and-anti-competitive-behavior-in-the-food-supply-chain/"
  },
  {
    "title": "Proclamation Honoring the Memory of Specialist Sarah Beckstrom, West Virginia Army National Guard",
    "summary": "This proclamation, issued by the President under the Constitution and laws of the United States, honors the memory and service of Specialist Sarah Beckstrom of the West Virginia Army National Guard. It provides a formal expression of national respect and includes a directive regarding the display of the United States flag to honor the service member.",
    "link": "https://www.whitehouse.gov/presidential-actions/2025/12/honoring-the-memory-of-specialist-sarah-beckstrom-west-virginia-army-national-guard/"
  },
  {
    "title": "Presidential Message on the 2025 Anniversary of the Monroe Doctrine (America 250)",
    "summary": "A presidential message commemorating the 2025 anniversary of the Monroe Doctrine, recounting its origin on December 2, 1823, and reaffirming the United States' commitment to defending the homeland, its interests, and the well-being of its citizens. The message discusses the ongoing relevance of the doctrine to U.S. sovereignty and foreign policy and outlines current priorities related to national security and international engagement.",
    "link": "https://www.whitehouse.gov/presidential-actions/2025/12/america-250-presidential-message-on-the-anniversary-of-the-monroe-doctrine/"
  }
]