[
  {
    "title": "Nominations to the Senate for Chairman and Commissioner of the Commodity Futures Trading Commission; withdrawal of a nominee",
    "summary": "The White House announced nominations of Michael Selig of Florida to be Chairman of the Commodity Futures Trading Commission, succeeding Rostin Behnam, and to be a Commissioner of the Commission for a term expiring April 13, 2029, succeeding Christy Goldsmith Romero. The announcement also transmitted a withdrawal of nominee Joel Rayburn from Senate consideration.",
    "link": "https://www.whitehouse.gov/presidential-actions/2025/10/nominations-and-withdrawal-sent-to-the-senate/"
  },
  {
    "title": "Proclamation on Regulatory Relief for Certain Stationary Sources to Promote American Mineral Security",
    "summary": "This presidential proclamation provides regulatory relief for certain stationary sources as part of efforts to promote American mineral security. It notes copper's critical role in the United States' energy, defense, and manufacturing sectors and states that maintaining and increasing domestic copper smelting capacity is important for reducing reliance on foreign supply chains. The proclamation frames the relief as a means to support domestic mineral production and enhance the resilience of mineral supply chains.",
    "link": "https://www.whitehouse.gov/presidential-actions/2025/10/regulatory-relief-for-certain-stationary-sources-to-promote-american-mineral-security/"
  },
  {
    "title": "Nomination of Jennifer Wicks McNamara to be Ambassador Extraordinary and Plenipotentiary to the Socialist Republic of Vietnam",
    "summary": "Jennifer Wicks McNamara, a resident of Virginia, has been nominated to serve as the United States Ambassador Extraordinary and Plenipotentiary to the Socialist Republic of Vietnam. The nomination has been transmitted to the United States Senate for confirmation.",
    "link": "https://www.whitehouse.gov/presidential-actions/2025/10/nomination-sent-to-the-senate/"
  },
  {
    "title": "Proclamation by the President Declaring National Day of Remembrance for Charlie Kirk",
    "summary": "A presidential proclamation announcing a National Day of Remembrance dedicated to Charlie Kirk following his assassination on September 10, 2025, in a campus courtyard. The proclamation designates the day for national observance and remembrance and directs federal agencies, as well as states and the public, to observe appropriate memorial activities and moments of reflection in response to the incident.",
    "link": "https://www.whitehouse.gov/presidential-actions/2025/10/national-day-of-remembrance-for-charlie-kirk/"
  }
]