[
  {
    "title": "Executive Order Celebrating American Motor Racing",
    "summary": "This presidential action, issued under the President's authority, begins with a 'Section 1. Purpose and Policy' and states the objective of the order. It discusses American INDYCAR racing as a longstanding element of U.S. motorsports, mentions speeds exceeding 200 miles per hour, and references the involvement of cars and drivers.",
    "link": "https://www.whitehouse.gov/presidential-actions/2026/01/celebrating-american-greatness-with-american-motor-racing/"
  },
  {
    "title": "Proclamation: National School Choice Week, 2026",
    "summary": "This presidential proclamation designates National School Choice Week, 2026, and articulates the principle that American families should have access to educational options. It references the nation's history and asserts that individuals, rather than government officials or external groups, have the right to determine their own destiny, framing school choice as part of national policy.",
    "link": "https://www.whitehouse.gov/presidential-actions/2026/01/national-school-choice-week-2026/"
  },
  {
    "title": "Executive Order to Address Competition in the Residential Real Estate Market by Institutional Buyers",
    "summary": "This executive order directs federal agencies to assess and pursue measures aimed at reducing the competitive advantage of institutional investors in the residential real estate market, with the goal of improving access to homeownership for individual buyers. It calls for evaluating existing policies, considering regulatory or programmatic actions, enhancing market transparency, and coordinating interagency efforts to monitor institutional acquisition activity, data collection, and reporting, and to promote fair competition in the market for residential properties.",
    "link": "https://www.whitehouse.gov/presidential-actions/2026/01/stopping-wall-street-from-competing-with-main-street-homebuyers/"
  },
  {
    "title": "National Day of Patriotic Devotion, 2026 Proclamation",
    "summary": "A presidential proclamation designating a National Day of Patriotic Devotion for January 2026. The document references an earlier pledge made in the Capitol to reclaim national sovereignty, restore national safety, rebalance the scales of justice, and rebuild a country that is proud and prosperous, and it describes the observance as a time to reflect on these objectives and reaffirm commitments to the American people.",
    "link": "https://www.whitehouse.gov/presidential-actions/2026/01/national-day-of-patriotic-devotion-2026/"
  }
]