[
  {
    "title": "Nomination of Jared Isaacman to be Administrator of the National Aeronautics and Space Administration",
    "summary": "The White House indicates that Jared Isaacman, of Pennsylvania, has been nominated to serve as Administrator of the National Aeronautics and Space Administration, to replace Bill Nelson following Nelson's resignation. The nomination has been sent to the Senate for consideration.",
    "link": "https://www.whitehouse.gov/presidential-actions/2025/11/nomination-sent-to-the-senate-7385/"
  },
  {
    "title": "Modification of Reciprocal Tariff Rates under the U.S.–China Economic and Trade Arrangement",
    "summary": "This presidential action is issued under authorities including the International Emergency Economic Powers Act, the National Emergencies Act, and section 604 of the Trade Act of 1974. It modifies reciprocal tariff rates to align with the existing economic and trade arrangement between the United States and the People's Republic of China. The document identifies the legal basis for the tariff modifications and describes the scope and intentional alignment of tariff rates with the bilateral agreement with China.",
    "link": "https://www.whitehouse.gov/presidential-actions/2025/11/modifying-reciprocal-tariff-rates-consistent-with-the-economic-and-trade-arrangement-between-the-united-states-and-the-peoples-republic-of-china/"
  },
  {
    "title": "Modification of Duties Addressing the Synthetic Opioid Supply Chain in the People's Republic of China",
    "summary": "The action, issued under authorities including the International Emergency Economic Powers Act, the National Emergencies Act, and section 604 of the Trade Act of 1974, modifies the duties applicable to goods from the People's Republic of China to address concerns related to the synthetic opioid supply chain. The modification adjusts tariff coverage or rates as part of a broader policy response to risks associated with the importation and distribution of synthetic opioids linked to the China-based supply chain. The order directs relevant executive agencies to implement the changes in accordance with applicable law, publish necessary determinations or guidance, and monitor and report on the effectiveness and impact of the modifications over time.",
    "link": "https://www.whitehouse.gov/presidential-actions/2025/11/modifying-duties-addressing-the-synthetic-opioid-supply-chain-in-the-peoples-republic-of-china/"
  },
  {
    "title": "Nomination Sent to the Senate for Louisiana Federal Judicial Positions and United States Marshal Appointment",
    "summary": "The White House announced that nominations have been sent to the Senate for three federal positions in Louisiana: William J. Crain, of Louisiana, to be United States District Judge for the Eastern District of Louisiana, to fill the seat formerly held by Eldon E. Fallon, who has retired; Alexander C. Van Hook, of Louisiana, to be United States District Judge for the Western District of Louisiana, to fill the seat formerly held by Elizabeth Erny Foote, who has retired; and Brian Barber, of Louisiana, to be United States Marshal. The announcements are documented in the White House publication Nomination Sent to the Senate.",
    "link": "https://www.whitehouse.gov/presidential-actions/2025/10/nomination-sent-to-the-senate-f090/"
  },
  {
    "title": "Proclamation designating National Energy Dominance Month, 2025",
    "summary": "The President proclaims October 2025 as National Energy Dominance Month, noting that the United States has been sustained by domestic energy resources such as oil, coal, minerals, and natural gas for nearly two and a half centuries. The proclamation highlights the geographic scope from the Appalachian Mountains to the Mississippi River to the Great Plains and beyond and designates a month to recognize the role of these resources in the nation's energy system.",
    "link": "https://www.whitehouse.gov/presidential-actions/2025/10/national-energy-dominance-month-2025/"
  }
]