[
  {
    "title": "Presidential Action Under IEEPA and NEA to Safeguard Venezuelan Oil Revenue for the Benefit of the American and Venezuelan People",
    "summary": "This presidential action, issued under the International Emergency Economic Powers Act (IEEPA), the National Emergencies Act (NEA), and 3 U.S.C. ยง 301, establishes measures to safeguard revenues from Venezuelan oil. The objective is to ensure that oil-related revenues are protected from illicit use and are directed in a manner that benefits both the American and Venezuelan people. The action outlines the legal authorities, scope of enforcement, and eligible transactions and parties under these authorities, and is documented on the White House's January 2026 presidential actions page.",
    "link": "https://www.whitehouse.gov/presidential-actions/2026/01/safeguarding-venezuelan-oil-revenue-for-the-good-of-the-american-and-venezuelan-people/"
  },
  {
    "title": "Executive Order Under the Defense Production Act Addressing Acquisition of Certain Assets of Emcore Corporation by Hiefo Corporation",
    "summary": "This executive order, issued under the authority of the Constitution and the Defense Production Act of 1950, invokes section 721 to address national-security concerns related to the proposed acquisition of certain assets of Emcore Corporation by Hiefo Corporation. It establishes findings indicating credible evidence warranting government consideration and directs relevant federal agencies to take actions to address the identified risks to national security and the defense industrial base, consistent with the purposes of the Defense Production Act. The order outlines the initial provisions and scope for subsequent measures to ensure the acquisition does not adversely affect national security or critical infrastructure.",
    "link": "https://www.whitehouse.gov/presidential-actions/2026/01/regarding-the-acquisition-of-certain-assets-of-emcore-corporation-by-hiefo-corporation/"
  },
  {
    "title": "National Security Presidential Memorandum on Coordinating Federal Efforts to Advance 6G Technologies and Security",
    "summary": "A memorandum directing multiple federal departments and agencies to coordinate policy, research, and procurement related to the development, deployment, and security of sixth-generation wireless technologies (6G). The memo designates responsibilities to the Secretary of State, the Secretary of Defense, the Secretary of Commerce, the Secretary of Transportation, the Secretary of Energy, the Secretary of Homeland Security, the Director of the Office of Management and Budget, the Director of National Intelligence, the Chairman of the Federal Communications Commission, and the Assistant to the President for Economic Policy and the Assistant to the President for Science and Technology, among others. It requires the agencies to establish a whole-of-government strategy for 6G that addresses standards, security, supply chain resilience, and international collaboration, and to coordinate with the private sector and allied governments. Implementation and oversight are to be conducted through relevant White House offices and the National Security Council, with timelines and reporting to monitor progress.",
    "link": "https://www.whitehouse.gov/presidential-actions/2025/12/national-security-presidential-memorandum-nspm-8-0bda/"
  }
]