[
  {
    "title": "Proclamation by the President on Veterans Day, 2025",
    "summary": "The proclamation honors the courage, honor, and dedicated service of veterans, acknowledging that their sacrifices have sustained the nation’s freedom and way of life. It notes nearly 250 years of veterans’ service and designates November 11, 2025, as Veterans Day, inviting the American people to observe the day with gratitude and to recognize and support veterans through appropriate programs and actions.",
    "link": "https://www.whitehouse.gov/presidential-actions/2025/11/veterans-day-2025/"
  },
  {
    "title": "Proclamation Honoring the 250th Anniversary of the Founding of the United States Marine Corps",
    "summary": "An official proclamation that commemorates the 250th anniversary of the founding of the United States Marine Corps, acknowledges the Marine Corps' historical contributions to national defense and public service since 1775, and outlines observances and appropriate actions by federal agencies and the public to mark the anniversary.",
    "link": "https://www.whitehouse.gov/presidential-actions/2025/11/250th-anniversary-of-the-founding-of-the-united-states-marine-corps/"
  },
  {
    "title": "Nomination of Jared Isaacman to be Administrator of the National Aeronautics and Space Administration to succeed Bill Nelson",
    "summary": "The White House announced the nomination of Jared Isaacman, a resident of Pennsylvania, to serve as Administrator of the National Aeronautics and Space Administration. The nomination is to fill the post previously held by Bill Nelson, who resigned. The nomination has been sent to the Senate for its consideration.",
    "link": "https://www.whitehouse.gov/presidential-actions/2025/11/nomination-sent-to-the-senate-7385/"
  },
  {
    "title": "Modifying Reciprocal Tariff Rates Under the United States-China Economic and Trade Arrangement",
    "summary": "This presidential action authorizes and directs modifications to reciprocal tariff rates applied to goods imported from the People's Republic of China in alignment with the bilateral economic and trade arrangement between the United States and China. The action is issued under authorities including the International Emergency Economic Powers Act, the National Emergencies Act, and section 604 of the Trade Act of 1974. It directs federal agencies to implement, administer, and publish the revised tariff schedule and to take necessary steps to effectuate the tariff modifications.",
    "link": "https://www.whitehouse.gov/presidential-actions/2025/11/modifying-reciprocal-tariff-rates-consistent-with-the-economic-and-trade-arrangement-between-the-united-states-and-the-peoples-republic-of-china/"
  },
  {
    "title": "Modifying Duties Addressing the Synthetic Opioid Supply Chain in the People's Republic of China",
    "summary": "This presidential action invokes authorities under the International Emergency Economic Powers Act, the National Emergencies Act, and section 604 of the Trade Act of 1974 to modify duties in order to address the synthetic opioid supply chain associated with the People's Republic of China. The measure directs adjustments to tariff treatment for affected imports and requires appropriate federal agencies to implement the changes and monitor their impact, with consideration given to public health and national security concerns.",
    "link": "https://www.whitehouse.gov/presidential-actions/2025/11/modifying-duties-addressing-the-synthetic-opioid-supply-chain-in-the-peoples-republic-of-china/"
  },
  {
    "title": "Nomination Sent to Senate for William J. Crain and Alexander C. Van Hook as U.S. District Judges for Louisiana, and Brian Barber as U.S. Marshal for the Middle District of Louisiana",
    "summary": "The White House announced that nominations have been sent to the Senate for three federal positions in Louisiana: William J. Crain, of Louisiana, to be United States District Judge for the Eastern District of Louisiana, to fill the vacancy created by the retirement of Eldon E. Fallon; Alexander C. Van Hook, of Louisiana, to be United States District Judge for the Western District of Louisiana, to fill the vacancy created by the retirement of Elizabeth Erny Foote; and Brian Barber, of Louisiana, to be United States Marshal for the Middle District of Louisiana.",
    "link": "https://www.whitehouse.gov/presidential-actions/2025/10/nomination-sent-to-the-senate-f090/"
  }
]