[
  {
    "title": "Presidential Declaration of Emergency in Kentucky for Severe Weather Events",
    "summary": "On February 14, 2025, President Donald J. Trump announced the existence of an emergency in the Commonwealth of Kentucky due to severe storms, straight-line winds, flooding, and landslides. This declaration is intended to facilitate federal assistance to support state and local efforts in managing the response to the adverse conditions. The action authorizes the Department of Homeland Security to coordinate and provide necessary federal resources to aid recovery and relief efforts in the affected areas.",
    "link": "https://www.whitehouse.gov/presidential-actions/2025/02/president-donald-j-trump-approves-kentucky-emergency-declaration/"
  },
  {
    "title": "Establishment of the National Energy Dominance Council",
    "summary": "This executive order establishes the National Energy Dominance Council, which is designed to promote the management and utilization of the United States' natural resources and energy technologies. The Council is tasked with supporting economic prosperity and enhancing national security through effective energy policies and innovation. The order highlights the importance of energy resources to the country's overall energy strategy and outlines the responsibilities and objectives of the newly formed Council.",
    "link": "https://www.whitehouse.gov/presidential-actions/2025/02/establishing-the-national-energy-dominance-council/"
  },
  {
    "title": "Nominations for Assistant Secretaries and General Counsel to the Senate",
    "summary": "This document details the nominations submitted to the Senate for various positions within the U.S. federal government. The nominees include Gary Andres from Virginia for the role of Assistant Secretary of Health and Human Services, Daniel Aronowitz from Virginia for the position of Assistant Secretary of Labor, and James Baehr from Louisiana for the position of General Counsel in the Department of Veterans Affairs. Additionally, Kirsten Baesler from North Dakota is nominated for the role of Assistant Secretary for Elementary and Secondary Education.",
    "link": "https://www.whitehouse.gov/presidential-actions/2025/02/nominations-sent-to-the-senate/"
  },
  {
    "title": "Proclamation on Adjustments to Aluminum Imports into the United States",
    "summary": "This proclamation addresses the findings of a report submitted by the Secretary of Commerce concerning the impacts of aluminum imports on U.S. national security, as mandated by section 232 of the Trade Expansion Act of 1962. It lays out the administration's decisions regarding the regulation of aluminum imports to protect national interests.",
    "link": "https://www.whitehouse.gov/presidential-actions/2025/02/adjusting-imports-of-aluminum-into-the-united-states/"
  },
  {
    "title": "Announcement of the President’s Intelligence Advisory Board Members",
    "summary": "This document discusses the announcement made by President Donald J. Trump regarding the formation of a new President’s Intelligence Advisory Board (PIAB). The board is composed of a selected group of individuals designated to provide guidance to the President on significant security issues facing the nation. Their role includes ensuring that the Intelligence Community is aligned with the President's objectives concerning national security. The announcement emphasizes the qualifications of the appointed members and their expected contributions to advisory discussions about intelligence matters.",
    "link": "https://www.whitehouse.gov/presidential-actions/2025/02/president-trump-announces-the-presidents-intelligence-advisory-board/"
  },
  {
    "title": "Proclamation on Adjusting Imports of Steel into the United States",
    "summary": "This proclamation addresses the adjustments to the import policies related to steel entering the United States. It outlines the conclusions of discussions and agreements reached with various nations, including Argentina and Australia, concerning the importation of steel. The proclamation aims to regulate these imports under specified terms to support domestic economic interests and strengthen trade relations with the involved countries. It serves as a continuation of previous efforts to manage and oversee imported steel products.",
    "link": "https://www.whitehouse.gov/presidential-actions/2025/02/adjusting-imports-of-steel-into-the-united-states/"
  }
]