[
  {
    "title": "Nominations for Assistant Secretary and General Counsel Positions to the Senate",
    "summary": "This document lists individuals nominated for various positions within the United States government, which are sent to the Senate for consideration. The nominations include Gary Andres for the position of Assistant Secretary of Health and Human Services, Daniel Aronowitz for Assistant Secretary of Labor, James Baehr for General Counsel at the Department of Veterans Affairs, and Kirsten Baesler for the role of Assistant Secretary for Elementary and Secondary Education. These nominations are part of the standard process for filling key administrative roles within federal agencies.",
    "link": "https://www.whitehouse.gov/presidential-actions/2025/02/nominations-sent-to-the-senate/"
  },
  {
    "title": "Proclamation on Adjustment of Aluminum Imports into the United States",
    "summary": "This proclamation addresses the findings of a report submitted by the Secretary of Commerce regarding the impact of aluminum imports on U.S. national security, as mandated by section 232 of the Trade Expansion Act of 1962. The report, dated January 19, 2018, examines the implications of aluminum imports for the nation’s security and outlines recommended adjustments to import policies. The proclamation aims to safeguard national security interests while establishing regulatory measures based on the findings from the report.",
    "link": "https://www.whitehouse.gov/presidential-actions/2025/02/adjusting-imports-of-aluminum-into-the-united-states/"
  },
  {
    "title": "Establishment of the President's Intelligence Advisory Board",
    "summary": "The President's Intelligence Advisory Board (PIAB) has been established to provide guidance and advice to the President concerning national security issues. The Board is composed of a group of appointed individuals who will focus on various security challenges and ensure that the efforts of the Intelligence Community align with the national priorities set forth by the President. This initiative aims to enhance the effectiveness of intelligence operations and support the overall strategy of the administration.",
    "link": "https://www.whitehouse.gov/presidential-actions/2025/02/president-trump-announces-the-presidents-intelligence-advisory-board/"
  },
  {
    "title": "Proclamation on Adjusting Imports of Steel into the United States",
    "summary": "This proclamation outlines the adjustments made to the imports of steel into the United States as a result of concluded discussions and agreements with various countries, including the Argentine Republic and the Commonwealth of Australia. It references previous proclamations that addressed similar measures and sets the context for ongoing trade discussions and their implications for U.S. steel import policies.",
    "link": "https://www.whitehouse.gov/presidential-actions/2025/02/adjusting-imports-of-steel-into-the-united-states/"
  },
  {
    "title": "Temporary Suspension of Enforcement Actions under the Foreign Corrupt Practices Act",
    "summary": "This executive order announces the temporary suspension of enforcement actions under the Foreign Corrupt Practices Act (FCPA), originally enacted in 1977, to evaluate its implications on American economic interests and national security. The order outlines the intention to review how the enforcement of this Act may impact the overall economic environment and security strategy of the United States. It emphasizes the need for a detailed assessment to ensure that U.S. businesses can operate effectively while adhering to principles of ethical conduct in international business dealings.",
    "link": "https://www.whitehouse.gov/presidential-actions/2025/02/pausing-foreign-corrupt-practices-act-enforcement-to-further-american-economic-and-national-security/"
  },
  {
    "title": "Ending Procurement and Forced Use of Paper Straws",
    "summary": "This executive order addresses the use of drinking straws, particularly criticizing the bans placed on plastic straws in various jurisdictions and the mandatory adoption of alternative materials such as paper straws. The order expresses concern over these trends and aims to halt the procurement and mandatory use of paper straws in order to support a more flexible approach to straw selection in beverages across the United States.",
    "link": "https://www.whitehouse.gov/presidential-actions/2025/02/ending-procurement-and-forced-use-of-paper-straws/"
  },
  {
    "title": "Proclamation of Gulf of America Day on February 9, 2025",
    "summary": "This proclamation recognizes February 9, 2025, as the inaugural Gulf of America Day. It commemorates the signing of Executive Order 14172, titled 'Restoring Names That Honor American Greatness', on January 20, 2025, which includes various actions related to honoring American heritage. The proclamation signifies the establishment of a day to celebrate the Gulf of America and its significance.",
    "link": "https://www.whitehouse.gov/presidential-actions/2025/02/gulf-of-america-day-2025/"
  }
]