[
  {
    "title": "Proclamation Amending Adjustments to Imports of Timber, Lumber, and Their Derivative Products into the United States Under Section 232",
    "summary": "This proclamation announces amendments to the adjustments regulating the importation of timber, lumber, and their derivative products into the United States. The amendments are based on a report transmitted by the Secretary of Commerce on July 1, 2025, assessing whether such imports affect the national security of the United States under Section 232. The changes modify the existing adjustments to timber-related imports in accordance with the findings in that report.",
    "link": "https://www.whitehouse.gov/presidential-actions/2025/12/amendments-to-adjusting-imports-of-timber-lumber-and-their-derivative-products-into-the-united-states/"
  },
  {
    "title": "Implementing the United States-Israel Agreement on Trade in Agricultural Products and for Other Purposes",
    "summary": "This presidential action implements the United States-Israel Agreement on Trade in Agricultural Products under the framework of the United States-Israel Free Trade Area (USIFTA). The agreement, established on April 22, 1985, was approved by Congress in section 3 of the United States–Israel Free Trade Area Implementation Act. The action directs federal agencies to carry out and enforce the provisions of the agreement, including measures related to trade in agricultural products between the United States and Israel and any additional purposes specified in the implementing act, thereby operationalizing the trade framework established by USIFTA.",
    "link": "https://www.whitehouse.gov/presidential-actions/2025/12/to-implement-the-united-states-israel-agreement-on-trade-in-agricultural-products-and-for-other-purposes/"
  },
  {
    "title": "Executive Order Adjusting Rates of Basic Pay for Statutory Pay Systems",
    "summary": "An executive order issued under the President's constitutional and statutory authority to set and adjust the rates of basic pay for statutory pay systems, as defined in 5 U.S.C. 5302(1), with adjustments authorized under 5 U.S.C. 5303. The order identifies the statutory pay systems affected and establishes the framework for determining the adjusted pay rates, formalizing the modification of compensation for federal employees covered by these statutory pay systems.",
    "link": "https://www.whitehouse.gov/presidential-actions/2025/12/adjustments-of-certain-rates-of-pay/"
  },
  {
    "title": "Executive Order to Maintain United States Space Capabilities and Security",
    "summary": "This executive order, issued by the President under the authority of the Constitution and laws of the United States, establishes the policy objective of maintaining United States space capabilities. It defines space superiority as a measure of national vision and will and states that the technologies developed to achieve space superiority contribute to the Nation's strength, security, and prosperity. The document begins with Section 1, titled Purpose, and indicates that subsequent provisions will specify actions for federal agencies to implement in order to advance U.S. space capabilities.",
    "link": "https://www.whitehouse.gov/presidential-actions/2025/12/ensuring-american-space-superiority/"
  },
  {
    "title": "Executive Order Providing for the Closure of Executive Departments and Agencies of the Federal Government on December 24, 2025, and December 26, 2025",
    "summary": "An executive order issued by the President under the Constitution and the laws of the United States, directing all federal executive departments and agencies to close and excusing their employees from duty on Wednesday, December 24, 2025, and Friday, December 26, 2025.",
    "link": "https://www.whitehouse.gov/presidential-actions/2025/12/providing-for-the-closure-of-executive-departments-and-agencies-of-the-federal-government-on-december-24-2025-and-december-26-2025/"
  },
  {
    "title": "Executive Order to Expand Federal Research on Medical Marijuana and Cannabinoids, Including Cannabidiol",
    "summary": "This executive order directs federal agencies to expand and facilitate research on medical marijuana and cannabinoids, including cannabidiol. It articulates a policy goal of ensuring Americans have access to advanced medical treatments and robust research infrastructure, notes a 2023 FDA review of medical cannabis-related topics, and outlines interagency coordination to advance scientific understanding while supporting clinical studies and reducing barriers to research dissemination and implementation.",
    "link": "https://www.whitehouse.gov/presidential-actions/2025/12/increasing-medical-marijuana-and-cannabidiol-research/"
  },
  {
    "title": "Executive Order Restricting and Limiting the Entry of Foreign Nationals to Protect the Security of the United States",
    "summary": "This executive order restricts entry of certain foreign nationals into the United States to address national security and public safety concerns at the border. It notes that these measures were previously implemented and were reinstated under Executive Order 14161, dated January 20, 2025. The order states that the Supreme Court upheld these restrictions and aims to prevent threats by applying enhanced screening and entry controls to specified categories of foreign nationals. The action continues border-security policies established during the president's first term.",
    "link": "https://www.whitehouse.gov/presidential-actions/2025/12/restricting-and-limiting-the-entry-of-foreign-nationals-to-protect-the-security-of-the-united-states/"
  }
]