[
  {
    "title": "Executive Order Addressing Price Fixing and Anti-Competitive Behavior in the U.S. Food Supply Chain",
    "summary": "This Executive Order recognizes that a stable and affordable U.S. food supply is essential to national and economic security. It addresses risks associated with price fixing and anti-competitive practices in the food supply chain, including concerns about influence by foreign-controlled entities. The order directs federal agencies to identify vulnerabilities, assess relevant risks, and coordinate policy and regulatory actions to mitigate anti-competitive conduct and safeguard the reliability and affordability of the nation's food supply.",
    "link": "https://www.whitehouse.gov/presidential-actions/2025/12/addressing-security-risks-from-price-fixing-and-anti-competitive-behavior-in-the-food-supply-chain/"
  },
  {
    "title": "Proclamation Honoring the Memory of Specialist Sarah Beckstrom, West Virginia Army National Guard",
    "summary": "A presidential proclamation issued by the President of the United States to honor the memory of Specialist Sarah Beckstrom of the West Virginia Army National Guard. The proclamation cites constitutional and legal authority and orders a flag-related display as a mark of respect for Specialist Beckstrom.",
    "link": "https://www.whitehouse.gov/presidential-actions/2025/12/honoring-the-memory-of-specialist-sarah-beckstrom-west-virginia-army-national-guard/"
  },
  {
    "title": "Presidential Message on the Anniversary of the Monroe Doctrine",
    "summary": "This White House message commemorates the anniversary of the Monroe Doctrine, originally proclaimed in 1823, and states the Administration's commitment to defending the United States' homeland, national interests, and the welfare of its citizens. The communication places the Doctrine in the context of U.S. sovereignty and outlines ongoing objectives to safeguard national security and American interests while maintaining a factual and nonpartisan tone.",
    "link": "https://www.whitehouse.gov/presidential-actions/2025/12/america-250-presidential-message-on-the-anniversary-of-the-monroe-doctrine/"
  },
  {
    "title": "Presidential Message Recognizing Mark Twain on His 190th Birthday as Part of the America 250 Initiative",
    "summary": "This White House presidential message honors Mark Twain as a foundational figure in American literature, highlighting his wit, wisdom, and honesty and describing how his storytelling translated everyday life into enduring narratives. The message situates Twain's legacy within the America 250 commemorative program, underscoring themes associated with American character such as imagination, courage, and the pursuit of excellence that his work has come to symbolize.",
    "link": "https://www.whitehouse.gov/presidential-actions/2025/11/america-250-presidential-message-on-mark-twains-190th-birthday/"
  },
  {
    "title": "Executive Order to Launch the Genesis Mission",
    "summary": "The document is an executive order that asserts presidential authority to establish and implement the Genesis Mission. It opens by referencing the long-standing role of scientific discovery and technological innovation in American progress and notes that the United States faces global competition in technology. Section 1, titled Purpose, indicates that the Genesis Mission is intended to advance scientific discovery and technological innovation to support national prosperity and strengthen the nation's position in the global technology landscape.",
    "link": "https://www.whitehouse.gov/presidential-actions/2025/11/launching-the-genesis-mission/"
  }
]