[
  {
    "title": "Executive Order to Promote National Defense by Ensuring an Adequate Supply of Elemental Phosphorus and Glyphosate-Based Herbicides",
    "summary": "This executive order, issued under the Defense Production Act of 1950 and the authority of section 301 of title 3, United States Code, establishes policy and findings regarding the importance of securing a reliable supply of elemental phosphorus and glyphosate-based herbicides for national defense and authorizes government actions to identify, prioritize, and facilitate the production, allocation, and distribution of these materials as needed.",
    "link": "https://www.whitehouse.gov/presidential-actions/2026/02/promoting-the-national-defense-by-ensuring-an-adequate-supply-of-elemental-phosphorus-and-glyphosate-based-herbicides/"
  },
  {
    "title": "Presidential Proclamation Honoring George Washington's Birthday, 2026",
    "summary": "A presidential proclamation designates the occasion of George Washington's Birthday in 2026 and recognizes his leadership in the American Revolution and his role as a foundational figure in American liberty. The proclamation notes the 250th anniversary of American independence and encourages appropriate observances and reflection on Washington's contributions, inviting federal agencies and the public to commemorate the occasion and reflect on the nation's founding principles.",
    "link": "https://www.whitehouse.gov/presidential-actions/2026/02/president-george-washingtons-birthday-2026/"
  },
  {
    "title": "Executive Order Modifying Tariffs on Imports from the Government of the Russian Federation",
    "summary": "This presidential action uses authorities including the International Emergency Economic Powers Act, the National Emergencies Act, and section 604 of the Trade Act of 1974 to modify import duties on goods originating in the Government of the Russian Federation. The modification is intended to address threats to the United States presented by the Government of the Russian Federation. The order directs federal agencies to implement the changes and to update regulations and related procedures as required to enforce the modified duties.",
    "link": "https://www.whitehouse.gov/presidential-actions/2026/02/modifying-duties-to-address-threats-to-the-united-states-by-the-government-of-the-russian-federation-04b2/"
  },
  {
    "title": "Executive Order Establishing a U.S. Arms Transfers Strategy",
    "summary": "This executive action establishes a strategy to coordinate and maximize the use of United States defense equipment in international arms transfers. It sets forth the purpose of leveraging domestic manufacturing capabilities as a basis for policy decisions related to defense exports and outlines the rationale and goals for pursuing a comprehensive arms-transfer strategy.",
    "link": "https://www.whitehouse.gov/presidential-actions/2026/02/establishing-an-america-first-arms-transfer-strategy/"
  },
  {
    "title": "Executive Order Aiming to Protect National Security and Public Welfare from Criminal Actors and Other Public Safety Threats",
    "summary": "This executive order establishes the policy of the United States to safeguard national security and the welfare and security of its citizens from criminal actors and other public safety threats. It cites constitutional authority and statutory authority, including 6 U.S.C. 122(a)(2), to justify the action and directs federal agencies to implement measures consistent with this policy to address risks posed by criminal activity and related public safety concerns. The order emphasizes interagency coordination and compliance with the stated objective, outlining the framework for actions across the executive branch to prevent, deter, and respond to threats as part of protecting national security and public welfare.",
    "link": "https://www.whitehouse.gov/presidential-actions/2026/02/protecting-the-national-security-and-welfare-of-the-united-states-and-its-citizens-from-criminal-actors-and-other-public-safety-threats/"
  },
  {
    "title": "Proclamation Designating Northeast Canyons and Seamounts as a Marine National Monument under the Antiquities Act",
    "summary": "On September 15, 2016, President Obama issued Proclamation 9496 under the Antiquities Act (54 U.S.C. 320301), designating approximately 4,913 square miles of waters and submerged lands where the Atlantic Ocean meets the continental shelf as the Northeast Canyons and Seamounts Marine National Monument. The designation establishes a protected marine area defined by the proclamation. The White House post associated with this material is titled Unleashing American Commercial Fishing in the Atlantic, which discusses related Atlantic fishing policy.",
    "link": "https://www.whitehouse.gov/presidential-actions/2026/02/unleashing-american-commercial-fishing-in-the-atlantic/"
  },
  {
    "title": "Proclamation on Ensuring Affordable Beef for the American Consumer",
    "summary": "The proclamation recognizes the historical role of cattle ranchers in the United States and the ongoing significance of beef in the American diet. It states the objective of promoting affordable access to beef for American consumers and references measures to support the beef supply chain and ensure consumer access to beef products.",
    "link": "https://www.whitehouse.gov/presidential-actions/2026/02/ensuring-affordable-beef-for-the-american-consumer/"
  }
]