[
  {
    "title": "Further Amendment to Tariffs Related to Synthetic Opioids from China",
    "summary": "This executive order, issued by the President, addresses modifications to tariffs imposed on goods related to synthetic opioids originating from the People's Republic of China. It is grounded in the President's authority under the Constitution and various legislative acts, including the International Emergency Economic Powers Act and the National Emergencies Act. The order aims to strengthen economic measures to mitigate the impact of synthetic opioids and improve public health safety concerning the supply chain of these substances.",
    "link": "https://www.whitehouse.gov/presidential-actions/2025/03/further-amendment-to-duties-addressing-the-synthetic-opioid-supply-chain-in-the-peoples-republic-of-china/"
  },
  {
    "title": "Addressing National Security Concerns Related to Timber and Lumber Imports",
    "summary": "This executive order addresses concerns regarding the impact of imports of timber and lumber on national security. It establishes a policy framework for evaluating the effects of such imports on the domestic wood products industry, which includes timber, lumber, and related derivatives. The order aims to implement measures that ensure the industry remains resilient and can support national security objectives, in accordance with the authority granted under the Trade Expansion Act of 1962.",
    "link": "https://www.whitehouse.gov/presidential-actions/2025/03/addressing-the-threat-to-national-security-from-imports-of-timber-lumber/"
  },
  {
    "title": "Executive Order on the Expansion of American Timber Production",
    "summary": "This executive order emphasizes the importance of timber production in the United States, acknowledging its critical role in various sectors including construction and renewable energy. It initiates measures aimed at increasing the production of timber, lumber, paper, bioenergy, and other wood products to enhance national well-being and support economic activities reliant on these resources.",
    "link": "https://www.whitehouse.gov/presidential-actions/2025/03/immediate-expansion-of-american-timber-production/"
  },
  {
    "title": "Establishment of English as the Official Language of the United States",
    "summary": "This executive order declares English to be the official language of the United States. It emphasizes the historical significance of English as the language used in foundational documents such as the Declaration of Independence and the Constitution. The order outlines the purpose and policy related to this designation and establishes guidelines for the implementation of this policy across federal agencies.",
    "link": "https://www.whitehouse.gov/presidential-actions/2025/03/designating-english-as-the-official-language-of-the-united-states/"
  },
  {
    "title": "Establishment of Healthcare Pricing Transparency Initiatives",
    "summary": "This order outlines the establishment of initiatives aimed at enhancing transparency in healthcare pricing for patients in the United States. It emphasizes the importance of providing clear, accurate, and actionable information regarding healthcare costs to empower patients in making informed decisions about their healthcare options. The objective is to address issues related to pricing opacity that have affected the affordability and accessibility of healthcare services.",
    "link": "https://www.whitehouse.gov/presidential-actions/2025/02/making-america-healthy-again-by-empowering-patients-with-clear-accurate-and-actionable-healthcare-pricing-information/"
  },
  {
    "title": "Suspension of Security Clearances and Evaluation of Government Contracts",
    "summary": "This memorandum outlines directives regarding the suspension of security clearances for certain individuals and the evaluation processes pertaining to government contracts. It addresses the roles of various departments and agencies, including the Department of State, Department of Defense, Department of Justice, Department of Energy, Office of Management and Budget, Office of the Director of National Intelligence, Central Intelligence Agency, and Office of Personnel Management. The memorandum aims to ensure compliance with security protocols and assess the integrity of government contracts.",
    "link": "https://www.whitehouse.gov/presidential-actions/2025/02/suspension-of-security-clearances-and-evaluation-of-government-contracts/"
  }
]