[
  {
    "title": "Executive Order Launching the Genesis Mission to Promote Scientific Discovery and Technological Innovation",
    "summary": "This executive order, issued under presidential authority, establishes the Genesis Mission and outlines its purpose in Section 1. The document emphasizes that scientific discovery and technological innovation have driven American progress and prosperity and states the objective of advancing these areas to strengthen the United States' position in global technology leadership. The order frames the Genesis Mission as a national effort to promote discovery and innovation and to support related objectives aimed at maintaining competitiveness in global technology development.",
    "link": "https://www.whitehouse.gov/presidential-actions/2025/11/launching-the-genesis-mission/"
  },
  {
    "title": "Designation of Certain Muslim Brotherhood Chapters as Foreign Terrorist Organizations and Specially Designated Global Terrorists",
    "summary": "This presidential executive order designates specific chapters of the Muslim Brotherhood as Foreign Terrorist Organizations (FTOs) and as Specially Designated Global Terrorists (SDGTs) under the Immigration and Nationality Act and the International Emergency Economic Powers Act. The designation enables measures to block assets, prohibit financial transactions and other support involving the designated entities, and directs relevant federal agencies to implement, enforce, and coordinate the designation. The order outlines the authorities and processes for applying these sanctions, requires interagency cooperation, and provides for future additions or removals of designated entities as appropriate.",
    "link": "https://www.whitehouse.gov/presidential-actions/2025/11/designation-of-certain-muslim-brotherhood-chapters-as-foreign-terrorist-organizations-and-specially-designated-global-terrorists/"
  },
  {
    "title": "Presidential Action Modifying Tariffs on the Government of Brazil",
    "summary": "This presidential action uses authorities provided by the Constitution and U.S. law, including the International Emergency Economic Powers Act, the National Emergencies Act, and section 604 of the Trade Act of 1974, to modify the scope of tariffs applied to the Government of Brazil. The document outlines the legal basis for the changes and describes how the tariff adjustments will be implemented and administered in relation to trade with the Government of Brazil.",
    "link": "https://www.whitehouse.gov/presidential-actions/2025/11/modifying-the-scope-of-tariffs-on-the-government-of-brazil/"
  },
  {
    "title": "Modification of the Reciprocal Tariff Scope for Selected Agricultural Products",
    "summary": "Describes a presidential action authorized under the Constitution and U.S. law, including the International Emergency Economic Powers Act, the National Emergencies Act, and section 604 of the Trade Act of 1974, to modify the scope of the reciprocal tariff applied to certain agricultural products. The summary notes the legal authorities invoked, the intended modification to the tariff’s coverage, and any administrative steps necessary to implement the change.",
    "link": "https://www.whitehouse.gov/presidential-actions/2025/11/modifying-the-scope-of-the-reciprocal-tariff-with-respect-to-certain-agricultural-products/"
  },
  {
    "title": "Proclamation by the President of the United States on Veterans Day, 2025",
    "summary": "A presidential proclamation recognizing the service and sacrifices of U.S. military veterans, highlighting their role in preserving freedom and the nation’s way of life, and designating Veterans Day 2025 as a time to honor veterans and reflect on their contributions. The proclamation expresses gratitude for veterans’ courage and dedication and invites observances in keeping with established traditions to commemorate their impact on the country.",
    "link": "https://www.whitehouse.gov/presidential-actions/2025/11/veterans-day-2025/"
  }
]