[
  {
    "title": "Presidential Permit for Expansion and Operation of the Camino Real International Bridge Border Crossing in Eagle Pass, Texas",
    "summary": "The President has authorized the City of Eagle Pass, Texas, to expand and maintain the existing vehicular and pedestrian border crossing at the Camino Real International Bridge Land Port of Entry, subject to specified conditions. This permit grants approval for the continued operation and possible expansion of the crossing facility to facilitate border traffic.",
    "link": "https://www.whitehouse.gov/presidential-actions/2025/06/presidential-permit-authorizing-the-city-of-eagle-pass-texas-to-expand-and-continue-to-maintain-and-operate-a-vehicular-and-pedestrian-border-crossing-at-the-camino-real-international-bridge-land-po/"
  },
  {
    "title": "Implementing the General Terms of the United States of America-United Kingdom Economic Prosperity Deal",
    "summary": "This executive action is taken under the authority of the U.S. Constitution and various laws, including the International Emergency Economic Powers Act, the National Emergencies Act, and the Trade Expansion Act. It pertains to implementing the agreed-upon terms of the economic partnership between the United States and the United Kingdom, aimed at promoting economic cooperation, trade, and prosperity between the two nations.",
    "link": "https://www.whitehouse.gov/presidential-actions/2025/06/implementing-the-general-terms-of-the-united-states-of-america-united-kingdom-economic-prosperity-deal/"
  },
  {
    "title": "Presidential Permit for Laredo, Texas, to Expand and Operate a Vehicular Border Crossing at the Laredo-Colombia Solidarity International Bridge Land Port of Entry",
    "summary": "The President issued a permit authorizing the City of Laredo, Texas, to expand and continue to operate a vehicular border crossing at the Laredo-Colombia Solidarity International Bridge Land Port of Entry, subject to specified conditions. This permit allows for the ongoing operation and development of the border crossing facility to facilitate vehicular traffic between the United States and Mexico at this specific location.",
    "link": "https://www.whitehouse.gov/presidential-actions/2025/06/presidential-permit-authorizing-the-city-of-laredo-texas-to-expand-and-continue-to-maintain-and-operate-a-vehicular-border-crossing-at-the-laredo-colombia-solidarity-international-bridge-land-port/"
  }
]