[
  {
    "title": "Presidential Message Recognizing Mark Twain's 190th Birthday as Part of the America 250 Initiative",
    "summary": "The White House published a presidential message commemorating the 190th birthday of Mark Twain, highlighting his role as a prominent American author and his impact on American literature through wit and imaginative storytelling. The message places Twain's legacy within the broader America 250 initiative, emphasizing the enduring value of American literary heritage and the celebration of creativity in the nation's history.",
    "link": "https://www.whitehouse.gov/presidential-actions/2025/11/america-250-presidential-message-on-mark-twains-190th-birthday/"
  },
  {
    "title": "Executive Order Establishing the Genesis Mission to Strengthen United States Scientific and Technological Leadership",
    "summary": "This executive order articulates the policy that scientific discovery and technological innovation are foundational to national progress and defines the Genesis Mission as a government-wide initiative to strengthen the United States' leadership in global technology. It directs federal departments and agencies to coordinate actions under the Genesis Mission, develop an implementation plan with measurable milestones, align existing programs and authorities as necessary, and establish reporting and accountability mechanisms to track progress toward stated goals. The order emphasizes interagency collaboration and resource alignment to accelerate discovery, innovation, and related activities across the federal government.",
    "link": "https://www.whitehouse.gov/presidential-actions/2025/11/launching-the-genesis-mission/"
  },
  {
    "title": "Executive Order Designating Certain Muslim Brotherhood Chapters as Foreign Terrorist Organizations and Specially Designated Global Terrorists",
    "summary": "This executive action designates specific chapters of the Muslim Brotherhood as Foreign Terrorist Organizations (FTOs) under the Immigration and Nationality Act and as Specially Designated Global Terrorists (SDGTs) under the International Emergency Economic Powers Act. The designation is enacted under the authority of the Constitution and U.S. law and provides the legal basis for related sanctions and restrictive measures. Designated entities are subject to the blocking of their property in the United States and prohibitions on transactions by U.S. persons and within the United States. The order directs federal agencies to implement, administer, and enforce the designation and related sanctions, including coordination with financial institutions and international partners as needed. The designation is intended to further U.S. national security and foreign policy objectives and may be maintained, revised, or rescinded as conditions change.",
    "link": "https://www.whitehouse.gov/presidential-actions/2025/11/designation-of-certain-muslim-brotherhood-chapters-as-foreign-terrorist-organizations-and-specially-designated-global-terrorists/"
  },
  {
    "title": "Modifying the Scope of Tariffs on the Government of Brazil",
    "summary": "This presidential action, issued under the President's constitutional and statutory authorities, including the International Emergency Economic Powers Act, the National Emergencies Act, and section 604 of the Trade Act of 1974, modifies the scope of tariffs applicable to imports by the Government of Brazil. The action changes which goods and categories are subject to tariffs and adjusts tariff treatment for government-related imports, in accordance with the cited authorities. The measure is published as a presidential action by The White House and takes effect as described in the order.",
    "link": "https://www.whitehouse.gov/presidential-actions/2025/11/modifying-the-scope-of-tariffs-on-the-government-of-brazil/"
  },
  {
    "title": "Presidential Action Modifying the Scope of the Reciprocal Tariff with Respect to Certain Agricultural Products",
    "summary": "This presidential action modifies the scope of the reciprocal tariff program as it applies to certain agricultural products. It asserts authority under the Constitution and laws including the International Emergency Economic Powers Act, the National Emergencies Act, and section 604 of the Trade Act of 1974. The action specifies the products affected, describes changes to tariff treatment or coverage, and provides implementation details and effective dates.",
    "link": "https://www.whitehouse.gov/presidential-actions/2025/11/modifying-the-scope-of-the-reciprocal-tariff-with-respect-to-certain-agricultural-products/"
  }
]