[
  {
    "title": "Executive Order Addressing Security Risks from Price Fixing and Anti-Competitive Behavior in the Food Supply Chain",
    "summary": "This executive order states that a stable and affordable United States food supply is essential to national and economic security and identifies price fixing and anti-competitive behavior as threats to the food supply. It notes that such conduct, particularly by foreign-controlled entities, can undermine supply stability and affordability. The order directs federal agencies to assess vulnerabilities in the food supply chain, coordinate enforcement and regulatory actions, and take steps to mitigate security risks associated with price fixing and anti-competitive practices, in order to strengthen resilience and reliability of food availability.",
    "link": "https://www.whitehouse.gov/presidential-actions/2025/12/addressing-security-risks-from-price-fixing-and-anti-competitive-behavior-in-the-food-supply-chain/"
  },
  {
    "title": "Proclamation Honoring the Memory of Specialist Sarah Beckstrom, West Virginia Army National Guard",
    "summary": "The President issues a proclamation honoring the memory of Specialist Sarah Beckstrom of the West Virginia Army National Guard. The proclamation states that, by authority vested in the President, the flag of the United States shall be flown at half-staff on federal buildings and grounds and on all U.S. military posts, ships, and installations as a mark of respect. The proclamation conveys condolences to the family and recognizes the service of Specialist Beckstrom.",
    "link": "https://www.whitehouse.gov/presidential-actions/2025/12/honoring-the-memory-of-specialist-sarah-beckstrom-west-virginia-army-national-guard/"
  },
  {
    "title": "America 250: Presidential Message on the Anniversary of the Monroe Doctrine",
    "summary": "A White House presidential message commemorating the 2025 anniversary of the Monroe Doctrine, outlining the United States' commitment to defending the nation, its interests, and its citizens, and noting the doctrine’s historical significance and continued relevance to U.S. foreign policy.",
    "link": "https://www.whitehouse.gov/presidential-actions/2025/12/america-250-presidential-message-on-the-anniversary-of-the-monroe-doctrine/"
  },
  {
    "title": "America 250 Presidential Message Recognizing Mark Twain’s 190th Birthday",
    "summary": "This White House presidential message, issued as part of the America 250 commemorations, acknowledges Mark Twain’s 190th birthday and describes him as an important figure in American literature. The message highlights Twain’s use of humor and imagination to portray everyday life and notes his enduring influence on American storytelling. It situates Twain’s legacy within the broader national celebration of American history and culture.",
    "link": "https://www.whitehouse.gov/presidential-actions/2025/11/america-250-presidential-message-on-mark-twains-190th-birthday/"
  },
  {
    "title": "Executive Order Establishing the Genesis Mission to Advance United States Scientific and Technological Capabilities",
    "summary": "This executive order establishes the Genesis Mission as a government-wide initiative to advance scientific discovery and technological innovation in the United States. It references the historical role of science and technology in national progress and sets forth the creation of a cross-agency framework to coordinate relevant federal activities, identify strategic priorities, and implement governance, milestones, and reporting requirements. The order directs federal departments and agencies to align programs, engage with the private sector and academic institutions, and monitor progress toward enhanced national scientific and technological capabilities.",
    "link": "https://www.whitehouse.gov/presidential-actions/2025/11/launching-the-genesis-mission/"
  }
]