[
  {
    "title": "Amendment to Tariff Regulations and Updated Duties for Low-Value Imports from China",
    "summary": "This executive order pertains to the modification of tariff classifications and the reassessment of duties applicable to low-value imports from the People's Republic of China. It is enacted under the authority granted to the President by the U.S. Constitution and relevant federal laws, including the International Emergency Economic Powers Act and the National Emergencies Act. The order aims to address trade considerations through changes in tariffs that affect the importation of goods valued below a specific threshold from China.",
    "link": "https://www.whitehouse.gov/presidential-actions/2025/04/amendment-to-recipricol-tariffs-and-updated-duties-as-applied-to-low-value-imports-from-the-peoples-republic-of-china/"
  },
  {
    "title": "Enhancing the Clean Coal Industry and Amending Existing Executive Order 14241",
    "summary": "This executive order focuses on enhancing the clean coal industry in the United States with the aim of promoting economic prosperity and national security. It emphasizes the need to reduce living costs and respond to the growing demand for electricity driven by emerging technologies. The order contemplates measures to support the development and implementation of clean coal technologies to meet these objectives.",
    "link": "https://www.whitehouse.gov/presidential-actions/2025/04/reinvigorating-americas-beautiful-clean-coal-industry-and-amending-executive-order-14241/"
  },
  {
    "title": "Regulatory Relief for Certain Stationary Sources to Enhance American Energy Production",
    "summary": "This executive order aims to provide regulatory relief for specific stationary sources of energy production, particularly focusing on coal-fired electricity generation. It emphasizes the importance of coal as a critical component for ensuring a reliable national power grid and aims to maintain affordable electricity for consumers. The order outlines the Federal Government's role in securing and ensuring the stability of the nation's power supply while addressing compliance burdens faced by energy producers. The initiative seeks to balance regulatory requirements with the goal of fostering American energy security.",
    "link": "https://www.whitehouse.gov/presidential-actions/2025/04/rregulatory-relief-for-certain-stationary-sources-to-promote-american-energy/"
  },
  {
    "title": "Executive Order on Domestic Energy Resource Development",
    "summary": "This Executive Order outlines the administration's commitment to enhancing the development and utilization of domestic energy resources. It emphasizes the importance of removing barriers that may hinder the identification, production, investment in, or overall use of these resources. The order aims to streamline the processes related to energy resource development in order to promote increased energy independence and efficiency.",
    "link": "https://www.whitehouse.gov/presidential-actions/2025/04/protecting-american-energy-from-state-overreach/"
  },
  {
    "title": "Executive Order on Enhancing the Reliability and Security of the U.S. Electric Grid",
    "summary": "This Executive Order aims to address the increasing electricity demand in the United States due to advancements in technology, particularly the growth of artificial intelligence data centers and a rise in domestic consumption. The Order focuses on improving the reliability and security of the electric grid to accommodate this surge in demand and ensure a stable energy supply for the nation's needs.",
    "link": "https://www.whitehouse.gov/presidential-actions/2025/04/strengthening-the-reliability-and-security-of-the-united-states-electric-grid/"
  },
  {
    "title": "Extension of Enforcement Delay for TikTok Applications",
    "summary": "This executive order extends the enforcement delay specified in Section 2(a) of Executive Order 14166, which was issued on January 20, 2025. The order pertains to the Application of the Protecting Americans from Foreign Adversary Controlled Applications Act specifically related to the TikTok application. This extension aims to provide additional time for consideration of the implications surrounding enforcement actions regarding TikTok.",
    "link": "https://www.whitehouse.gov/presidential-actions/2025/04/extending-the-tiktok-enforcement-delay/"
  }
]