[
  {
    "title": "Presidential Proclamation for Father's Day 2025",
    "summary": "This proclamation by the President of the United States recognizes Father's Day in 2025, emphasizing the roles of fathers as leaders and protectors in families and society. The statement acknowledges the dedication of fathers in shaping the future through their love and commitment while paying tribute to their contributions.",
    "link": "https://www.whitehouse.gov/presidential-actions/2025/06/fathers-day-2025/"
  },
  {
    "title": "Proclamation for Flag Day and National Flag Week, 2025",
    "summary": "This proclamation commemorates June 14, 1777, when the Second Continental Congress adopted the First Flag Resolution, establishing the design of the United States flag, known as the Stars and Stripes. The proclamation recognizes Flag Day and the observance of National Flag Week in 2025, encouraging citizens to celebrate and reflect on the significance of the flag in representing the nation's history and values.",
    "link": "https://www.whitehouse.gov/presidential-actions/2025/06/flag-day-and-national-flag-week-2025/"
  },
  {
    "title": "Review of Proposed Acquisition of United States Steel Corporation by Nippon Steel Corporation",
    "summary": "This executive order initiates a formal review by the Committee on Foreign Investment in the United States regarding the acquisition of the United States Steel Corporation by Nippon Steel Corporation. The review is conducted under the authority granted to the President by the Constitution and the Defense Production Act of 1950. The process assesses potential national security implications associated with the acquisition proposal.",
    "link": "https://www.whitehouse.gov/presidential-actions/2025/06/regarding-the-proposed-acquisition-of-the-united-states-steel-corporation-by-nippon-steel-corporation/"
  },
  {
    "title": "Proclamation on the 250th Anniversary of the United States Army",
    "summary": "This proclamation commemorates the 250th anniversary of the establishment of the United States Army, which was founded on June 14, 1775, by a vote of the Second Continental Congress. The declaration highlights the Army's ongoing commitment to the nation through its strength, service, and discipline over the past two and a half centuries.",
    "link": "https://www.whitehouse.gov/presidential-actions/2025/06/250th-anniversary-of-the-founding-of-the-united-states-army/"
  },
  {
    "title": "Presidential Memorandum on Energy Generation in the Columbia River Basin",
    "summary": "This memorandum addresses the management of environmental policies related to energy generation in the Columbia River Basin. It outlines directives aimed at balancing environmental considerations with the need for power generation in the region. The memorandum is intended for key cabinet members and agencies tasked with implementing the policies described within. The goal is to enhance energy production in the area while navigating regulatory frameworks that affect such initiatives.",
    "link": "https://www.whitehouse.gov/presidential-actions/2025/06/stopping-radical-environmentalism-to-generate-power-for-the-columbia-river-basin/"
  },
  {
    "title": "Executive Order on Wildfire Prevention and Response Strategies",
    "summary": "This Executive Order addresses the impacts of the January 2025 wildfires in Los Angeles, which demonstrated significant challenges in response capabilities of state and local governments. The Order outlines measures aimed at enhancing wildfire prevention and response efforts, promoting coordination among federal, state, and local agencies, improving resource allocation, and fostering community resilience against future wildfire events. The Order emphasizes the necessity of developing commonsense strategies to mitigate wildfire risks effectively and streamline response mechanisms in emergency situations.",
    "link": "https://www.whitehouse.gov/presidential-actions/2025/06/empowering-commonsense-wildfire-prevention-and-response/"
  },
  {
    "title": "Presidential Permit for Green Corridors, LLC to Establish Elevated Guideway Border Crossing Near Laredo, Texas",
    "summary": "This executive order grants Green Corridors, LLC permission to construct, operate, and maintain a commercial elevated guideway crossing located at the international border between the United States and Mexico in Laredo, Texas. The permit is issued under the authority of the President of the United States and is subject to specific conditions as outlined in the order.",
    "link": "https://www.whitehouse.gov/presidential-actions/2025/06/presidential-permit-authorizing-green-corridors-llc-to-construct-maintain-and-operate-commercial-elevated-guideway-border-crossing-near-laredo-texas-at-the-international-boundary-between-the-us-mexico/"
  },
  {
    "title": "Memorandum on Department of Defense Security Support for Homeland Security Operations",
    "summary": "This memorandum outlines the need for security support provided by the Department of Defense to assist the Department of Homeland Security in maintaining order and safety, particularly in response to various incidents of violence related to the enforcement of federal law. It directs coordination between the Secretary of Defense, the Attorney General, and the Secretary of Homeland Security to enhance protective measures aimed at ensuring the effective functioning of DHS operations amid ongoing threats.",
    "link": "https://www.whitehouse.gov/presidential-actions/2025/06/department-of-defense-security-for-the-protection-of-department-of-homeland-security-functions/"
  },
  {
    "title": "Executive Order on Advancing Supersonic Flight Technologies",
    "summary": "This executive order outlines the intention of the United States to promote advancements in supersonic flight technologies. It highlights the need to address and update existing regulations that have been in place for over 50 years, which are perceived as outdated and restrictive. The order sets forth a goal of fostering innovation in aerospace to enhance the nation's leadership in this sector.",
    "link": "https://www.whitehouse.gov/presidential-actions/2025/06/leading-the-world-in-supersonic-flight/"
  },
  {
    "title": "Establishment of Guidelines for the Use of Unmanned Aircraft Systems in Support of Public Safety and Innovation",
    "summary": "This executive order outlines the intent to develop a framework for the integration of unmanned aircraft systems (UAS), commonly known as drones, into national airspace. It highlights the dual potential of UAS to improve public safety while fostering innovation in the United States. The order emphasizes the need to address the challenges posed by their misuse by malicious actors, ensuring that the deployment of UAS is conducted responsibly and effectively to meet public safety needs and maintain a leadership position in technological advancements.",
    "link": "https://www.whitehouse.gov/presidential-actions/2025/06/restoring-american-airspace-sovereignty/"
  }
]