[
  {
    "title": "Proclamation Amending Import Adjustments for Timber, Lumber, and Their Derivative Products under Section 232",
    "summary": "A presidential proclamation states that on July 1, 2025, the Secretary of Commerce transmitted a report describing the effects of imports of timber, lumber, and their derivative products on United States national security under Section 232. Based on the report, the proclamation implements amendments to adjust imports of timber, lumber, and their derivative products into the United States, clarifying the scope of the adjustment program and the effective date of the amendments.",
    "link": "https://www.whitehouse.gov/presidential-actions/2025/12/amendments-to-adjusting-imports-of-timber-lumber-and-their-derivative-products-into-the-united-states/"
  },
  {
    "title": "Implementation of the United States-Israel Agreement on Trade in Agricultural Products and for Other Purposes",
    "summary": "This presidential action implements the United States-Israel Agreement on Trade in Agricultural Products, as part of the United States-Israel Free Trade Area (USIFTA). The agreement was entered into on April 22, 1985, and was approved by Congress in section 3 of the United States–Israel Free Trade Area Implementation Act. The action directs the measures necessary to carry out the agreement's trade provisions related to agricultural products and for other purposes, including aligning applicable U.S. regulatory and enforcement authorities with USIFTA commitments, coordinating with relevant agencies, and undertaking the administrative steps required to effectuate the agreement.",
    "link": "https://www.whitehouse.gov/presidential-actions/2025/12/to-implement-the-united-states-israel-agreement-on-trade-in-agricultural-products-and-for-other-purposes/"
  },
  {
    "title": "Executive Order Adjusting Rates of Basic Pay for Statutory Federal Pay Systems",
    "summary": "An executive order issued under the authority of the Constitution and applicable federal law to set or adjust the basic pay rates for employees covered by statutory pay systems in the federal pay structure (as defined in 5 U.S.C. 5302(1)). The order specifies that these rates, as adjusted under 5 U.S.C. 5303, are established and to be applied going forward, and directs relevant federal agencies to implement the new pay scales in accordance with the statutory framework. It identifies the statutory pay systems affected and provides guidance on the effective date of the adjustments and the administrative actions required to carry out the pay changes.",
    "link": "https://www.whitehouse.gov/presidential-actions/2025/12/adjustments-of-certain-rates-of-pay/"
  },
  {
    "title": "Executive Order on Ensuring American Space Superiority",
    "summary": "This executive order establishes federal policy to achieve and maintain American space superiority. It states that leadership in space is a measure of national vision and determination, and that the technologies developed to pursue this objective contribute to the nation's strength, security, and prosperity. The order asserts the President's authority to direct actions under this policy and outlines the initial purpose as described in Section 1.",
    "link": "https://www.whitehouse.gov/presidential-actions/2025/12/ensuring-american-space-superiority/"
  },
  {
    "title": "Executive Order Providing for the Closure of Federal Executive Departments and Agencies on December 24, 2025, and December 26, 2025",
    "summary": "Under the authority vested in the President by the Constitution and the laws of the United States, this order directs that all executive departments and agencies of the Federal Government be closed and that their employees be excused from duty on Wednesday, December 24, 2025, and Friday, December 26, 2025. The directive specifies the dates for which federal operations are suspended and applies to all executive departments and agencies subject to the order.",
    "link": "https://www.whitehouse.gov/presidential-actions/2025/12/providing-for-the-closure-of-executive-departments-and-agencies-of-the-federal-government-on-december-24-2025-and-december-26-2025/"
  },
  {
    "title": "Executive Order to Expand Medical Marijuana and Cannabidiol Research",
    "summary": "This presidential action directs federal agencies to expand and facilitate research into the medical uses of marijuana and cannabidiol (CBD). Building on a 2023 Food and Drug Administration (FDA) review, the order aims to identify and reduce regulatory barriers to research, improve the research infrastructure, and enhance interagency coordination to advance medical knowledge and potential treatments. It outlines steps to ensure safety, quality, and appropriate oversight while enabling scientific study of cannabis-derived substances and their potential medical applications.",
    "link": "https://www.whitehouse.gov/presidential-actions/2025/12/increasing-medical-marijuana-and-cannabidiol-research/"
  },
  {
    "title": "Executive Order Restricting and Limiting the Entry of Foreign Nationals to Protect the Security of the United States",
    "summary": "This executive action restricts the entry of certain foreign nationals into the United States to prevent threats to national security and public safety. It notes that these restrictions were upheld by the Supreme Court and states that the policies were reinstated on January 20, 2025 under Executive Order 14161. The action directs federal agencies to implement and enforce the entry restrictions and related screening measures within the U.S. immigration and border-control framework.",
    "link": "https://www.whitehouse.gov/presidential-actions/2025/12/restricting-and-limiting-the-entry-of-foreign-nationals-to-protect-the-security-of-the-united-states/"
  }
]