[
  {
    "title": "Proclamation by the President Declaring National Day of Remembrance for Charlie Kirk",
    "summary": "This presidential proclamation, issued on September 10, 2025, designates a National Day of Remembrance in response to the assassination of Charlie Kirk in a campus courtyard. It calls for national mourning and reflection, honors the memory of Charlie Kirk, and outlines observances and actions intended to support the family and those affected by the incident.",
    "link": "https://www.whitehouse.gov/presidential-actions/2025/10/national-day-of-remembrance-for-charlie-kirk/"
  },
  {
    "title": "Proclamation by the President on the 250th Anniversary of the Founding of the United States Navy",
    "summary": "A presidential proclamation commemorating the 250th anniversary of the founding of the United States Navy. The document notes that two hundred fifty years ago the Second Continental Congress established what would become the Navy and describes the historical development and significance of the naval service. It recognizes the contributions of Navy personnel and their families and underscores the importance of honoring maritime heritage while acknowledging the Navy's role in national security and American history.",
    "link": "https://www.whitehouse.gov/presidential-actions/2025/10/250th-anniversary-of-the-founding-of-the-united-states-navy/"
  },
  {
    "title": "Proclamation: General Pulaski Memorial Day, 2025",
    "summary": "The President issues a proclamation recognizing Brigadier General Casimir Pulaski, a Polish-born officer who offered his services to the American cause during the fight for independence, beginning in 1777. The proclamation notes Pulaski's contributions as a cavalry commander and honors his legacy by declaring General Pulaski Memorial Day for 2025. Pulaski is described with epithets such as the 'Soldier of Liberty' and the 'Father of the American Cavalry.'",
    "link": "https://www.whitehouse.gov/presidential-actions/2025/10/general-pulaski-memorial-day-2025/"
  },
  {
    "title": "Presidential Proclamation Declaring National Breast Cancer Awareness Month",
    "summary": "This presidential proclamation announces National Breast Cancer Awareness Month. It notes that breast cancer affects many Americans and their families each day, acknowledges the resilience of those affected, and states the President's intent to reaffirm the administration's commitment to efforts related to awareness, research, prevention, treatment, and support for individuals and families impacted by breast cancer.",
    "link": "https://www.whitehouse.gov/presidential-actions/2025/10/presidential-message-on-national-breast-cancer-awareness-month/"
  },
  {
    "title": "Nomination of Lee Lipton to be Ambassador Extraordinary and Plenipotentiary of the United States to the Republic of the Philippines",
    "summary": "The White House announced the nomination of Lee Lipton, a resident of Florida, to serve as the United States Ambassador Extraordinary and Plenipotentiary to the Republic of the Philippines. The nomination was included in the administration's nominations sent to the Senate.",
    "link": "https://www.whitehouse.gov/presidential-actions/2025/10/nominations-sent-to-the-senate-85f4/"
  }
]