[
  {
    "title": "Establishment of an Emergency Board to Investigate Disputes Between the Long Island Rail Road Company and Certain of Its Employees Represented by Labor Organizations",
    "summary": "This presidential action establishes an Emergency Board to investigate disputes between the Long Island Rail Road Company and certain of its employees represented by labor organizations. Under the Railway Labor Act, the board will examine the issues in dispute, conduct hearings as needed, and report its findings and recommendations to assist the parties in reaching a resolution.",
    "link": "https://www.whitehouse.gov/presidential-actions/2025/09/establishing-an-emergency-board-to-investigate-disputes-between-the-long-island-rail-road-company-and-certain-of-its-employees-represented-by-certain-labor-organizations/"
  },
  {
    "title": "Further Extending the TikTok Enforcement Delay Under EO 14166",
    "summary": "This presidential action extends the enforcement delay specified in section 2(a) of Executive Order 14166, issued January 20, 2025, which implements the Protecting Americans from Foreign Adversary Controlled Applications Act with respect to TikTok. The extension is based on presidential authority under the Constitution and federal law, and maintains the current timetable for enforcing the TikTok-related provisions of the act.",
    "link": "https://www.whitehouse.gov/presidential-actions/2025/09/further-extending-the-tiktok-enforcement-delay-9dde/"
  },
  {
    "title": "Proclamation Honoring the Memory of Charlie Kirk and Directing the U.S. Flag to be Flown at a Designated Level",
    "summary": "A presidential proclamation honoring the memory of Charlie Kirk, issued under the President's authority, directing that the flag of the United States be flown at a designated level on a specified date to mark the occasion.",
    "link": "https://www.whitehouse.gov/presidential-actions/2025/09/honoring-the-memory-of-charlie-kirk/"
  },
  {
    "title": "Presidential Action Implementing the United States–Japan Agreement",
    "summary": "This presidential action asserts authority under the International Emergency Economic Powers Act, the National Emergencies Act, and section 232 of the Trade Expansion Act of 1962 to implement the United States–Japan Agreement. The action directs relevant agencies to implement and enforce the agreement’s provisions, coordinating regulatory steps as necessary to fulfill United States obligations under the agreement, and establishes the framework for carrying out the implementation consistent with the cited authorities.",
    "link": "https://www.whitehouse.gov/presidential-actions/2025/09/implementing-the-united-states-japan-agreement/"
  }
]