[
  {
    "title": "Executive Order on Education Access and COVID-19 Vaccine Mandates",
    "summary": "This executive order addresses the requirements for COVID-19 vaccination within educational institutions, specifically targeting school districts and universities that implement policies tying educational access to vaccination status. The order outlines the intention to ensure that education remains accessible regardless of vaccination status, thereby prohibiting educational institutions from mandating COVID-19 vaccinations as a condition for enrollment or attendance. The executive order aims to balance public health considerations with educational access for students.",
    "link": "https://www.whitehouse.gov/presidential-actions/2025/02/keeping-education-accessible-and-ending-covid-19-vaccine-mandates-in-schools/"
  },
  {
    "title": "Establishment of the President's Make America Healthy Again Commission",
    "summary": "This executive order establishes the President's Make America Healthy Again Commission aimed at addressing the issue of declining life expectancy in the United States compared to other developed nations. The Commission will focus on developing strategies to improve public health and increase life expectancy, which currently stands at an average of 78.8 years in the United States, significantly lower than the 82.6 years average in comparable countries. The directive emphasizes the need for targeted initiatives to enhance health outcomes for Americans.",
    "link": "https://www.whitehouse.gov/presidential-actions/2025/02/establishing-the-presidents-make-america-healthy-again-commission/"
  },
  {
    "title": "Establishment of a Coordinated Approach to U.S. Foreign Relations",
    "summary": "This executive order outlines the President's authority to oversee foreign policy as vested by the U.S. Constitution. It emphasizes the importance of a unified approach in managing international relations, coordinating efforts among various governmental departments, and ensuring effective communication regarding U.S. foreign policy objectives. The order aims to enhance collaboration and consistency in the execution of foreign policy actions.",
    "link": "https://www.whitehouse.gov/presidential-actions/2025/02/one-voice-for-americas-foreign-relations/"
  },
  {
    "title": "Implementation of the Department of Government Efficiency Workforce Optimization Initiative",
    "summary": "This executive order outlines a plan to reform the Federal bureaucracy aimed at enhancing accountability to the public. The initiative focuses on reducing inefficiencies, eliminating excessive administrative structures, and addressing issues of insularity within government operations. The objective is to create a more streamlined and effective Federal workforce.",
    "link": "https://www.whitehouse.gov/presidential-actions/2025/02/implementing-the-presidents-department-of-government-efficiency-workforce-optimization-initiative/"
  }
]