[
  {
    "title": "Proclamation by the President Regarding Regulatory Relief for Certain Stationary Sources to Promote American Mineral Security",
    "summary": "This proclamation emphasizes the importance of copper to the United States' energy, defense, and manufacturing sectors, including its role in the electric grid and in semiconductors. It states the objective of maintaining and expanding domestic copper smelting capacity to reduce dependence on foreign supply chains. The proclamation indicates that regulatory relief for certain stationary sources will be pursued as a means to promote American mineral security, with the goal of supporting domestic mineral production and processing. It discusses potential implications for the relevant industries and supply chains tied to copper and other minerals deemed critical to national security and the economy, and outlines the government’s approach to aligning regulatory actions with the objective of strengthening domestic mineral resources without detailing the specific measures in this summary.",
    "link": "https://www.whitehouse.gov/presidential-actions/2025/10/regulatory-relief-for-certain-stationary-sources-to-promote-american-mineral-security/"
  },
  {
    "title": "Nomination of Jennifer Wicks McNamara to be Ambassador Extraordinary and Plenipotentiary to the Socialist Republic of Vietnam",
    "summary": "The White House announced that Jennifer Wicks McNamara, a resident of Virginia, has been nominated by the President to serve as the United States Ambassador Extraordinary and Plenipotentiary to the Socialist Republic of Vietnam. The nomination has been transmitted to the United States Senate for confirmation.",
    "link": "https://www.whitehouse.gov/presidential-actions/2025/10/nomination-sent-to-the-senate/"
  },
  {
    "title": "Proclamation Designating National Day of Remembrance for Charlie Kirk",
    "summary": "The President issues a proclamation designating a National Day of Remembrance for Charlie Kirk to honor his memory. The proclamation directs federal departments and agencies to observe and facilitate appropriate commemorations on the designated day and invites state and local governments, organizations, and the public to participate in remembrance activities and moments of reflection.",
    "link": "https://www.whitehouse.gov/presidential-actions/2025/10/national-day-of-remembrance-for-charlie-kirk/"
  }
]