[
  {
    "title": "Promotion of National Security and Economic Stability through Regulation of Processed Critical Minerals",
    "summary": "This executive order, issued under the authority of the Trade Expansion Act of 1962, emphasizes the importance of a strong national defense linked to a resilient economy and price stability. It outlines actions to address issues related to processed critical minerals and their derivative products to ensure national security and economic resilience. The order highlights the necessity of effective management of these resources as a strategic priority for the nation.",
    "link": "https://www.whitehouse.gov/presidential-actions/2025/04/ensuring-national-security-and-economic-resilience-through-section-232-actions-on-processed-critical-minerals-and-derivative-products-a08a/"
  },
  {
    "title": "Executive Order on Improving Federal Office Space Management",
    "summary": "This executive order establishes guidelines for the management of federal office space with the aim of enhancing service delivery across the United States. It acknowledges the diverse geographical distribution of the American population and emphasizes the importance of providing efficient and cost-effective federal services. The order outlines the key objectives and strategies for optimizing federal office space to better meet the needs of citizens throughout various urban, suburban, and rural settings.",
    "link": "https://www.whitehouse.gov/presidential-actions/2025/04/restoring-common-sense-to-federal-office-space-management/"
  },
  {
    "title": "Presidential Executive Order on National Security and Economic Resilience Regarding Processed Critical Minerals",
    "summary": "This Executive Order, issued by the President under the authority of the Constitution and the Trade Expansion Act of 1962, emphasizes the connection between national defense and economic strength. It outlines the government's policy aimed at ensuring economic resilience through actions taken under Section 232 concerning processed critical minerals and their derived products. The order highlights the importance of maintaining a robust economy and price stability as critical components of national security.",
    "link": "https://www.whitehouse.gov/presidential-actions/2025/04/ensuring-national-security-and-economic-resilience-through-section-232-actions-on-processed-critical-minerals-and-derivative-products/"
  },
  {
    "title": "Executive Order on Reducing Prescription Drug Prices",
    "summary": "This executive order outlines the measures taken during the President's first term aimed at reducing prescription drug prices for American patients. It highlights the significant actions and policies implemented to address the affordability of medications and aims to reinforce the commitment to prioritizing the financial well-being of citizens in the realm of healthcare.",
    "link": "https://www.whitehouse.gov/presidential-actions/2025/04/lowering-drug-prices-by-once-again-putting-americans-first/"
  },
  {
    "title": "Improving Efficiency in Federal Procurement Processes",
    "summary": "This Executive Order outlines initiatives aimed at enhancing the efficiency and cost-effectiveness of federal procurement practices. It recognizes the Federal Government as the largest purchaser of goods and services and addresses the existing challenges that make it difficult for businesses to engage with government contracts. The order seeks to streamline processes and reduce unnecessary burdens in order to facilitate better access for businesses to federal procurement opportunities.",
    "link": "https://www.whitehouse.gov/presidential-actions/2025/04/restoring-common-sense-to-federal-procurement/"
  },
  {
    "title": "Presidential Memorandum on Preventing Unauthorized Access to Social Security Benefits",
    "summary": "This memorandum addresses the issue of unauthorized individuals obtaining Social Security Act benefits. It outlines the directives for key federal agencies, including the Department of Justice, Department of Labor, Department of Health and Human Services, Department of Homeland Security, and the Social Security Administration, to enforce measures aimed at preventing illegal aliens from accessing these benefits. The memorandum emphasizes the importance of collaboration among these entities to ensure compliance with the law regarding eligible beneficiaries.",
    "link": "https://www.whitehouse.gov/presidential-actions/2025/04/preventing-illegal-aliens-from-obtaining-social-security-act-benefits/"
  },
  {
    "title": "Enhancing Environmental Permit Evaluation Through Technology Integration",
    "summary": "This executive order addresses the need for improved efficiency in the evaluation of environmental permits by integrating modern technologies. It aims to reduce unnecessary delays in infrastructure projects that have significant implications for the economy. The order highlights the commitment of the administration to apply technological advancements to longstanding challenges, with the objective of achieving faster and more effective outcomes in the permitting process.",
    "link": "https://www.whitehouse.gov/presidential-actions/2025/04/updating-permitting-technology-for-the-21st-century/"
  },
  {
    "title": "Presidential Memorandum on Military Operations for Southern Border Security",
    "summary": "This memorandum outlines directives regarding the utilization of military resources to enhance security efforts along the southern border of the United States. The memorandum is addressed to the Secretaries of Defense, Interior, Agriculture, and Homeland Security, emphasizing the role of military support in managing border security and addressing unauthorized entry. The memorandum is issued under the authority of the President as Commander in Chief and highlights the necessity for cohesive action among various government departments to address issues related to border control.",
    "link": "https://www.whitehouse.gov/presidential-actions/2025/04/military-mission-for-sealing-the-southern-border-of-the-united-states-and-repelling-invasions/"
  }
]