[
  {
    "title": "Proclamation on Adjusting Imports of Aluminum and Steel into the United States",
    "summary": "This proclamation addresses the findings of a report submitted by the Secretary of Commerce regarding the impact of imported steel mill articles on the national security of the United States. The report was part of an ongoing investigation under Section 232 of the Trade Expansion Act. The proclamation outlines the steps being taken to adjust the imports of aluminum and steel to protect U.S. national security interests as informed by the Secretary's findings.",
    "link": "https://www.whitehouse.gov/presidential-actions/2025/06/adjusting-imports-of-aluminum-and-steel-into-the-united-states/"
  },
  {
    "title": "Sequestration Order for Fiscal Year 2026 Under the Balanced Budget and Emergency Deficit Control Act",
    "summary": "This executive order outlines the directive for implementing budgetary spending restrictions for the fiscal year 2026, as mandated by Section 251A of the Balanced Budget and Emergency Deficit Control Act. The order specifies that on October 1, 2025, direct spending budgetary resources will be subject to adjustments based on the provisions set forth in the Act, with the intent to manage federal spending and address potential budget deficits.",
    "link": "https://www.whitehouse.gov/presidential-actions/2025/05/sequestration-order-for-fiscal-year-2026-pursuant-to-section-251a-of-the-balanced-budget-and-emergency-deficit-control-act-as-amended/"
  },
  {
    "title": "Proclamation on the 101st Anniversary of the United States Border Patrol",
    "summary": "This proclamation commemorates the 101st anniversary of the United States Border Patrol (USBP), recognizing the agency's role in safeguarding the nation's borders and addressing threats such as drug trafficking and illegal entry. It honors the dedication and service of Border Patrol agents who actively work to protect national security and uphold laws related to border enforcement.",
    "link": "https://www.whitehouse.gov/presidential-actions/2025/05/101st-anniversary-of-the-united-states-border-patrol/"
  },
  {
    "title": "Proclamation on World Trade Week, 2025",
    "summary": "This proclamation designates World Trade Week and emphasizes the importance of balanced and reciprocal trade practices with other nations. It reflects a commitment to supporting American workers and industries by addressing previous trade imbalances and promoting domestic manufacturing. The proclamation aims to recognize the significance of international trade in contributing to the economy while advocating for fair treatment of American labor and resources in the global market.",
    "link": "https://www.whitehouse.gov/presidential-actions/2025/05/world-trade-week-2025/"
  },
  {
    "title": "Proclamation for Memorial Day 2025",
    "summary": "This proclamation issued by the President of the United States designates Memorial Day 2025 as a day of remembrance to honor the individuals who have died while serving in the armed forces. It emphasizes the importance of reflecting on their sacrifices for the nation and expresses gratitude for their service. The proclamation seeks to promote peace and respect for those who have defended national liberty throughout history.",
    "link": "https://www.whitehouse.gov/presidential-actions/2025/05/prayer-for-peace-memorial-day-2025/"
  },
  {
    "title": "Proclamation Declaring National Physical Fitness and Sports Month 2025",
    "summary": "This proclamation by the President of the United States designates the month of May 2025 as National Physical Fitness and Sports Month. The declaration highlights the importance of physical fitness and participation in sports as critical elements in promoting longer and healthier lives. It emphasizes the opportunities presented by engaging in sports and fitness activities to enhance overall health and well-being.",
    "link": "https://www.whitehouse.gov/presidential-actions/2025/05/national-physical-fitness-and-sports-month-2025/"
  },
  {
    "title": "Executive Order on Advanced Nuclear Reactor Technologies for National Security",
    "summary": "This Executive Order establishes measures to enhance the resilience, security, and reliability of the energy supply critical to defense facilities in the United States. The directive outlines the national security importance of deploying advanced nuclear reactor technologies, in accordance with statutory guidelines regarding energy infrastructure. It emphasizes the need for a secure energy supply to support the operational readiness of designated defense installations.",
    "link": "https://www.whitehouse.gov/presidential-actions/2025/05/deploying-advanced-nuclear-reactor-technologies-for-national-security/"
  },
  {
    "title": "Executive Order on the Reform of the Nuclear Regulatory Commission",
    "summary": "This executive order outlines the importance of nuclear energy in enhancing national and economic security. It emphasizes the role of domestic fossil fuel production alongside nuclear energy in reducing dependence on international energy sources. The order sets forth directives aimed at reforming the Nuclear Regulatory Commission to improve its efficiency and effectiveness in ensuring the safe development and use of nuclear energy in the United States.",
    "link": "https://www.whitehouse.gov/presidential-actions/2025/05/ordering-the-reform-of-the-nuclear-regulatory-commission/"
  },
  {
    "title": "Reformation of Nuclear Reactor Testing Protocols at the Department of Energy",
    "summary": "This executive order outlines the initiative to reform the protocols for nuclear reactor testing within the Department of Energy. It emphasizes the United States' role in the advancement of civilian nuclear power through various government entities, including the Atomic Energy Commission and the Idaho National Laboratory. The order seeks to enhance the effectiveness and efficiency of nuclear reactor testing to ensure safety and progress in nuclear energy development.",
    "link": "https://www.whitehouse.gov/presidential-actions/2025/05/reforming-nuclear-reactor-testing-at-the-department-of-energy/"
  },
  {
    "title": "Executive Order to Reinvigorate the Nuclear Industrial Base",
    "summary": "This executive order outlines the intent of the President to strengthen the nuclear industrial base of the United States. It acknowledges the historical significance of American advancements in nuclear energy technology and addresses current challenges faced in the global energy landscape. The order emphasizes the need for innovation and support within the nuclear sector to ensure the United States maintains a competitive edge in nuclear technology and energy production.",
    "link": "https://www.whitehouse.gov/presidential-actions/2025/05/reinvigorating-the-nuclear-industrial-base/"
  }
]