[
  {
    "title": "Executive Order Addressing Threats to the United States by the Government of Cuba",
    "summary": "This presidential action asserts authority under the Constitution and U.S. law, including the International Emergency Economic Powers Act and the National Emergencies Act, to address threats posed by the Government of Cuba. It announces determinations and orders to be implemented, with Section 1 detailing the initial measures to be taken.",
    "link": "https://www.whitehouse.gov/presidential-actions/2026/01/addressing-threats-to-the-united-states-by-the-government-of-cuba/"
  },
  {
    "title": "Executive Order Addressing Substance Use Disorder Through the Great American Recovery Initiative",
    "summary": "This executive order, issued by the President, establishes the Great American Recovery Initiative to address substance use disorder, also known as addiction. It identifies addiction as a national crisis that affects families in every community and neighborhood in the United States and cites an estimate of approximately 48.4 million people affected. The order contains a section titled 'Purpose and Policy,' outlining the overarching objective to address substance use disorder through federal action and coordination as part of a national strategy.",
    "link": "https://www.whitehouse.gov/presidential-actions/2026/01/addressing-addiction-through-the-great-american-recovery-initiative/"
  },
  {
    "title": "Proclamation for the Year of Celebration and Rededication, 2026",
    "summary": "On January 1, 2026, the President issued a proclamation announcing a year-long national observance to commemorate the 250th anniversary of American freedom and independence. The proclamation designates 2026 as the Year of Celebration and Rededication and notes the historical significance of July 4, 1776.",
    "link": "https://www.whitehouse.gov/presidential-actions/2026/01/year-of-celebration-and-rededication-2026/"
  },
  {
    "title": "Executive Order Addressing Rebuild Efforts in Los Angeles After Wildfire Disasters",
    "summary": "This presidential action asserts the President's authority to issue directives related to rebuilding Los Angeles after wildfire disasters. It notes that one year earlier, California state and Los Angeles city and county governments failed to contain wildfires that ravaged the area and destroyed nearly 40,000 acres of homes and businesses. The order states the purpose of addressing these state and local failures by coordinating federal actions to support rebuilding and resilience, clarify responsibilities among federal, state, and local governments, and enhance preparation, response, and reconstruction efforts to reduce future wildfire impacts.",
    "link": "https://www.whitehouse.gov/presidential-actions/2026/01/addressing-state-and-local-failures-to-rebuild-los-angeles-after-wildfire-disasters/"
  },
  {
    "title": "Order Continuation of the Federal Emergency Management Agency Review Council as a Federal Advisory Committee",
    "summary": "The President issues an executive action under the Federal Advisory Committee Act to continue the Federal Emergency Management Agency Review Council, a body established by a prior executive order. The continuation maintains the council's role to provide advice and recommendations to the President and to the Federal Emergency Management Agency on matters related to FEMA programs and activities, and preserves its status as a federal advisory committee under the Act. The order confirms that the council will continue its duties, membership, and reporting requirements, enabling ongoing input on FEMA policy, preparedness, response, and recovery initiatives.",
    "link": "https://www.whitehouse.gov/presidential-actions/2026/01/continuance-of-the-federal-emergency-management-agency-review-council/"
  },
  {
    "title": "Proclamation on Martin Luther King Jr. Federal Holiday, 2026",
    "summary": "A presidential proclamation designating Martin Luther King Jr. Day as a federal holiday for 2026 and recognizing the civil rights leader's efforts to advance justice, citing the principles of the Declaration of Independence and reaffirming the nation's commitment to equality and to honoring King's legacy.",
    "link": "https://www.whitehouse.gov/presidential-actions/2026/01/martin-luther-king-jr-federal-holiday-2026/"
  }
]