[
  {
    "title": "Presidential Proclamation: Constitution Week, 2025",
    "summary": "This document is a presidential proclamation designating Constitution Week 2025 to commemorate the 238th anniversary of the signing of the United States Constitution. It describes the Constitution as the founding charter of the United States and calls for reflection on the nation's framework of self-government and the rule of law, while encouraging observances, educational activities, and other efforts to promote understanding of constitutional heritage and principles.",
    "link": "https://www.whitehouse.gov/presidential-actions/2025/09/constitution-week-2025/"
  },
  {
    "title": "Memorandum of Understanding Between the United States and the United Kingdom on Technology Prosperity Cooperation",
    "summary": "This memorandum establishes a bilateral framework between the Government of the United States of America and the Government of the United Kingdom of Great Britain and Northern Ireland to advance science and technology capabilities and standards. It sets forth the intent to collaborate on research, development, and policy coordination related to technology prosperity, including information sharing and joint activities. The agreement defines mechanisms for identifying areas of mutual interest, coordinating standards and interoperability efforts, and implementing collaborative projects and exchanges. It designates respective roles and a process for ongoing review to monitor progress and expand cooperation in areas related to technology development, innovation, and related policy initiatives. The document does not authorize funding or create legally binding obligations outside the scope of the memorandum, but establishes the intention to pursue bilateral actions through a formal cooperation framework.",
    "link": "https://www.whitehouse.gov/presidential-actions/2025/09/memorandum-of-understanding-between-the-government-of-the-united-states-of-america-and-the-government-of-the-united-kingdom-of-great-britain-and-northern-ireland-regarding-the-technology-prosperity-de/"
  },
  {
    "title": "Establishment of an Emergency Board to Investigate Disputes Between the Long Island Rail Road Company and Certain of Its Employees Represented by Certain Labor Organizations",
    "summary": "The President issued an executive action establishing an Emergency Board under the Railway Labor Act to investigate disputes between the Long Island Rail Road Company and certain of its employees represented by labor organizations. The involved unions include the Transportation Communications Union, the Brotherhood of Locomotive Engineers and Trainmen, the Brotherhood of Railroad Signalmen, and the International Association of Machinists and Aerospace Workers, among others. The Board is authorized to conduct inquiries, receive relevant evidence, and report its findings and recommendations to the President to facilitate the settlement of the disputes.",
    "link": "https://www.whitehouse.gov/presidential-actions/2025/09/establishing-an-emergency-board-to-investigate-disputes-between-the-long-island-rail-road-company-and-certain-of-its-employees-represented-by-certain-labor-organizations/"
  },
  {
    "title": "Executive Order Extending the TikTok Enforcement Delay Under the Protecting Americans from Foreign Adversary Controlled Applications Act",
    "summary": "This executive order extends the enforcement delay for TikTok described in section 2(a) of Executive Order 14166 (January 20, 2025), issued under the Protecting Americans from Foreign Adversary Controlled Applications Act.",
    "link": "https://www.whitehouse.gov/presidential-actions/2025/09/further-extending-the-tiktok-enforcement-delay-9dde/"
  },
  {
    "title": "Nominations Sent to the Senate for United States Attorneys for the Eastern District of North Carolina, the District of New Hampshire, and a Louisiana district",
    "summary": "The White House posted a notice indicating that nominations have been sent to the United States Senate for four-year terms as United States Attorneys. The nominees include William Boyle, of North Carolina, to serve as United States Attorney for the Eastern District of North Carolina; Erin Creegan, of New Hampshire, to serve as United States Attorney for the District of New Hampshire; and Zachary Keller, of Louisiana, to serve as United States Attorney for a district in Louisiana. The post is part of a regular reporting of nominations sent to the Senate.",
    "link": "https://www.whitehouse.gov/presidential-actions/2025/09/nominations-sent-to-the-senate-5188/"
  }
]