[
  {
    "title": "Executive Action Designating Antifa as a Domestic Terrorist Organization",
    "summary": "Presidential action designating Antifa as a domestic terrorist organization under Section 1, describing the group as seeking to overthrow the United States government and law enforcement, and alleging that it uses illegal methods to organize and carry out a nationwide campaign of violence and terrorism, with coordinated activities as part of that campaign.",
    "link": "https://www.whitehouse.gov/presidential-actions/2025/09/designating-antifa-as-a-domestic-terrorist-organization/"
  },
  {
    "title": "Proclamation on National Hispanic Heritage Month, 2025",
    "summary": "A proclamation issued by the President designates National Hispanic Heritage Month for 2025 and acknowledges the contributions of Hispanic-American citizens across history and in contemporary society. The proclamation highlights the resilience, spirit, and commitment to American values of Hispanic-American communities and notes the participation of Hispanic-Americans in the military and other forms of national service.",
    "link": "https://www.whitehouse.gov/presidential-actions/2025/09/national-hispanic-heritage-month-2025/"
  },
  {
    "title": "Proclamation for Constitution Week, 2025",
    "summary": "This presidential proclamation designates Constitution Week 2025 to commemorate the signing of the United States Constitution, marking the 238th anniversary of that event. It describes the Constitution as the foundational charter of the United States and expresses a commitment to renewing interest in the document's principles of self-government, the rule of law, and civic responsibility. The proclamation emphasizes education about constitutional rights and duties and invites the public to recognize, reflect on, and uphold the principles embodied in the Constitution during Constitution Week.",
    "link": "https://www.whitehouse.gov/presidential-actions/2025/09/constitution-week-2025/"
  },
  {
    "title": "Memorandum of Understanding on Technology Prosperity Cooperation Between the United States and the United Kingdom",
    "summary": "A bilateral, non-binding memorandum establishing a framework for cooperation between the Government of the United States of America and the Government of the United Kingdom of Great Britain and Northern Ireland to advance science and technology capabilities and standards. The document notes mutual interest in coordinating efforts to promote innovation and economic prosperity and outlines general objectives and mechanisms for ongoing bilateral collaboration in technology-related activities.",
    "link": "https://www.whitehouse.gov/presidential-actions/2025/09/memorandum-of-understanding-between-the-government-of-the-united-states-of-america-and-the-government-of-the-united-kingdom-of-great-britain-and-northern-ireland-regarding-the-technology-prosperity-de/"
  },
  {
    "title": "Establishment of an Emergency Board to Investigate Disputes Between the Long Island Rail Road Company and Certain of Its Employees Represented by Labor Organizations",
    "summary": "The President established an Emergency Board under the Railway Labor Act to examine ongoing labor disputes between the Long Island Rail Road Company and certain of its employees who are represented by specified labor organizations, including the Transportation Communications Union, the Brotherhood of Locomotive Engineers and Trainmen, the Brotherhood of Railroad Signalmen, the International Association of Machinists and Aerospace Workers, and the International Brotherhood of Electrical Workers. The Board is charged with inquiring into the issues in the dispute and reporting its findings and recommendations to the parties involved and to the President to assist in resolving the disagreements.",
    "link": "https://www.whitehouse.gov/presidential-actions/2025/09/establishing-an-emergency-board-to-investigate-disputes-between-the-long-island-rail-road-company-and-certain-of-its-employees-represented-by-certain-labor-organizations/"
  },
  {
    "title": "Executive Order Extending the TikTok Enforcement Delay Under the Protecting Americans from Foreign Adversary Controlled Applications Act",
    "summary": "The President issues an executive order to extend the enforcement delay for TikTok that was established in Executive Order 14166. The extension is issued pursuant to the President's constitutional and statutory authority and references the Protecting Americans from Foreign Adversary Controlled Applications Act. The order maintains the scope of the existing enforcement delay and provides the terms for the extension, applicable to TikTok, and directs relevant agencies to implement the extension consistent with applicable law.",
    "link": "https://www.whitehouse.gov/presidential-actions/2025/09/further-extending-the-tiktok-enforcement-delay-9dde/"
  },
  {
    "title": "Nominations Sent to the Senate for United States Attorney Positions in North Carolina, New Hampshire, and Louisiana",
    "summary": "The White House announced that nominations have been sent to the Senate for the appointment of United States Attorneys: William Boyle, of North Carolina, to serve as United States Attorney for the Eastern District of North Carolina for a four-year term; Erin Creegan, of New Hampshire, to serve as United States Attorney for the District of New Hampshire for a four-year term; and Zachary Keller, of Louisiana, to serve as United States Attorney for a district in Louisiana for a four-year term. The post indicates these nominations have been submitted to the Senate for consideration.",
    "link": "https://www.whitehouse.gov/presidential-actions/2025/09/nominations-sent-to-the-senate-5188/"
  }
]