[
  {
    "title": "To Implement the United States–Israel Agreement on Trade in Agricultural Products and for Other Purposes",
    "summary": "This presidential action implements the United States–Israel Free Trade Area Agreement (USIFTA), originally concluded on April 22, 1985, between the Government of the United States and the Government of Israel. Congress approved the agreement in section 3 of the United States–Israel Free Trade Area Implementation Act. The action concerns provisions related to trade in agricultural products as specified in the agreement and includes related provisions for other purposes.",
    "link": "https://www.whitehouse.gov/presidential-actions/2025/12/to-implement-the-united-states-israel-agreenent-on-trade-in-agricultural-products-and-for-other-purposes/"
  },
  {
    "title": "National Security Presidential Memorandum Directing Interagency Coordination to Strengthen U.S. Leadership in 6G Technology",
    "summary": "Establishes interagency coordination to advance the United States' leadership in sixth-generation (6G) wireless technology by outlining goals, responsibilities, and actions across federal agencies, including research and development, security, supply chain resilience, and international engagement; directs implementation and reporting to ensure timely progress.",
    "link": "https://www.whitehouse.gov/presidential-actions/2025/12/national-security-presidential-memorandum-nspm-8-0bda/"
  },
  {
    "title": "Presidential Proclamation: Bill of Rights Day, 2025",
    "summary": "The President issues a proclamation designating December 15, 2025 as Bill of Rights Day. The proclamation acknowledges the historical adoption of the first ten amendments to the United States Constitution and recognizes their role in protecting civil liberties and limiting government power. It outlines the enduring responsibility of the government and the people to uphold the rights protected by the Bill of Rights, including fundamental liberties, due process, and equal protection. The document invites educators, community leaders, and citizens to observe the day through education, reflection, and activities that promote understanding of constitutional rights and the duties associated with them. It emphasizes continued commitment to safeguarding civil liberties and joining in civic participation to defend democratic principles.",
    "link": "https://www.whitehouse.gov/presidential-actions/2025/12/bill-of-rights-day-2025/"
  },
  {
    "title": "Executive Order Designating Illicit Fentanyl as a Weapon of Mass Destruction",
    "summary": "An executive action issued by the President under the Constitution and the laws of the United States that designates illicit fentanyl as a weapon of mass destruction for purposes of national security authorities. The order states that illicit fentanyl is closer to a chemical weapon than a traditional narcotic and notes that very small quantities—such as two milligrams—constitute a trace amount. It establishes the purpose and policy in Section 1 and outlines the intended actions for federal agencies to address the production, distribution, and use of illicit fentanyl through the WMD designation, providing a legal basis for enhanced regulatory and enforcement measures.",
    "link": "https://www.whitehouse.gov/presidential-actions/2025/12/designating-fentanyl-as-a-weapon-of-mass-destruction/"
  },
  {
    "title": "Executive Order Protecting American Investors from Foreign-Owned and Politically Motivated Proxy Advisors",
    "summary": "This executive order directs federal agencies to assess potential risks arising from proxy advisory firms that are foreign-owned and may be subject to political influences. The order cites examples such as Institutional Shareholder Services Inc. and Glass, Lewis & Co., LLC, and tasks relevant agencies to evaluate how ownership, governance, and operations of proxy advisory services could affect investor protections and market integrity. Agencies are instructed to report findings and consider appropriate measures, including policy recommendations, regulatory adjustments, or guidance aimed at increasing transparency, strengthening oversight, and mitigating risks associated with proxy advisors' influence on corporate governance and investment decisions.",
    "link": "https://www.whitehouse.gov/presidential-actions/2025/12/protecting-american-investors-from-foreign-owned-and-politically-motivated-proxy-advisors/"
  }
]