[
  {
    "title": "Nomination Sent to the Senate for William J. Crain as U.S. District Judge for the Eastern District of Louisiana; Alexander C. Van Hook as U.S. District Judge for the Western District of Louisiana; and Brian Barber as United States Marshal",
    "summary": "The White House announced that nominations have been sent to the Senate for three federal positions in Louisiana: William J. Crain, of Louisiana, to be United States District Judge for the Eastern District of Louisiana, to fill the vacancy created by retirement of Eldon E. Fallon; Alexander C. Van Hook, of Louisiana, to be United States District Judge for the Western District of Louisiana, to fill the vacancy created by retirement of Elizabeth Erny Foote; and Brian Barber, of Louisiana, to be United States Marshal (district not specified in excerpt).",
    "link": "https://www.whitehouse.gov/presidential-actions/2025/10/nomination-sent-to-the-senate-f090/"
  },
  {
    "title": "Proclamation: National Energy Dominance Month, 2025",
    "summary": "The proclamation designates October 2025 as National Energy Dominance Month. It emphasizes the United States' historical reliance on domestic energy resources such as oil, coal, minerals, and natural gas, and describes the geographic scope of energy resources from the Appalachian Mountains to the Mississippi River, the Great Plains, and beyond. The document invites federal, state, and local governments, as well as the public and industry, to observe the month and to recognize the role of domestic energy resources in the nation's energy landscape.",
    "link": "https://www.whitehouse.gov/presidential-actions/2025/10/national-energy-dominance-month-2025/"
  },
  {
    "title": "Proclamation: National Cybersecurity Awareness Month, 2025",
    "summary": "The President issues a proclamation designating October 2025 as National Cybersecurity Awareness Month and renews the administration's commitment to strengthening the Nation's cybersecurity with the objectives of improving American lives, defending national sovereignty, and upholding the rights of every American citizen. The proclamation notes that advancements in cybersecurity have created evolving threats to national defense and signals ongoing efforts to address these challenges and promote cybersecurity awareness across sectors.",
    "link": "https://www.whitehouse.gov/presidential-actions/2025/10/national-cybersecurity-awareness-month-2025/"
  },
  {
    "title": "Proclamation Adjusting Imports of Medium- and Heavy-Duty Vehicles, Vehicle Parts, and Buses Into the United States",
    "summary": "The proclamation states that, based on a report transmitted by the Secretary of Commerce three weeks earlier, an investigation into the effects of imports of medium- and heavy-duty vehicles (MHDVs), their parts (MHDVPs), and buses on national security has been completed. Acting on the findings, the President directs adjustments to the importation of these goods into the United States to address national security concerns identified by the investigation.",
    "link": "https://www.whitehouse.gov/presidential-actions/2025/10/adjusting-imports-of-medium-and-heavy-duty-vehicles-medium-and-heavy-duty-vehicle-parts-and-buses-into-the-united-states/"
  },
  {
    "title": "Use of Available Department of War Funds for Military Pay and Allowances During the Lapse in Annual Appropriations",
    "summary": "A memorandum directed to the Secretary of War and the Director of the Office of Management and Budget instructs that funds currently available to the Department of War may be used to cover the pay and allowances of military personnel during periods when annual appropriations are lapsed. The document notes that the current appropriations lapse includes a lapse affecting pay and allowances provided by Congress and outlines the authority and considerations for using available Department of War funds to maintain payroll and benefits for service members during the funding gap.",
    "link": "https://www.whitehouse.gov/presidential-actions/2025/10/national-security-presidential-memorandum-nspm-8/"
  },
  {
    "title": "Executive Order to Ensure Continued Accountability in Federal Hiring",
    "summary": "This executive action establishes policy to maintain accountability in federal hiring processes. It references a background section describing an eight-month period during which the administration reduced the federal workforce and reported improvements in the efficiency of government service delivery, with an emphasis on prioritizing hiring in national security. The order outlines objectives and mechanisms for ongoing oversight and transparency in federal hiring practices.",
    "link": "https://www.whitehouse.gov/presidential-actions/2025/10/ensuring-continued-accountability-in-federal-hiring/"
  },
  {
    "title": "Presidential Declaration for Enduring Peace and Prosperity",
    "summary": "A presidential action endorsing the commitments of all parties to the Trump Peace Agreement, describing the agreement as ending more than two years of suffering and loss and opening a new chapter for the region characterized by hope, security, and a shared vision for peace and prosperity. The declaration states support for the agreement, outlines expectations for its implementation, and calls for continued cooperation among the involved parties to advance enduring peace and prosperity in the region.",
    "link": "https://www.whitehouse.gov/presidential-actions/2025/10/the-trump-declaration-for-enduring-peace-and-prosperity/"
  }
]