[
  {
    "title": "Executive Order on National Security Concerns Related to Timber and Lumber Imports",
    "summary": "This Executive Order aims to address issues pertaining to the national security implications of imported timber and lumber products. It outlines the administration's policy regarding the wood products industry, which encompasses timber, lumber, and their derivatives. The order invokes the authority granted by the Trade Expansion Act of 1962 and articulates measures intended to protect domestic industries and safeguard national interests in relation to wood products imports.",
    "link": "https://www.whitehouse.gov/presidential-actions/2025/03/addressing-the-threat-to-national-security-from-imports-of-timber-lumber/"
  },
  {
    "title": "Executive Order on the Expansion of Timber Production in the United States",
    "summary": "This Executive Order outlines the importance of timber production to various sectors of the economy, including construction and other essential human activities. It emphasizes the need to enhance the production of timber, lumber, paper, bioenergy, and other wood products to support the nation's well-being. The order aims to establish policies and initiatives that promote the sustainable growth of timber resources and improve the availability of wood products in various markets.",
    "link": "https://www.whitehouse.gov/presidential-actions/2025/03/immediate-expansion-of-american-timber-production/"
  },
  {
    "title": "Establishment of English as the Official Language of the United States",
    "summary": "This executive order asserts the designation of English as the official language of the United States. It underscores the historical context of English usage since the founding of the nation, referencing significant governing documents such as the Declaration of Independence and the Constitution. The order emphasizes the role of a common language in fostering unity and understanding among American citizens.",
    "link": "https://www.whitehouse.gov/presidential-actions/2025/03/designating-english-as-the-official-language-of-the-united-states/"
  },
  {
    "title": "Executive Order on Healthcare Pricing Transparency",
    "summary": "This executive order aims to enhance transparency in healthcare pricing by providing patients with clear, accurate, and actionable information regarding healthcare costs. The order outlines the steps to be taken to ensure that patients can make informed decisions about their healthcare expenditures, contributing to a better understanding of healthcare pricing dynamics in the United States. It seeks to address existing issues in the healthcare system that have historically hindered patients' access to reliable pricing information.",
    "link": "https://www.whitehouse.gov/presidential-actions/2025/02/making-america-healthy-again-by-empowering-patients-with-clear-accurate-and-actionable-healthcare-pricing-information/"
  },
  {
    "title": "Memorandum on Suspension of Security Clearances and Review of Government Contracts",
    "summary": "This memorandum addresses the procedures for the suspension of security clearances for individuals associated with certain government contracts. It outlines the responsibilities of various departments and agencies, including the State Department, Defense Department, and others, in implementing this suspension and conducting a thorough evaluation of existing government contracts. The objective is to ensure compliance with security protocols and assess the implications of current contracts.",
    "link": "https://www.whitehouse.gov/presidential-actions/2025/02/suspension-of-security-clearances-and-evaluation-of-government-contracts/"
  },
  {
    "title": "Executive Order on the National Security Implications of Copper Imports",
    "summary": "This executive order, issued by the President under the authority of the Constitution and relevant laws, outlines the recognition of copper as a critical material essential for national security. It addresses concerns related to the importation of copper and establishes the policy direction to mitigate potential threats arising from reliance on foreign sources of this material. The order emphasizes the significance of maintaining a secure supply chain for copper in light of its importance to various sectors affecting national interest.",
    "link": "https://www.whitehouse.gov/presidential-actions/2025/02/addressing-the-threat-to-nationalsecurity-from-imports-of-copper/"
  },
  {
    "title": "Major Disaster Declaration for Kentucky Following Severe Storms and Flooding",
    "summary": "The President has issued a Major Disaster Declaration for the Commonwealth of Kentucky in response to severe storms and flooding that have occurred. This declaration enables the availability of federal funding for individuals and businesses in the affected areas. The assistance may include financial grants for temporary housing and other recovery programs to support those impacted by the disaster.",
    "link": "https://www.whitehouse.gov/presidential-actions/2025/02/president-trump-takes-decisive-action-to-deliver-relief-to-kentucky/"
  }
]