[
  {
    "title": "National Security Presidential Memorandum on Advancing United States Leadership in 6G Technology",
    "summary": "This memorandum directs multiple federal departments and agencies to coordinate a national strategy for 6G technology development and deployment. It tasks agencies to accelerate research funding and applied development, advance secure and resilient telecommunications infrastructure, evaluate and mitigate supply chain risks, promote international standards and collaboration, and align regulatory and spectrum policies. The directive requires interagency action plans, periodic progress reports, and mechanisms for coordination among government, industry, and academia to maintain United States competitiveness and national security in the emergence of 6G technology.",
    "link": "https://www.whitehouse.gov/presidential-actions/2025/12/national-security-presidential-memorandum-nspm-8-0bda/"
  },
  {
    "title": "Proclamation on Bill of Rights Day, 2025",
    "summary": "The President proclaims December 15, 2025 as Bill of Rights Day to commemorate the ratification of the Bill of Rights, the first ten amendments to the United States Constitution. The proclamation highlights the historical progression from the nation's founding to the present, emphasizing the enduring principles of liberty, sovereignty, justice, and self-determination. It invites Americans to observe the day by reflecting on the rights guaranteed by the Bill of Rights, recognizing the role of the Constitution in protecting individual rights, and noting the responsibilities of government and citizens to uphold the rule of law.",
    "link": "https://www.whitehouse.gov/presidential-actions/2025/12/bill-of-rights-day-2025/"
  },
  {
    "title": "Executive Order Designating Fentanyl as a Weapon of Mass Destruction",
    "summary": "This presidential executive order designates illicit fentanyl as a weapon of mass destruction under applicable United States law. The order articulates a policy recognizing illicit fentanyl as closer to a chemical weapon than a narcotic and references a two-milligram threshold described as an almost undetectable trace amount. It outlines the authority and directives associated with the designation and its intended role in enforcement and policy responses.",
    "link": "https://www.whitehouse.gov/presidential-actions/2025/12/designating-fentanyl-as-a-weapon-of-mass-destruction/"
  },
  {
    "title": "Executive Order Addressing Foreign-Owned Proxy Advisory Firms and Their Influence on U.S. Investors",
    "summary": "This executive order asserts the President's authority to address proxy advisory firms and their effects on United States investors. It identifies two foreign-owned firms, Institutional Shareholder Services Inc. and Glass, Lewis & Co., LLC, as entities that can influence governance-related policies and priorities affecting American investors. The document states the goal of mitigating potential risks associated with foreign ownership and perceived political biases in proxy advisory activities. It directs relevant federal agencies to review the operations, disclosure practices, and regulatory implications of proxy advisory services and to consider actions that enhance transparency, oversight, and protections for U.S. investors in relation to such activities. The summary focuses on outlining areas for assessment and potential regulatory measures in a manner consistent with applicable law, without taking a stance on specific policy outcomes.",
    "link": "https://www.whitehouse.gov/presidential-actions/2025/12/protecting-american-investors-from-foreign-owned-and-politically-motivated-proxy-advisors/"
  },
  {
    "title": "Executive Order to Establish a National Policy Framework for Artificial Intelligence and Address State-Law Obstructions",
    "summary": "This executive action asserts authority under the Constitution and United States law to advance national leadership in artificial intelligence with the aim of enhancing national and economic security across multiple domains. It references a prior Executive Order dated January 23 and seeks to establish a comprehensive national policy framework for artificial intelligence, directing coordination among federal agencies to develop and implement the framework. A stated objective is to identify and address potential impediments arising from state laws that could obstruct the national AI policy, thereby promoting a cohesive federal approach to AI development, deployment, and governance.",
    "link": "https://www.whitehouse.gov/presidential-actions/2025/12/eliminating-state-law-obstruction-of-national-artificial-intelligence-policy/"
  }
]