[
  {
    "title": "Executive Order on Educational Access and COVID-19 Vaccination Policies",
    "summary": "This executive order addresses the policies related to COVID-19 vaccinations in educational institutions, specifically targeting mandates implemented by certain school districts and universities that require students to receive the vaccine as a condition for participation in educational programs. The order aims to ensure that education remains accessible to all students irrespective of their vaccination status, and outlines guidelines to prevent coercive practices within educational settings. The objective is to protect the rights of students and families in relation to COVID-19 vaccination requirements.",
    "link": "https://www.whitehouse.gov/presidential-actions/2025/02/keeping-education-accessible-and-ending-covid-19-vaccine-mandates-in-schools/"
  },
  {
    "title": "Establishment of the Presidential Commission on Health Improvement",
    "summary": "This Executive Order establishes the Presidential Commission on Health Improvement, aimed at addressing the notably lower life expectancy in the United States compared to other developed nations. The order notes that, prior to the COVID-19 pandemic, the average life expectancy in the U.S. was approximately 78.8 years, while similar countries had an average of 82.6 years. The Commission's primary objective is to identify strategies and initiatives to enhance the overall health and longevity of American citizens.",
    "link": "https://www.whitehouse.gov/presidential-actions/2025/02/establishing-the-presidents-make-america-healthy-again-commission/"
  },
  {
    "title": "Presidential Executive Order on Coordinating U.S. Foreign Relations",
    "summary": "This executive order outlines the President's responsibility to direct foreign policy in accordance with Article II of the U.S. Constitution. It establishes the framework for the coordination of foreign relations, emphasizing the role of the President and designated officials in promoting a unified approach to international issues. The order aims to enhance the effectiveness of U.S. diplomatic efforts and outlines guidelines for communication and collaboration among relevant government officials.",
    "link": "https://www.whitehouse.gov/presidential-actions/2025/02/one-voice-for-americas-foreign-relations/"
  },
  {
    "title": "Initiative for Improving Government Efficiency and Workforce Optimization",
    "summary": "This executive order aims to enhance accountability within the Federal government through a transformation of the existing bureaucracy. The initiative focuses on identifying and eliminating inefficiencies including waste and organizational bloat. By streamlining operations, the order seeks to promote a more effective and responsive government workforce to better serve the American public. The measures outlined are intended to foster a culture of efficiency and transparency within federal agencies.",
    "link": "https://www.whitehouse.gov/presidential-actions/2025/02/implementing-the-presidents-department-of-government-efficiency-workforce-optimization-initiative/"
  }
]