[
  {
    "title": "Executive Order on Addressing Previous Immigration Policies",
    "summary": "This executive order outlines the President's authority to revise immigration policies in response to perceived shortcomings of prior administration practices. It emphasizes the goal of creating an immigration policy that mitigates suffering and aligns with national values. The document sets forth a direction for addressing these issues in a comprehensive manner, aiming to uphold the principles of humanitarian concern and legal governance.",
    "link": "https://www.whitehouse.gov/presidential-actions/2025/03/honoring-jocelyn-nungaray/"
  },
  {
    "title": "Adjustment of Duties to Manage Border Conditions",
    "summary": "This executive order is issued under the authority of the President as provided by the Constitution and various legislative acts, including the International Emergency Economic Powers Act and the National Emergencies Act. It outlines amendments to current duties aimed at addressing specific issues relating to the southern border. The order is intended to adjust existing measures to better respond to the identified conditions and needs at the border, facilitating management and coordination of resources in line with legal statutes.",
    "link": "https://www.whitehouse.gov/presidential-actions/2025/03/amendment-to-duties-to-address-the-situation-at-our-southern-border/"
  },
  {
    "title": "Amendment to Customs Duties to Address Illicit Drug Trafficking at the Northern Border",
    "summary": "This executive order is issued under the powers granted to the President by the Constitution and various acts of Congress, including the International Emergency Economic Powers Act and the National Emergencies Act. It aims to implement changes in customs duties to enhance efforts in controlling the flow of illicit drugs across the northern border of the United States. The order outlines the legal framework supporting these adjustments and emphasizes the importance of addressing the challenges posed by drug trafficking.",
    "link": "https://www.whitehouse.gov/presidential-actions/2025/03/amendment-to-duties-to-address-the-flow-of-illicit-drugs-across-our-northern-border/"
  },
  {
    "title": "Initiation of Federal Spending Transparency and Accountability Measures",
    "summary": "This executive order establishes a program aimed at transforming federal spending practices related to contracts, grants, and loans. The primary focus is to enhance transparency in government spending and to hold government employees accountable to the public. Through these measures, the order seeks to improve the efficiency and effectiveness of federal financial management.",
    "link": "https://www.whitehouse.gov/presidential-actions/2025/02/implementing-the-presidents-department-of-government-efficiency-cost-efficiency-initiative/"
  }
]