[
  {
    "title": "Proclamation for National Donate Life Month, 2025",
    "summary": "This proclamation by the President of the United States recognizes April 2025 as National Donate Life Month. It acknowledges the importance of organ donations and expresses gratitude towards the more than 170 million individuals in the United States who have chosen to become organ donors. The proclamation highlights the role of organ donation in demonstrating compassion and the vital impact it has on individuals in need of transplants.",
    "link": "https://www.whitehouse.gov/presidential-actions/2025/04/national-donate-life-month-2025/"
  },
  {
    "title": "Proclamation for National Child Abuse Prevention Month, 2025",
    "summary": "This proclamation by the President of the United States designates the month of April 2025 as National Child Abuse Prevention Month. It emphasizes the importance of protecting children, viewing them as vital members of families and society. The proclamation calls for a commitment to empowering children across the nation, promoting their well-being and safety, and fostering environments in which they can thrive. It serves as an acknowledgment of the need for collective effort to prevent child abuse and support healthy family dynamics.",
    "link": "https://www.whitehouse.gov/presidential-actions/2025/04/national-child-abuse-prevention-month-2025/"
  },
  {
    "title": "Proclamation for Cancer Control Month, 2025",
    "summary": "This proclamation issued by the President of the United States recognizes Cancer Control Month in April 2025. It acknowledges the resilience of individuals diagnosed with cancer and celebrates the achievements of more than 18 million cancer survivors in the U.S. The proclamation also honors the memories of those who have passed away due to cancer. The initiative aims to raise awareness about cancer prevention, treatment, and support for individuals and families affected by the disease.",
    "link": "https://www.whitehouse.gov/presidential-actions/2025/04/cancer-control-month-2025/"
  },
  {
    "title": "Proclamation on National Sexual Assault Awareness and Prevention Month, 2025",
    "summary": "This proclamation by the President of the United States designates April 2025 as National Sexual Assault Awareness and Prevention Month. It emphasizes the importance of raising awareness about sexual violence and promoting prevention efforts. In the proclamation, the President addresses concerns related to immigration policies and their relationship to sexual violence, highlighting the need for comprehensive approaches to these issues. Various initiatives and resources for education and prevention may be outlined as part of this recognition.",
    "link": "https://www.whitehouse.gov/presidential-actions/2025/04/national-sexual-assault-awareness-and-prevention-month-2025/"
  },
  {
    "title": "Nominations for Various Assistant Secretary Positions and Chief Financial Officer to be Reviewed by the Senate",
    "summary": "This document outlines the nominations submitted for Senate consideration, including Marc Andersen for Assistant Secretary of the Army, Gregory Autry for Chief Financial Officer of the National Aeronautics and Space Administration, and Donald Bergin III for Assistant Secretary of Veterans Affairs responsible for Congressional and Legislative Affairs. The nominations reflect appointments to key positions within the federal government requiring Senate approval.",
    "link": "https://www.whitehouse.gov/presidential-actions/2025/04/nominations-sent-to-the-senate-8f2a/"
  }
]