[
  {
    "title": "Executive Order to Continue Reducing Federal Bureaucracy",
    "summary": "This executive order outlines the ongoing efforts to reduce the size and scope of the Federal bureaucracy, as determined necessary by the President. It serves to streamline government operations by eliminating unnecessary elements, thereby aiming to enhance efficiency within federal agencies. The specific measures and exceptions to this reduction are anticipated to be detailed in subsequent sections of the order.",
    "link": "https://www.whitehouse.gov/presidential-actions/2025/03/continuing-the-reduction-of-the-federal-bureaucracy/"
  },
  {
    "title": "Executive Order Addressing Risks Associated with Global Law Firms",
    "summary": "This executive order outlines concerns regarding the influence of global law firms on the American judicial process and their involvement in practices seen as harmful to foundational legal principles in the United States. It establishes a framework for assessing and addressing the potential risks and impacts posed by these firms on the integrity of the judicial system.",
    "link": "https://www.whitehouse.gov/presidential-actions/2025/03/addressing-risks-from-paul-weiss/"
  },
  {
    "title": "Additional Rescissions of Executive Orders and Actions",
    "summary": "This Executive Order outlines the rescission of further Presidential executive orders and memoranda. It builds upon the earlier rescissions made in Executive Order 14148 issued on January 20, 2025, which annulled 78 orders and memoranda from the previous administration. The purpose of this action is to streamline executive directives and remove those identified as harmful.",
    "link": "https://www.whitehouse.gov/presidential-actions/2025/03/additional-recissions-of-harmful-executive-orders-and-actions/"
  },
  {
    "title": "Proclamation to Observe U.S. Hostage and Wrongful Detainee Day, 2025",
    "summary": "This proclamation by the President of the United States designates a specific day to recognize and honor American citizens who are held in captivity or wrongfully detained. It expresses support for these individuals and their families, emphasizing a commitment to not forget or abandon those affected by such circumstances. The proclamation aims to raise awareness of the issues related to hostages and wrongful detainees and underscores the nation's dedication to securing their release.",
    "link": "https://www.whitehouse.gov/presidential-actions/2025/03/u-s-hostage-and-wrongful-detainee-day-2025/"
  },
  {
    "title": "Establishment of the Strategic Bitcoin Reserve and United States Digital Asset Stockpile",
    "summary": "This executive order outlines the establishment of a Strategic Bitcoin Reserve, which involves the creation of a digital asset stockpile to hold a specific quantity of Bitcoin. The order notes that Bitcoin is the first cryptocurrency and highlights its intrinsic attributes, such as the capped supply of 21 million coins and its security features. The initiative aims to enhance the United States' position in the digital asset landscape and reflects a commitment to managing digital currencies as they become more integral to the economy.",
    "link": "https://www.whitehouse.gov/presidential-actions/2025/03/establishment-of-the-strategic-bitcoin-reserve-and-united-states-digital-asset-stockpile/"
  }
]