[
  {
    "title": "Initiation of Federal Spending Transparency and Accountability Initiative",
    "summary": "This executive order establishes an initiative aimed at transforming Federal spending practices related to contracts, grants, and loans. Its primary objective is to enhance transparency in government expenditures and to ensure that federal employees are accountable for their spending decisions. The order sets out to implement reforms that will facilitate better oversight and management of federal financial resources.",
    "link": "https://www.whitehouse.gov/presidential-actions/2025/02/implementing-the-presidents-department-of-government-efficiency-cost-efficiency-initiative/"
  },
  {
    "title": "Investment Policy Directive Focusing on U.S. Interests",
    "summary": "This memorandum outlines the directive for federal departments and agencies to prioritize investments that align with the strategic interests of the United States. It emphasizes the need for coordinated efforts across various sectors to ensure that financial and resource allocations support national objectives. The policy aims to provide a framework for evaluating and implementing investments that enhance economic growth and security while maintaining adherence to legal and regulatory standards.",
    "link": "https://www.whitehouse.gov/presidential-actions/2025/02/america-first-investment-policy/"
  },
  {
    "title": "Memorandum on Measures to Protect American Companies and Innovators from Foreign Extortion and Unfair Fines",
    "summary": "This memorandum addresses the need to implement strategies that defend American companies and innovators against extortion and unjust financial penalties imposed by foreign entities. It outlines the objectives and responsibilities of key government officials, including the Secretary of the Treasury, Secretary of Commerce, and the United States Trade Representative, in identifying and mitigating these challenges. The proposal aims to enhance the protection of American businesses operating internationally and ensure fair treatment in global trade practices.",
    "link": "https://www.whitehouse.gov/presidential-actions/2025/02/defending-american-companies-and-innovators-from-overseas-extortion-and-unfair-fines-and-penalties/"
  },
  {
    "title": "Initiation of Federal Bureaucracy Reduction",
    "summary": "This executive order outlines the administration's policy to significantly decrease the scale of the Federal Government while enhancing its accountability to the citizens of the United States. It establishes a framework for implementing measures aimed at streamlining operations and improving efficiency within federal agencies. The order emphasizes the importance of reorganizing governmental structures to better serve the public interest and outlines steps to achieve these objectives.",
    "link": "https://www.whitehouse.gov/presidential-actions/2025/02/commencing-the-reduction-of-the-federal-bureaucracy/"
  },
  {
    "title": "Establishment of Regulatory Focus and Efficiency in Government Enforcement",
    "summary": "This executive order outlines the policy of the administration to prioritize the enforcement of federal regulations that are explicitly authorized by constitutional statutes. It aims to allocate the limited enforcement resources of the executive branch effectively, ensuring compliance with lawful governance. The initiative is part of a broader strategy to enhance government efficiency by streamlining regulatory processes and concentrating efforts on regulations that directly align with legal foundations.",
    "link": "https://www.whitehouse.gov/presidential-actions/2025/02/ensuring-lawful-governance-and-implementing-the-presidents-department-of-government-efficiency-regulatory-initiative/"
  },
  {
    "title": "Proclamation Commemorating the 80th Anniversary of the Battle of Iwo Jima",
    "summary": "This proclamation by the President of the United States recognizes the 80th anniversary of the Battle of Iwo Jima, which began on February 19, 1945. The battle was a significant military engagement during World War II, marking a crucial campaign that involved intense combat over a period of 36 days. The proclamation serves to honor the sacrifices made by those who fought in this battle and acknowledges its importance in the broader context of the war.",
    "link": "https://www.whitehouse.gov/presidential-actions/2025/02/80th-anniversary-of-the-battle-of-iwo-jima/"
  }
]