[
  {
    "title": "Presidential Notification of a United States Military Strike on Iranian Nuclear Facilities",
    "summary": "The president issued a formal letter to the Speaker of the House of Representatives and the President Pro Tempore of the Senate, informing them that on June 21, 2025, directed United States forces to conduct a precision missile strike targeting three nuclear facilities in Iran associated with the nation's nuclear weapons development program. The action was undertaken to serve national interests and strategic objectives.",
    "link": "https://www.whitehouse.gov/presidential-actions/2025/06/text-of-a-letter-from-the-president-to-the-speaker-of-the-house-of-representatives/"
  },
  {
    "title": "Order Extending Enforcement Delay Regarding TikTok Under the Protecting Americans from Foreign Adversary Controlled Applications Act",
    "summary": "This order, issued by the President, formally extends the enforcement delay related to the application of the Protecting Americans from Foreign Adversary Controlled Applications Act to the TikTok platform as previously specified in Executive Order 14166, and details the continuation of the enforcement suspension period.",
    "link": "https://www.whitehouse.gov/presidential-actions/2025/06/further-extending-the-tiktok-enforcement-delay/"
  },
  {
    "title": "Proclamation Marking the 250th Anniversary of the Battle of Bunker Hill",
    "summary": "The proclamation commemorates the 250th anniversary of the Battle of Bunker Hill, highlighting the historical significance of the event where American patriots demonstrated bravery and resilience against a major military power during the American Revolutionary War.",
    "link": "https://www.whitehouse.gov/presidential-actions/2025/06/250th-anniversary-of-the-battle-of-bunker-hill/"
  },
  {
    "title": "Nominations Sent to the Senate for Appointments in the Department of State and Department of Veterans Affairs",
    "summary": "The President has submitted nominations to the Senate for the following positions: Riley Barnes from Texas as Assistant Secretary of State for Democracy, Human Rights, and Labor; Alan Boehme from California as Assistant Secretary of Veterans Affairs for Information and Technology; Karen Brazell from Maryland as Under Secretary for Benefits of the Department of Veterans Affairs; and Jeremy Carl from Montana for a specified position within the federal government.",
    "link": "https://www.whitehouse.gov/presidential-actions/2025/06/nominations-sent-to-the-senate-3c08/"
  },
  {
    "title": "Proclamation Recognizing Father's Day 2025 and Honoring the Role of Fathers",
    "summary": "The President issues a proclamation for Father's Day 2025, acknowledging the contributions of fathers as leaders and protectors within families and society. The proclamation highlights the importance of fathers' love, devotion, and example in shaping subsequent generations and expresses gratitude for their role in fostering strength and security.",
    "link": "https://www.whitehouse.gov/presidential-actions/2025/06/fathers-day-2025/"
  },
  {
    "title": "Proclamation Recognizing Flag Day and National Flag Week 2025",
    "summary": "This proclamation commemorates Flag Day and National Flag Week in 2025, marking the anniversary of the adoption of the American flag by the Second Continental Congress on June 14, 1777. It highlights the historical significance of the flag and encourages appropriate observance of the week dedicated to honoring the flag of the United States.",
    "link": "https://www.whitehouse.gov/presidential-actions/2025/06/flag-day-and-national-flag-week-2025/"
  },
  {
    "title": "Order Initiating Review of Proposed Acquisition of U.S. Steel Corporation by Nippon Steel Corporation",
    "summary": "This executive order, issued by the President, invokes authority under the Defense Production Act of 1950 to initiate a review process of the proposed acquisition of the United States Steel Corporation by Nippon Steel Corporation. The order directs the Committee on Foreign Investment in the United States to evaluate the national security implications of the proposed transaction, following procedures established in law.",
    "link": "https://www.whitehouse.gov/presidential-actions/2025/06/regarding-the-proposed-acquisition-of-the-united-states-steel-corporation-by-nippon-steel-corporation/"
  },
  {
    "title": "250th Anniversary of the Establishment of the United States Army",
    "summary": "This proclamation commemorates the 250th anniversary of the founding of the United States Army, which was established on June 14, 1775, by the Second Continental Congress. It recognizes the Army's contributions to the nation's history, including its roles in service, valor, and discipline over the 250-year period since its inception.",
    "link": "https://www.whitehouse.gov/presidential-actions/2025/06/250th-anniversary-of-the-founding-of-the-united-states-army/"
  }
]