[
  {
    "title": "Proclamation on Leif Erikson Day, 2025",
    "summary": "This Presidential Proclamation designates Leif Erikson Day for 2025. It acknowledges Leif Erikson as an early Norse explorer who is described as the first known European to reach North America after his voyage. The proclamation outlines the historical significance of the exploration and invites appropriate observances, education, and reflection on the contributions of Nordic American communities and the enduring spirit of exploration.",
    "link": "https://www.whitehouse.gov/presidential-actions/2025/10/leif-erikson-day-2025/"
  },
  {
    "title": "Proclamation: Columbus Day, 2025",
    "summary": "A presidential proclamation designating October 12, 2025, as Columbus Day and recognizing Christopher Columbus within the context of American history. The document reflects on the historical significance of the day and invites national observance and appropriate recognition by government institutions and citizens.",
    "link": "https://www.whitehouse.gov/presidential-actions/2025/10/columbus-day-2025/"
  },
  {
    "title": "Presidential Memorandum Directing the Construction of Arctic Security Cutters",
    "summary": "A presidential memorandum issued to the Secretary of Homeland Security, the Director of the Office of Management and Budget, the Assistant to the President for National Security Affairs, and the Assistant to the President and Homeland Security Advisor. The memorandum asserts the President's authority under the Constitution and applicable laws to direct the construction of Arctic security cutters and directs federal agencies to coordinate on planning, budgeting, procurement, and scheduling to develop these cutters for Arctic security missions.",
    "link": "https://www.whitehouse.gov/presidential-actions/2025/10/construction-of-arctic-security-cutters/"
  },
  {
    "title": "Proclamation: Fire Prevention Week, 2025",
    "summary": "This presidential proclamation designates Fire Prevention Week in 2025, urges individuals, households, and communities to implement fire safety measures to reduce risks and enhance safety, and acknowledges the courage and dedication of firefighters and first responders nationwide for protecting lives and property.",
    "link": "https://www.whitehouse.gov/presidential-actions/2025/10/fire-prevention-week-2025/"
  },
  {
    "title": "Proclamation by the President of the United States: National Manufacturing Day, 2025",
    "summary": "The proclamation designates National Manufacturing Day, 2025 and notes that manufacturing has long been a foundational element of the United States' prosperity, community strength, independence, and economic vitality. It traces the evolution of manufacturing from early mills and forges that supported the young republic to contemporary, innovative industries, and emphasizes the ongoing importance of the sector to national competitiveness and overall well-being. The document outlines a recognition of manufacturing's contributions and signals the government's continued support for the sector.",
    "link": "https://www.whitehouse.gov/presidential-actions/2025/10/national-manufacturing-day-2025/"
  }
]