[
  {
    "title": "Clarification of Exceptions Under Executive Order 14257",
    "summary": "This memorandum provides a clarification regarding specific exceptions outlined in Executive Order 14257, originally issued on April 2, 2025, which has subsequently been amended. The memorandum addresses various Department heads and senior officials involved in economic policy, trade, and national security, underscoring the importance of precise interpretation and implementation of the specified exceptions in the context of U.S. policy and regulation.",
    "link": "https://www.whitehouse.gov/presidential-actions/2025/04/clarification-of-exceptions-under-executive-order-14257-of-april-2-2025-as-amended/"
  },
  {
    "title": "Adjustment of Tariff Rates in Response to Trade Partner Actions",
    "summary": "This executive order outlines the President's authority to modify tariff rates in reaction to retaliatory measures taken by trading partners. It invokes the International Emergency Economic Powers Act, the National Emergencies Act, and the Trade Act of 1974. The order aims to align U.S. tariff rates with the actions of other countries in international trade, thereby managing and potentially stabilizing trade relations. The adjustments are intended to reflect the current state of international economic interactions as part of a broader strategy to protect U.S. economic interests.",
    "link": "https://www.whitehouse.gov/presidential-actions/2025/04/modifying-reciprocal-tariff-rates-to-reflect-trading-partner-retaliation-and-alignment/"
  },
  {
    "title": "Executive Order on Limiting Access to Sensitive Information for Legal Entities Involved in Detrimental Activities",
    "summary": "This executive order addresses concerns regarding lawyers and law firms that engage in activities considered harmful to national interests. It establishes that such entities should be restricted from accessing sensitive government information and warns against minimizing the financial support they receive from federal sources. The order aims to safeguard the integrity of national security by ensuring that those involved in undermining critical interests do not benefit from national resources.",
    "link": "https://www.whitehouse.gov/presidential-actions/2025/04/addressing-risks-from-susman-godfrey/"
  },
  {
    "title": "Executive Order on Strengthening U.S. Maritime Industry and Workforce",
    "summary": "This executive order outlines objectives to address the declining commercial shipbuilding capacity and maritime workforce in the United States, which has been impacted by long-standing government neglect. The order emphasizes the importance of revitalizing the industrial base necessary for a strong maritime sector and aims to implement measures to restore and enhance the country’s maritime capabilities.",
    "link": "https://www.whitehouse.gov/presidential-actions/2025/04/restoring-americas-maritime-dominance/"
  }
]