[
  {
    "title": "Executive Order Recognizing and Celebrating American Motor Racing",
    "summary": "The executive order, issued by the President under constitutional and statutory authority, establishes the policy and purpose of recognizing the historical significance of American INDYCAR racing within the broader context of U.S. motor sports. It notes a history of more than a century and describes high-speed competition as part of the sport, with the order's Section 1 outlining the purpose and policy.",
    "link": "https://www.whitehouse.gov/presidential-actions/2026/01/celebrating-american-greatness-with-american-motor-racing/"
  },
  {
    "title": "Proclamation Designating National School Choice Week 2026",
    "summary": "The proclamation designates National School Choice Week for 2026 and articulates the principle that the American people have the right to determine their children's education without undue interference from government or political actors. It invites the nation to observe National School Choice Week and expresses support for school-choice options as a means of parental involvement in education.",
    "link": "https://www.whitehouse.gov/presidential-actions/2026/01/national-school-choice-week-2026/"
  },
  {
    "title": "Executive Order to Promote Competition in the Housing Market and Access to Homeownership for Individual Buyers",
    "summary": "This executive order directs federal agencies to examine and implement measures intended to address competition in the housing market, with the objective of improving access to homeownership for individual buyers and reducing the competitive advantage of large institutional investors in acquiring single-family homes. The policy articulated emphasizes the goal of supporting traditional Main Street homebuyers within the housing market.",
    "link": "https://www.whitehouse.gov/presidential-actions/2026/01/stopping-wall-street-from-competing-with-main-street-homebuyers/"
  },
  {
    "title": "Proclamation Declaring National Day of Patriotic Devotion, 2026",
    "summary": "The President issues a proclamation designating a National Day of Patriotic Devotion for 2026. The proclamation references a pledge made in the Capitol a year earlier to reclaim national sovereignty, restore safety, rebalance the scales of justice, and rebuild the nation. It invites observance nationwide through appropriate ceremonies and reflections on national ideals and civic responsibilities associated with patriotic devotion.",
    "link": "https://www.whitehouse.gov/presidential-actions/2026/01/national-day-of-patriotic-devotion-2026/"
  }
]