[
  {
    "title": "Executive Order Adjusting Rates of Pay for Statutory Pay Systems",
    "summary": "This executive order, issued under the President's constitutional and legal authority, establishes adjustments to the rates of basic pay or salaries for statutory pay systems as defined in 5 U.S.C. 5302(1), with adjustments authorized under 5 U.S.C. 5303. Section 1 concerns Statutory Pay Systems and sets the revised rates of basic pay for these systems.",
    "link": "https://www.whitehouse.gov/presidential-actions/2025/12/adjustments-of-certain-rates-of-pay/"
  },
  {
    "title": "Executive Order on Ensuring American Space Superiority",
    "summary": "Issued by the President under the Constitution and laws of the United States, this executive order begins by stating that space superiority is a measure of national vision and will, and that the technologies developed by Americans to achieve it contribute substantially to the Nation's strength, security, and prosperity. It sets forth Section 1 (Purpose) to define the objective of the order and to articulate the importance of space capabilities to national interests.",
    "link": "https://www.whitehouse.gov/presidential-actions/2025/12/ensuring-american-space-superiority/"
  },
  {
    "title": "Executive Order Directing the Closure of Federal Executive Departments and Agencies on December 24, 2025, and December 26, 2025",
    "summary": "This executive order directs that all executive departments and agencies of the Federal Government be closed and their employees excused from duty on Wednesday, December 24, 2025, and Friday, December 26, 2025. It provides that closures apply to all agencies unless a function requires continuity, in which case agency heads shall determine essential personnel and procedures for continuation of critical operations. Agencies are to communicate closure details to employees and make arrangements for ongoing operations where necessary. The order is issued under the President's constitutional and statutory authority to prescribe executive actions and oversee federal government operations.",
    "link": "https://www.whitehouse.gov/presidential-actions/2025/12/providing-for-the-closure-of-executive-departments-and-agencies-of-the-federal-government-on-december-24-2025-and-december-26-2025/"
  },
  {
    "title": "Executive Order to Expand Federal Research on Medical Marijuana and Cannabidiol",
    "summary": "This executive order establishes a federal policy to expand research on medical marijuana and cannabidiol (CBD). It references the Food and Drug Administration's 2023 review and directs federal agencies to coordinate actions to enhance research infrastructure, support clinical studies, and facilitate the development of medical treatments, while ensuring safety, regulatory compliance, and transparent reporting.",
    "link": "https://www.whitehouse.gov/presidential-actions/2025/12/increasing-medical-marijuana-and-cannabidiol-research/"
  },
  {
    "title": "Executive Order 14161: Restricting and Limiting the Entry of Foreign Nationals to Protect the Security of the United States",
    "summary": "This executive order restricts entry of certain foreign nationals into the United States in order to protect national security and public safety. It reinstates restrictions that were in place during the President's first term and were upheld by the Supreme Court. The order directs relevant federal agencies to implement and enforce these entry restrictions, including measures related to screening, visa issuance, and entry control, to prevent threats from foreign travelers from entering the United States.",
    "link": "https://www.whitehouse.gov/presidential-actions/2025/12/restricting-and-limiting-the-entry-of-foreign-nationals-to-protect-the-security-of-the-united-states/"
  }
]