[
  {
    "title": "Executive Order on Consolidation of Federal Procurement Practices",
    "summary": "This executive order addresses the management of Federal procurement processes in the United States. It highlights that the Federal Government allocates approximately $490 billion annually on contracts for common goods and services. The order aims to establish policies that streamline and consolidate these procurement practices in order to reduce waste and increase efficiency, ultimately working towards the goal of saving taxpayer dollars.",
    "link": "https://www.whitehouse.gov/presidential-actions/2025/03/eliminating-waste-and-saving-taxpayer-dollars-by-consolidating-procurement/"
  },
  {
    "title": "Executive Order on Increasing American Mineral Production",
    "summary": "This executive order outlines measures aimed at enhancing the production of minerals in the United States. The order signifies the government's recognition of the importance of domestic mineral resources for job creation, economic growth, and reducing reliance on foreign sources. By leveraging these resources, the administration aims to promote prosperity and strengthen the nation's mineral supply chain.",
    "link": "https://www.whitehouse.gov/presidential-actions/2025/03/immediate-measures-to-increase-american-mineral-production/"
  },
  {
    "title": "Executive Order on Enhancing Educational Outcomes Through Community and Parental Engagement",
    "summary": "This executive order outlines the administration's commitment to improving educational outcomes by empowering parents, teachers, and communities. It emphasizes the importance of collaboration among families, educators, and local organizations to foster an effective learning environment for students. The order highlights strategies aimed at promoting engagement and ensuring access to high-quality educational opportunities as a means of enhancing overall success in education.",
    "link": "https://www.whitehouse.gov/presidential-actions/2025/03/improving-education-outcomes-by-empowering-parents-states-and-communities/"
  }
]