[
  {
    "title": "Proclamation for U.S. Hostage and Wrongful Detainee Day, 2025",
    "summary": "This proclamation by the President of the United States recognizes U.S. Hostage and Wrongful Detainee Day, highlighting support for American citizens held in captivity. It expresses commitment to remember and advocate for those affected and their families.",
    "link": "https://www.whitehouse.gov/presidential-actions/2025/03/u-s-hostage-and-wrongful-detainee-day-2025/"
  },
  {
    "title": "Establishment of the Strategic Bitcoin Reserve and United States Digital Asset Stockpile",
    "summary": "This executive order establishes a Strategic Bitcoin Reserve and a United States Digital Asset Stockpile, which are intended to manage and regulate the use of Bitcoin and other digital assets within the United States. The order outlines the importance of Bitcoin as a cryptocurrency, noting its capped supply of 21 million coins and its security aspects. The initiative aims to create a framework for the federal government's engagement with cryptocurrency, ensuring that assets are used in a strategic and secure manner for financial management and policy. The document provides the basis for further actions regarding the management and future integration of digital assets into the U.S. financial system.",
    "link": "https://www.whitehouse.gov/presidential-actions/2025/03/establishment-of-the-strategic-bitcoin-reserveand-united-states-digital-asset-stockpile/"
  },
  {
    "title": "Modification of Customs Duties to Address Illicit Drug Trafficking Along the Southern Border",
    "summary": "This executive order provides for modifications to certain customs duties in order to enhance efforts to combat the flow of illicit drugs crossing the southern border of the United States. It is issued under the authority of various U.S. laws, including the International Emergency Economic Powers Act and the National Emergencies Act. The order aims to facilitate better enforcement measures and improve responses to drug trafficking challenges.",
    "link": "https://www.whitehouse.gov/presidential-actions/2025/03/amendment-to-duties-to-address-the-flow-of-illicit-drugs-across-our-southern-border/"
  },
  {
    "title": "Executive Order on Addressing Concerns Related to Perkins Coie LLP",
    "summary": "This executive order outlines the concerns regarding the law firm Perkins Coie LLP and their activities in relation to U.S. political processes over several decades. The order emphasizes the potential negative impacts attributed to these activities, particularly during the 2016 election cycle. It asserts the necessity to address the perceived risks associated with the firm’s actions. The document is structured to reflect the authority of the President in addressing these issues within the framework of U.S. law.",
    "link": "https://www.whitehouse.gov/presidential-actions/2025/03/addressing-risks-from-perkins-coie-llp/"
  },
  {
    "title": "Amendment to Customs Duties to Manage the Trafficking of Illegal Drugs at the Northern Border",
    "summary": "This executive order outlines amendments to customs duties aimed at addressing the trafficking of illicit drugs across the northern border of the United States. It is issued under the authority vested in the President by the Constitution and relevant U.S. laws, including the International Emergency Economic Powers Act and the National Emergencies Act. The order establishes measures that are intended to enhance the United States' ability to prevent the flow of illegal substances and improve border security. Specific provisions include adjustments in duty rates and other related regulations to facilitate the enforcement of these measures.",
    "link": "https://www.whitehouse.gov/presidential-actions/2025/03/amendment-to-duties-to-address-the-flow-of-illicit-drugs-across-our-northern-border-0c3c/"
  },
  {
    "title": "Executive Order on Immigration Policy Changes",
    "summary": "This executive order addresses changes to the United States immigration policies previously enacted by the prior administration, highlighting the intent to reform such policies to improve conditions at the southern border and reduce negative impacts on individuals and communities. The order outlines the purpose and policy objectives aimed at addressing immigration challenges and promoting a more equitable and humane approach to immigration management.",
    "link": "https://www.whitehouse.gov/presidential-actions/2025/03/honoring-jocelyn-nungaray/"
  },
  {
    "title": "Amendment to Duties Related to Border Management",
    "summary": "This executive order, issued under the President's constitutional authority and applicable laws, addresses the management of duties and responsibilities associated with the situation at the U.S. southern border. It includes references to existing legal frameworks that empower the President to take such actions. The order aims to amend the current procedures and regulations to better respond to border-related challenges.",
    "link": "https://www.whitehouse.gov/presidential-actions/2025/03/amendment-to-duties-to-address-the-situation-at-our-southern-border/"
  }
]