[
  {
    "title": "Memorandum on Economic Investment Strategy",
    "summary": "This memorandum outlines the framework for an economic investment strategy that prioritizes domestic interests and focuses on enhancing the nation's economic position. It provides guidance to key governmental departments and agencies regarding the implementation of policies aimed at fostering investment in the United States while ensuring that national security and economic resilience are taken into account. The memorandum details collaborative efforts among various sectors to promote sustainable economic growth through an investment approach that aligns with the nation's strategic interests.",
    "link": "https://www.whitehouse.gov/presidential-actions/2025/02/america-first-investment-policy/"
  },
  {
    "title": "Guidance for Protecting U.S. Companies from International Fines and Extortion",
    "summary": "This memorandum addresses the issue of American companies facing extortion and unfair fines imposed by foreign entities. It outlines the United States government's aim to implement measures to safeguard American businesses and innovators from these practices. The memorandum calls for coordinated action among various government departments to develop strategies and policies that protect domestic interests in international trade settings.",
    "link": "https://www.whitehouse.gov/presidential-actions/2025/02/defending-american-companies-and-innovators-from-overseas-extortion-and-unfair-fines-and-penalties/"
  },
  {
    "title": "Initiative to Reduce the Size and Increase the Accountability of the Federal Government",
    "summary": "This executive order establishes the policy of the current Administration aimed at reducing the overall size of the Federal Government while enhancing its accountability to the public. The order outlines specific measures and strategies to streamline operations, improve efficiency, and ensure that government actions are more transparent and responsive to the needs of the American people.",
    "link": "https://www.whitehouse.gov/presidential-actions/2025/02/commencing-the-reduction-of-the-federal-bureaucracy/"
  },
  {
    "title": "Implementation of Regulatory Initiative for Lawful Governance and Government Efficiency",
    "summary": "This Executive Order outlines the administration's policy to prioritize the use of federal enforcement resources on regulations that are clearly authorized by existing federal statutes. The purpose of this order is to ensure that the executive branch focuses its limited enforcement capabilities on lawful governance and efficiency within government operations. The initiative is part of a broader aim to streamline governmental functions and ensure compliance with constitutional guidelines.",
    "link": "https://www.whitehouse.gov/presidential-actions/2025/02/ensuring-lawful-governance-and-implementing-the-presidents-department-of-government-efficiency-regulatory-initiative/"
  },
  {
    "title": "Commemoration of the 80th Anniversary of the Battle of Iwo Jima",
    "summary": "This proclamation marks the 80th anniversary of the Battle of Iwo Jima, which began on February 19, 1945. It acknowledges the significant military operations conducted during this period, highlighting the sacrifices made by United States Marines and the broader context of the Second World War. The proclamation serves to honor the memory of those who participated in this campaign and reflects on its impact on the war's outcome.",
    "link": "https://www.whitehouse.gov/presidential-actions/2025/02/80th-anniversary-of-the-battle-of-iwo-jima/"
  },
  {
    "title": "Presidential Appointments to the Council of Governors",
    "summary": "This announcement details the appointments made by President Donald J. Trump to the Council of Governors, which is a bipartisan group composed of state leaders. The Council is responsible for enhancing collaboration between state and federal authorities on national security, disaster response, and military coordination matters. The Council of Governors was created by the National Defense Authorization Act of 2008, and these appointments aim to further its mission of improving state-federal partnership.",
    "link": "https://www.whitehouse.gov/presidential-actions/2025/02/president-trump-announces-appointments-to-the-council-of-governors/"
  },
  {
    "title": "Executive Order on Ensuring Accountability for Federal Agencies",
    "summary": "This executive order establishes a framework for promoting accountability within federal agencies to enhance the effective execution of laws and policies. The order outlines the President's authority to ensure that agencies operate in accordance with their designated responsibilities and mandates a review process for compliance with relevant statutes and regulations. This initiative aims to foster transparent and responsible governance at the federal level.",
    "link": "https://www.whitehouse.gov/presidential-actions/2025/02/ensuring-accountability-for-all-agencies/"
  },
  {
    "title": "Executive Order on Expanding Access to In Vitro Fertilization",
    "summary": "This executive order outlines the intent to enhance access to in vitro fertilization (IVF) services for couples facing infertility challenges. The order addresses the barriers that many couples encounter while trying to conceive, with a focus on increasing the availability and affordability of IVF procedures. By implementing measures aimed at improving access to these services, the administration seeks to support individuals and couples pursuing family-building options, recognizing the significance of addressing infertility as a public health concern.",
    "link": "https://www.whitehouse.gov/presidential-actions/2025/02/expanding-access-to-in-vitro-fertilization/"
  }
]