[
  {
    "title": "NSPM-7: National Security Presidential Memorandum on Countering Domestic Terrorism and Organized Political Violence",
    "summary": "This National Security Presidential Memorandum (NSPM-7) directs interagency coordination among the Secretary of State, the Secretary of the Treasury, the Attorney General, and the Secretary of Homeland Security to develop and implement policy objectives aimed at countering domestic terrorism and organized political violence within the United States. The memorandum establishes the scope and authority for executive action and calls for alignment of resources and authorities across agencies to address these threats through coordinated, multi-agency efforts.",
    "link": "https://www.whitehouse.gov/presidential-actions/2025/09/countering-domestic-terrorism-and-organized-political-violence/"
  },
  {
    "title": "Presidential Action to Designate Antifa as a Domestic Terrorist Organization",
    "summary": "This presidential action designates Antifa as a domestic terrorist organization. It describes Antifa as a militarist, anarchist enterprise that explicitly calls for the overthrow of the United States government, law enforcement authorities, and the system of law. The document states that Antifa employs illegal means to organize and execute a nationwide campaign of violence and terrorism, and references a Section 1 titled 'Antifa as a Terrorist Threat' that outlines the organization's goals and tactics as part of the designation.",
    "link": "https://www.whitehouse.gov/presidential-actions/2025/09/designating-antifa-as-a-domestic-terrorist-organization/"
  },
  {
    "title": "Proclamation on National Hispanic Heritage Month, 2025",
    "summary": "This presidential proclamation designates National Hispanic Heritage Month and establishes the period of observation from September 15 to October 15, 2025. It acknowledges the contributions of Hispanic Americans to the United States across military service, civic life, culture, education, and public affairs, and encourages educational and community activities that recognize Hispanic heritage and values during the observance.",
    "link": "https://www.whitehouse.gov/presidential-actions/2025/09/national-hispanic-heritage-month-2025/"
  },
  {
    "title": "Constitution Week, 2025 Proclamation",
    "summary": "Presidential proclamation designating Constitution Week for 2025 to commemorate the 238th anniversary of the signing of the United States Constitution. The proclamation describes the Constitution as the foundational charter of the United States' system of self-government and calls on the public and officials to observe Constitution Week (September 17–23, 2025) by reflecting on the Constitution's enduring principles, honoring its historical significance, and renewing civic commitments to the values it enshrines.",
    "link": "https://www.whitehouse.gov/presidential-actions/2025/09/constitution-week-2025/"
  }
]