[
  {
    "title": "Executive Order Regarding the Acquisition of Certain Assets of Emcore Corporation by Hiefo Corporation",
    "summary": "This executive order, issued under the authority of the President and invoking Section 721 of the Defense Production Act of 1950, sets forth findings related to the acquisition of certain assets of Emcore Corporation by Hiefo Corporation and authorizes actions under the act as appropriate to address the identified concerns from the transaction.",
    "link": "https://www.whitehouse.gov/presidential-actions/2026/01/regarding-the-acquisition-of-certain-assets-of-emcore-corporation-by-hiefo-corporation/"
  },
  {
    "title": "National Security Presidential Memorandum on Strengthening United States Leadership in 6G Technology",
    "summary": "This memorandum directs interagency coordination among the Secretaries of State, Defense, Commerce, Transportation, Energy, and Homeland Security, as well as the Director of National Intelligence, the Director of the Office of Management and Budget, the Chairman of the Federal Communications Commission, and senior White House policy officials, to advance the United States' leadership in sixth-generation wireless technology (6G). Its objectives include accelerating research and development, establishing security and resilience of supply chains and critical infrastructure, developing international standards and partnerships, and aligning funding, regulations, and policy with national security and economic goals. The memo assigns agency responsibilities and requires coordinated planning and reporting to guide implementation of 6G-related actions across the federal government.",
    "link": "https://www.whitehouse.gov/presidential-actions/2025/12/national-security-presidential-memorandum-nspm-8-0bda/"
  },
  {
    "title": "Proclamation for Bill of Rights Day, 2025",
    "summary": "A presidential proclamation designating Bill of Rights Day, 2025 and reflecting on the historical significance of the Bill of Rights. The document describes the ratification of the Bill of Rights and its role in shaping the nation's principles of liberty, justice, sovereignty, and self-determination, and it invites observance across the country while reaffirming the administration’s commitment to protecting civil liberties and the rule of law.",
    "link": "https://www.whitehouse.gov/presidential-actions/2025/12/bill-of-rights-day-2025/"
  }
]