[
  {
    "title": "Restoring Law and Order in Memphis: Presidential Action Coordinating Federal Resources and Local Authority Efforts",
    "summary": "This presidential action directs federal departments and agencies to coordinate with state and local authorities in Memphis, allocating and coordinating resources to support public safety and law enforcement efforts, with a framework for interagency collaboration and reporting on progress toward restoring order and safety in the city.",
    "link": "https://www.whitehouse.gov/presidential-actions/2025/09/restoring-law-and-order-in-memphis/"
  },
  {
    "title": "Patriot Day 2025 Proclamation: The 24th Anniversary of the September 11, 2001 Attacks",
    "summary": "A presidential proclamation designating Patriot Day 2025 to commemorate the 24th anniversary of the September 11, 2001 terrorist attacks. The proclamation calls on the nation to observe the day with remembrance of the victims and appreciation for first responders, and to reflect on the enduring impact of the attacks.",
    "link": "https://www.whitehouse.gov/presidential-actions/2025/09/patriot-day-2025-the-24th-annivresary-of-the-september-11-terrorist-attacks/"
  },
  {
    "title": "Memorandum to the Secretary of Health and Human Services and the Commissioner of the Food and Drug Administration on Addressing Misleading Direct-To-Consumer Prescription Drug Advertisements",
    "summary": "This memorandum discusses the authority granted to the FDA in 1962 to regulate prescription drug advertising and outlines concerns about direct-to-consumer advertisements that may misrepresent risks and benefits, potentially encourage reliance on medications over lifestyle changes, inappropriately influence the physician-patient relationship, and favor high-cost drugs over cheaper alternatives. It addresses the public health implications of misleading advertising and considers potential actions to address these issues.",
    "link": "https://www.whitehouse.gov/presidential-actions/2025/09/memorandum-for-the-secretary-of-health-and-human-services-the-commissioner-of-food-and-drugs/"
  },
  {
    "title": "Executive Order Restoring the United States Department of War",
    "summary": "This executive order asserts the authority to restore the United States Department of War, referencing its original establishment via an act signed by President George Washington on August 7, 1789. It outlines the purpose of the restored department and directs the implementation steps to reestablish its functions for overseeing its operation and maintenance, beginning with Section 1, Purpose, and detailing the intended duties and organizational actions required for restoration.",
    "link": "https://www.whitehouse.gov/presidential-actions/2025/09/restoring-the-united-states-department-of-war/"
  },
  {
    "title": "Modifying the Scope of Reciprocal Tariffs and Establishing Procedures for Implementing Trade and Security Agreements",
    "summary": "This presidential action asserts authority under the Constitution and specified statutes, including the International Emergency Economic Powers Act, the National Emergencies Act, and section 232 of the Trade Expansion Act of 1962, to modify the scope of reciprocal tariffs and to establish procedures for implementing trade and security agreements. The action outlines modifications to tariff scope and establishes a framework with procedural mechanisms for implementing related trade and security commitments, identifying the agencies and processes involved in enforcement and compliance, without expressing policy preferences.",
    "link": "https://www.whitehouse.gov/presidential-actions/2025/09/modifying-the-scope-of-reciprocal-tariffs-and-establishing-procedures-for-implementing-trade-and-security-agreements/"
  },
  {
    "title": "Executive Order to Strengthen U.S. Government Efforts to Safeguard Nationals from Wrongful Detention Abroad",
    "summary": "This presidential executive order, issued under the authority of the Constitution and the Levinson Hostage Recovery and Hostage-Taking Accountability Act (22 U.S.C. 1741 et seq.), states the purpose of strengthening United States government efforts to protect American nationals from wrongful detention abroad. Section 1 defines the objective as enhancing protective measures for U.S. nationals detained outside the United States and coordinating a government-wide response. The order is intended to guide federal agencies in implementing enhanced protections, accountability, and response mechanisms related to wrongful detention cases.",
    "link": "https://www.whitehouse.gov/presidential-actions/2025/09/strengthening-efforts-to-protect-u-s-nationals-from-wrongful-detention-abroad/"
  }
]