[
  {
    "title": "Executive Order on Federal Civic Architecture Aesthetics",
    "summary": "This presidential executive order emphasizes the importance of Federal civic architecture and directs attention to improving the design and aesthetics of federal public buildings. It notes the Founders’ view that public buildings should inspire the American people and support civic life, and begins with Section 1, titled 'Purpose,' outlining the rationale for enhancing the federal built environment.",
    "link": "https://www.whitehouse.gov/presidential-actions/2025/08/making-federal-architecture-beautiful-again/"
  },
  {
    "title": "Proclamation Designating Overdose Prevention Week, 2025",
    "summary": "This proclamation designates Overdose Prevention Week for 2025 and emphasizes that the safety, health, and well-being of the American people are essential to national resilience. It notes the drug overdose crisis as a grave threat and calls for awareness and coordinated action across federal, state, and local governments, communities, and individuals to prevent overdoses and to support those affected.",
    "link": "https://www.whitehouse.gov/presidential-actions/2025/08/overdose-prevention-week-2025/"
  },
  {
    "title": "Proclamation on Labor Day, 2025",
    "summary": "This presidential proclamation designates Labor Day, 2025 and recognizes the essential contributions of American workers to the nation's history and ongoing development. It notes that from the earliest settlers to modern industries, the skill, determination, and resilience of workers have shaped the country's progress. The document calls for national acknowledgment of workers' achievements and for continued efforts to support safe, fair, and dignified work, as well as opportunities for economic advancement and improved working conditions.",
    "link": "https://www.whitehouse.gov/presidential-actions/2025/08/labor-day-2025/"
  },
  {
    "title": "Directive to Investigate Use of Federal Grant Funds for Illegal Lobbying and Partisan Political Activity by Federal Grantees",
    "summary": "This presidential memorandum directs the Attorney General to oversee investigations into the use of federal grant funds, focusing on potential use of those funds for illegal lobbying and for partisan political activity by federal grantees. The document establishes that Section 1 addresses investigations into how federal grant funds are used and outlines the authority and intent to pursue inquiries and enforce applicable laws governing the use of such funds, with the aim of preventing improper funding practices and ensuring compliance by grantees.",
    "link": "https://www.whitehouse.gov/presidential-actions/2025/08/use-of-appropriated-funds-for-illegal-lobbying-and-partisan-political-activity-by-federal-grantees/"
  },
  {
    "title": "Executive Order Excluding Additional Agencies from the Federal Labor-Management Relations Program",
    "summary": "This executive order, issued under the President's constitutional and statutory authorities, modifies the scope of the Federal Labor-Management Relations Program by excluding specified federal agencies and agency subdivisions from its coverage. It defines determinations that list the excluded entities in Section 2 and directs the affected agencies to implement the exclusions in accordance with applicable law. The order cites authority under 5 U.S.C. 7103(b)(1) and other provisions, and states that the action is intended to enhance the national security of the United States. It requires appropriate administrative actions to implement the exclusions and any required reporting.",
    "link": "https://www.whitehouse.gov/presidential-actions/2025/08/further-exclusions-from-the-federal-labor-management-relations-program/"
  },
  {
    "title": "Proclamation on the Fourth Anniversary of the Abbey Gate Attack in Kabul, Afghanistan",
    "summary": "Presidential Proclamation commemorating the fourth anniversary of the Abbey Gate attack during the Kabul evacuation in August 2021. The incident resulted in the deaths of 13 U.S. service members and injuries to others. The proclamation honors the memory of the fallen, recognizes the sacrifices of their families and colleagues, and reiterates the United States' commitment to supporting affected families, veterans, and ongoing national security responsibilities related to Afghanistan.",
    "link": "https://www.whitehouse.gov/presidential-actions/2025/08/fourth-anniversary-of-the-attack-at-abbey-gate-2025/"
  },
  {
    "title": "Executive Action to End Cashless Bail and Reform Pretrial Release",
    "summary": "This presidential action directs federal agencies to take steps to end cashless bail, with the goal of reforming pretrial release practices to prevent detention solely on inability to afford bail, while maintaining public safety. It directs coordination with federal courts and related entities to implement policy changes, establish interim procedures for release decisions, and require reporting on implementation progress and impacts. The action envisions alternatives to monetary conditions and emphasizes accountability and fair treatment in pretrial processes.",
    "link": "https://www.whitehouse.gov/presidential-actions/2025/08/taking-steps-to-end-cashless-bail-to-protect-americans/"
  },
  {
    "title": "Executive Measures to End Cashless Bail and Enforce the Law in the District of Columbia",
    "summary": "This presidential action references Executive Order 14333, which declared a crime emergency in the District of Columbia as of August 11, 2025, and describes measures intended to end cashless bail and to strengthen enforcement in the District. It states the President's constitutional and statutory authority to implement these measures and situates them within the crime emergency declared for Washington, D.C. The summary outlines objectives to modify bail practices and related enforcement procedures to address the emergency, with applicability to the District of Columbia and in alignment with the policy framework established by EO 14333.",
    "link": "https://www.whitehouse.gov/presidential-actions/2025/08/measures-to-end-cashless-bail-and-enforce-the-law-in-the-district-of-columbia/"
  },
  {
    "title": "Executive Order Directing Prosecution of Burning the American Flag",
    "summary": "An executive order issued by the President establishes federal policy regarding acts of burning the American flag, recognizes the flag as a national symbol linked to the United States' identity, and directs the enforcement of applicable federal statutes related to such acts. The order outlines the purpose of protecting the flag's status, identifies mechanisms for implementing enforcement measures, and directs relevant federal departments and agencies to coordinate on initiating prosecutions under applicable law. The text indicates a focus on prosecutorial action for flag-burning offenses and aims to provide guidance for uniform enforcement across federal jurisdictions.",
    "link": "https://www.whitehouse.gov/presidential-actions/2025/08/prosecuting-burning-of-the-american-flag/"
  }
]