[
  {
    "title": "Executive Order Under the Defense Production Act Concerning the Acquisition of Certain Assets of Emcore Corporation by Hiefo Corporation",
    "summary": "This presidential action is issued under the Constitution and the Defense Production Act of 1950, including section 721, and sets forth an executive order addressing the acquisition of certain Emcore Corporation assets by Hiefo Corporation. The order declares that Section 1 contains Findings, including that there is credible evidence supporting concerns related to the transaction, and establishes the authority and potential directives to be applied under the Act to address those concerns. The document outlines the framework for government action in relation to the acquisition, consistent with the statutory provisions of the Defense Production Act and the President's constitutional responsibilities.",
    "link": "https://www.whitehouse.gov/presidential-actions/2026/01/regarding-the-acquisition-of-certain-assets-of-emcore-corporation-by-hiefo-corporation/"
  },
  {
    "title": "National Security Presidential Memorandum NSPM-8 on Coordinating United States Efforts in 6G Wireless Technology",
    "summary": "Directs multiple executive departments and agencies to coordinate research, development, standards setting, and policy actions to advance the United States' leadership in sixth-generation wireless technology (6G). The memorandum outlines objectives to strengthen national security by ensuring secure supply chains and resilient telecommunications infrastructure, promote United States economic competitiveness, and foster international collaboration with allies. It calls for interagency planning and alignment with domestic and international standards, as well as concrete actions to accelerate development, deployment, and protection of 6G technologies across government, industry, and national security domains.",
    "link": "https://www.whitehouse.gov/presidential-actions/2025/12/national-security-presidential-memorandum-nspm-8-0bda/"
  },
  {
    "title": "Proclamation Designating Bill of Rights Day, 2025",
    "summary": "This presidential proclamation designates Bill of Rights Day for 2025 and recognizes the ratification of the United States Bill of Rights as a foundational element of the nation’s commitment to liberty, justice, and self-government. It reflects on the historical significance of the Bill of Rights and invites observance and education about the rights guaranteed to all Americans.",
    "link": "https://www.whitehouse.gov/presidential-actions/2025/12/bill-of-rights-day-2025/"
  }
]