[
  {
    "title": "National Day of Remembrance for Charlie Kirk Proclamation",
    "summary": "The President issues a proclamation designating a National Day of Remembrance for Charlie Kirk to be observed nationwide in response to the death of Charlie Kirk on September 10, 2025. The proclamation calls upon federal, state, and local governments, as well as educational institutions, organizations, and the public, to observe the day with solemn reflection, appropriate ceremonies, moments of silence, and educational activities. It emphasizes honoring the life and contributions of Charlie Kirk and maintaining nonpartisan civic traditions in observance of the occasion.",
    "link": "https://www.whitehouse.gov/presidential-actions/2025/10/national-day-of-remembrance-for-charlie-kirk/"
  },
  {
    "title": "Proclamation by the President on the 250th Anniversary of the Founding of the United States Navy",
    "summary": "A presidential proclamation commemorating the 250th anniversary of the founding of the United States Navy, noting that the Navy traces its origins to the Second Continental Congress's establishment of a maritime armed force and describing its historical role; the proclamation acknowledges the contributions of naval personnel and the importance of naval service to national security and maritime history.",
    "link": "https://www.whitehouse.gov/presidential-actions/2025/10/250th-anniversary-of-the-founding-of-the-united-states-navy/"
  },
  {
    "title": "Proclamation on General Pulaski Memorial Day, 2025",
    "summary": "The President proclaims General Pulaski Memorial Day in 2025 to honor Casimir Pulaski, a Polish nobleman who served as a brigadier general during the American Revolutionary War and contributed to the fight for independence. Pulaski is historically associated with the titles Soldier of Liberty and Father of the American Cavalry. The proclamation designates the day for observance with appropriate ceremonies and remembrance of Pulaski's contributions to the United States and to the longstanding ties between the United States and Poland.",
    "link": "https://www.whitehouse.gov/presidential-actions/2025/10/general-pulaski-memorial-day-2025/"
  },
  {
    "title": "Presidential Proclamation on National Breast Cancer Awareness Month",
    "summary": "A proclamation by the President recognizing National Breast Cancer Awareness Month, highlighting the impact of breast cancer on Americans and families, and acknowledging the resilience of those affected. The proclamation reaffirms the administration's commitment to addressing breast cancer through awareness, prevention, research, treatment, and support for individuals and communities affected.",
    "link": "https://www.whitehouse.gov/presidential-actions/2025/10/presidential-message-on-national-breast-cancer-awareness-month/"
  }
]