[
  {
    "title": "Nomination of Lee Lipton to be Ambassador Extraordinary and Plenipotentiary to the Republic of the Philippines",
    "summary": "The White House announced the nomination of Lee Lipton, a resident of Florida, to serve as the United States Ambassador Extraordinary and Plenipotentiary to the Republic of the Philippines. The nomination has been transmitted to the United States Senate for its advice and consent, as part of the Nominations Sent to the Senate listing published by the White House.",
    "link": "https://www.whitehouse.gov/presidential-actions/2025/10/nominations-sent-to-the-senate-85f4/"
  },
  {
    "title": "Presidential Decision Approving Alaska Industrial Development and Export Authority Ambler Road Project Appeal under ANILCA 1106(a) and Approving the 2016 Revised Consolidated Application",
    "summary": "The President approves the appeal filed by the Alaska Industrial Development and Export Authority under section 1106(a) of the Alaska National Interest Lands Conservation Act and approves AIDEA's 2016 revised consolidated application for the Ambler Road Project. The decision includes a statement of reasons detailing the factual and legal basis for the approval and outlines the considerations and steps associated with implementing the decision.",
    "link": "https://www.whitehouse.gov/presidential-actions/2025/10/decision-of-the-president-and-statement-of-reasons-on-2025-ambler-road-appeal/"
  },
  {
    "title": "Executive Action to Establish Security Measures for Federal Personnel and Property in Illinois",
    "summary": "A presidential action directing enhanced security measures to protect federal personnel and facilities in Illinois, with particular emphasis on facilities in and around Chicago. The memorandum to the Secretary of War, the Attorney General, and the Secretary of Homeland Security outlines the need for immediate and coordinated actions to ensure the safety of federal personnel and property, and to address ongoing threats or destabilizing activities affecting federal operations in the state. It calls for interagency coordination and implementation of security protocols, allocation of resources, and oversight to ensure compliance and effectiveness. The action states that the current situation cannot continue and directs measures to safeguard federal operations in Illinois.",
    "link": "https://www.whitehouse.gov/presidential-actions/2025/10/department-of-war-security-for-the-protection-of-federal-personnel-and-property-in-illinois/"
  },
  {
    "title": "Nominations Sent to the Senate for Daniel Bonham, Mark Ditlevson, and Paul Ferguson",
    "summary": "The White House announced nominations sent to the Senate for federal appointments, including Daniel Bonham of Oregon to be Assistant Secretary of Labor, Mark Ditlevson of Minnesota to be Assistant Secretary of Defense, and Paul Ferguson of West Virginia to be United States Marshal for the Northern District of West Virginia for a four-year term, along with additional nominees.",
    "link": "https://www.whitehouse.gov/presidential-actions/2025/10/nominations-sent-to-the-senate-ae53/"
  },
  {
    "title": "Executive Order to Leverage Artificial Intelligence to Accelerate Pediatric Cancer Research and Treatments",
    "summary": "This executive order establishes the federal policy to use artificial intelligence to advance research, prevention, and treatment of pediatric cancer and other childhood diseases. It directs federal agencies to coordinate efforts to accelerate AI-enabled medical research, facilitate innovation, and translate findings into clinical practice, with attention to responsible development and implementation.",
    "link": "https://www.whitehouse.gov/presidential-actions/2025/09/unlocking-cures-for-pediatric-cancer-with-artificial-intelligence/"
  },
  {
    "title": "Executive Order: Assuring the Security of the State of Qatar",
    "summary": "Under his constitutional and statutory authority, the President issues an executive order reaffirming the enduring alliance between the United States and the State of Qatar and establishing policy to assure Qatar's security. The order designates the bilateral relationship as the basis for security cooperation, beginning with Section 1: Policy, which outlines the general objective of coordinating defense and security measures to support Qatar, and describes the executive branch's role in implementing those objectives. The action reflects ongoing cooperation between U.S. and Qatari authorities to strengthen regional security and bilateral defense commitments.",
    "link": "https://www.whitehouse.gov/presidential-actions/2025/09/assuring-the-security-of-the-state-of-qatar/"
  }
]