[
  {
    "title": "Proclamation: Fire Prevention Week, 2025",
    "summary": "The proclamation designates Fire Prevention Week, 2025 and calls on households and communities to prioritize fire prevention by taking steps to reduce risk and enhance safety. It acknowledges the work of firefighters and first responders nationwide in protecting lives and property and emphasizes ongoing public education and preparedness to improve fire safety.",
    "link": "https://www.whitehouse.gov/presidential-actions/2025/10/fire-prevention-week-2025/"
  },
  {
    "title": "National Manufacturing Day, 2025 Proclamation",
    "summary": "A presidential proclamation designates National Manufacturing Day, 2025 and describes manufacturing as foundational to the United States' prosperity, communities, independence, and national strength. The proclamation notes the historical progression from early mills and forges to contemporary industries and outlines the government's interest in recognizing and supporting the manufacturing sector.",
    "link": "https://www.whitehouse.gov/presidential-actions/2025/10/national-manufacturing-day-2025/"
  },
  {
    "title": "Proclamation Adjusting Imports of Timber, Lumber, and Their Derivative Products into the United States Under Section 232 National Security Investigation",
    "summary": "On July 1, 2025, the Secretary of Commerce transmitted to the President a report on his investigation into the effects of imports of timber, lumber, and their derivative products on the national security of the United States under section 232. The proclamation uses the findings of that investigation to implement adjustments to the importation of timber, lumber, and their derivative products into the United States, addressing identified national security concerns.",
    "link": "https://www.whitehouse.gov/presidential-actions/2025/09/adjusting-imports-of-timber-lumber-and-their-derivative-products-into-the-united-states/"
  },
  {
    "title": "Continuance Through September 30, 2027 of Certain Federal Advisory Committees",
    "summary": "Under the authority vested in the President by the Constitution and federal law, and consistent with chapter 10 of title 5, United States Code (the Federal Advisory Committee Act), this action continues the operation of certain federal advisory committees through September 30, 2027. Section 1 states that each advisory committee listed in the order is continued until September 30, 2027, with the continuation applying to the committees named in the document and related administrative provisions.",
    "link": "https://www.whitehouse.gov/presidential-actions/2025/09/continuance-of-certain-federal-advisory-committees/"
  },
  {
    "title": "Memorandum Directing Enforcement of Federal Death Penalty Laws in the District of Columbia",
    "summary": "This memorandum, addressed to the Attorney General and the United States Attorney for the District of Columbia, states that the President exercises authority under the Constitution and federal law to ensure the enforcement of federal death penalty statutes within the District of Columbia. It directs these officials to apply the federal death penalty where permitted by law in appropriate cases, with the aim of deterring and punishing the most serious crimes committed in the district. The memorandum notes coordination among the Department of Justice and other relevant agencies to identify qualifying prosecutions, ensure compliance with applicable statutory requirements and constitutional protections, and report on implementation as required.",
    "link": "https://www.whitehouse.gov/presidential-actions/2025/09/enforcing-the-death-penalty-laws-in-the-district-of-columbia-to-deter-and-punish-the-most-heinous-crimes/"
  }
]