[
  {
    "title": "Proclamation on Adjusting Imports of Steel into the United States",
    "summary": "This proclamation outlines the decision regarding the adjustment of imports of steel into the United States. It references previous discussions and agreements with various countries, including the Argentine Republic and the Commonwealth of Australia, concerning measures related to the importation of steel. The proclamation is intended to reflect the ongoing international trade relations and adjustments made in response to those discussions.",
    "link": "https://www.whitehouse.gov/presidential-actions/2025/02/adjusting-imports-of-steel-into-the-united-states/"
  },
  {
    "title": "Suspension of Enforcement of the Foreign Corrupt Practices Act for Economic and National Security Considerations",
    "summary": "This executive order outlines the decision to pause the enforcement of the Foreign Corrupt Practices Act (FCPA), originally enacted in 1977, citing its impact on American economic and national security interests. The order aims to reassess the implications of the FCPA on U.S. businesses operating abroad, suggesting a need to balance anti-corruption measures with the competitiveness of American enterprises in the global market. The document discusses the historical context of the FCPA and its systematic enforcement over the years, and it emphasizes the goal of ensuring that economic and national security needs are adequately addressed in policy enforcement.",
    "link": "https://www.whitehouse.gov/presidential-actions/2025/02/pausing-foreign-corrupt-practices-act-enforcement-to-further-american-economic-and-national-security/"
  },
  {
    "title": "Executive Order on the Use of Straw Materials in Procurement",
    "summary": "This Executive Order addresses the procurement policies concerning the use of straws, specifically targeting the prohibitions and regulations that have arisen regarding plastic and paper straws in various jurisdictions. It emphasizes concerns regarding the bans on plastic straws and the forced inclusion of alternative materials like paper straws in service settings. The Order delineates the policy direction that seeks to reconsider these regulations, focusing on compatibility with consumer choices and operational needs in the beverage service industry.",
    "link": "https://www.whitehouse.gov/presidential-actions/2025/02/ending-procurement-and-forced-use-of-paper-straws/"
  },
  {
    "title": "Proclamation of Gulf of America Day on February 9, 2025",
    "summary": "This document serves as a proclamation by the President of the United States to officially recognize February 9, 2025, as Gulf of America Day. The proclamation highlights the significance of this day and its establishment as a result of actions taken under Executive Order 14172, which was signed on January 20, 2025. This order focused on restoring names and honors related to American contributions and history. The formal recognition aims to promote awareness and appreciation of the Gulf of America and its importance.",
    "link": "https://www.whitehouse.gov/presidential-actions/2025/02/gulf-of-america-day-2025/"
  }
]