[
  {
    "title": "America 250: Presidential Message on the Anniversary of the Monroe Doctrine",
    "summary": "A presidential message commemorating the anniversary of the Monroe Doctrine, established in 1823, that states the United States will steadfastly defend the homeland, its interests, and the well-being of its citizens. The message reiterates the principles of the Monroe Doctrine and explains their relevance to contemporary U.S. foreign policy and regional engagement, emphasizing national sovereignty and the defense of security.",
    "link": "https://www.whitehouse.gov/presidential-actions/2025/12/america-250-presidential-message-on-the-anniversary-of-the-monroe-doctrine/"
  },
  {
    "title": "America 250: Presidential Message Honoring Mark Twain on His 190th Birthday",
    "summary": "A White House post presenting a presidential message commemorating Mark Twain’s 190th birthday as part of the America 250 initiative. The message notes Twain’s contributions to American literature and culture, highlighting his use of humor and imagination in storytelling and describing his impact on American life. The post is published on the White House website under the category of presidential actions and reflects ongoing commemorations within the America 250 program.",
    "link": "https://www.whitehouse.gov/presidential-actions/2025/11/america-250-presidential-message-on-mark-twains-190th-birthday/"
  },
  {
    "title": "Executive Order Launching the Genesis Mission",
    "summary": "This executive order establishes the Genesis Mission as a government initiative to advance scientific discovery and technological innovation as a core national priority. It cites the historical role of discovery in American progress and identifies a current objective to strengthen the United States’ position in global technology leadership. The order outlines the mission’s purpose and directs coordination among relevant federal agencies to implement the initiative.",
    "link": "https://www.whitehouse.gov/presidential-actions/2025/11/launching-the-genesis-mission/"
  },
  {
    "title": "Executive Order Designating Certain Muslim Brotherhood Chapters as Foreign Terrorist Organizations and Specially Designated Global Terrorists",
    "summary": "This Presidential Executive Order designates specific chapters of the Muslim Brotherhood as Foreign Terrorist Organizations (FTOs) and as Specially Designated Global Terrorists (SDGTs) under the Immigration and Nationality Act (INA) and the International Emergency Economic Powers Act (IEEPA). Issued under the President's constitutional and statutory authority, the order identifies the designation's purpose and directs the implementation of sanctions consistent with those authorities, including prohibitions on designated-entity transactions and the blocking of assets, along with related enforcement measures by federal agencies.",
    "link": "https://www.whitehouse.gov/presidential-actions/2025/11/designation-of-certain-muslim-brotherhood-chapters-as-foreign-terrorist-organizations-and-specially-designated-global-terrorists/"
  },
  {
    "title": "Presidential Action Modifying Tariffs Applicable to the Government of Brazil",
    "summary": "This presidential action utilizes the President's authority under the International Emergency Economic Powers Act, the National Emergencies Act, and section 604 of the Trade Act of 1974, as amended, to modify the scope of tariffs applicable to the Government of Brazil. The action specifies changes to which transactions or goods are subject to tariffs and is issued as a presidential action published by The White House, outlining the statutory basis and intended effect on tariff treatment for related dealings.",
    "link": "https://www.whitehouse.gov/presidential-actions/2025/11/modifying-the-scope-of-tariffs-on-the-government-of-brazil/"
  }
]