[
  {
    "title": "Proclamation Commemorating the 160th Anniversary of the United States Secret Service",
    "summary": "This proclamation marks the 160th anniversary of the founding of the United States Secret Service, an agency established by legislation signed by President Abraham Lincoln on April 14, 1865. The agency was originally created to combat counterfeit currency and has since expanded its responsibilities to include protecting national leaders and investigating financial crimes. The proclamation recognizes the agency's history and contributions over the past 160 years.",
    "link": "https://www.whitehouse.gov/presidential-actions/2025/07/160th-anniversary-of-the-united-states-secret-service-2025/"
  },
  {
    "title": "Presidential Permit for South Bow (USA) LP to Operate and Maintain Pipeline Facilities at the U.S.-Canada Border in Cavalier County, North Dakota",
    "summary": "This document grants a presidential permit to South Bow (USA) LP, a limited partnership organized under Delaware law, authorizing the company to operate and maintain pipeline facilities at the international boundary between the United States and Canada in Cavalier County, North Dakota. The permit is issued with specific conditions outlined within the order.",
    "link": "https://www.whitehouse.gov/presidential-actions/2025/06/text-of-a-letter-from-the-president-to-the-speaker-of-the-house-of-representatives/"
  },
  {
    "title": "Presidential Executive Order to Extend Enforcement Delay Related to TikTok",
    "summary": "This order, issued by the President, extends the enforcement delay originally specified in Executive Order 14166, which pertains to the application of certain restrictions and measures concerning TikTok, based on authorities granted by the Constitution and federal laws of the United States. The extension prolongs the period during which specific enforcement actions are delayed, to a date specified in the order.",
    "link": "https://www.whitehouse.gov/presidential-actions/2025/06/further-extending-the-tiktok-enforcement-delay/"
  }
]