[
  {
    "title": "Executive Order on Strengthening Family Stability and Foster Care Policy",
    "summary": "This executive order articulates the administration's policy to support parents in raising children in safe and loving homes and to address situations in which crises prevent family-based care by strengthening the foster care system. It directs federal agencies to coordinate efforts to protect the welfare of children, promote family preservation and stability, support foster families, and ensure safe and appropriate arrangements for children when family-based care is not possible. The order emphasizes interagency collaboration, review of existing child welfare laws and programs, and the development of policies intended to improve safety, permanency, and well-being for children involved with foster care.",
    "link": "https://www.whitehouse.gov/presidential-actions/2025/11/fostering-the-future-for-american-children-and-families/"
  },
  {
    "title": "Proclamation on Anti-Communism Week, 2025",
    "summary": "The President issues a proclamation designating Anti-Communism Week for 2025 and describing the historical impact of communism, noting that more than 100 million lives have been lost under regimes associated with communist ideologies. The proclamation invites reflection on this history during the designated week.",
    "link": "https://www.whitehouse.gov/presidential-actions/2025/11/anti-communism-week-2025/"
  },
  {
    "title": "Nominations Sent to the Senate for Assistant Attorney General, Director of the Bureau of Land Management, and Nuclear Regulatory Commission Member",
    "summary": "The White House announced nominations to the Senate for Daniel E. Burrows to be Assistant Attorney General; Stevan Pearce to be Director of the Bureau of Land Management; and Douglas Weaver to be a Member of the Nuclear Regulatory Commission for the remainder of the term expiring June 30.",
    "link": "https://www.whitehouse.gov/presidential-actions/2025/11/nominations-sent-to-the-senate-099e/"
  },
  {
    "title": "Nominations Sent to the Senate for Michael Selig as Chair and Commissioner of the Commodity Futures Trading Commission; Withdrawal of Joel Rayburn Nomination",
    "summary": "The White House announced that nominations have been sent to the Senate for Michael Selig of Florida to serve as Chairman of the Commodity Futures Trading Commission, to succeed Rostin Behnam, and to serve as a Commissioner of the Commission for a term expiring April 13, 2029, to succeed Christy Goldsmith Romero. A withdrawal of the nomination for Joel Rayburn to the Senate is also noted.",
    "link": "https://www.whitehouse.gov/presidential-actions/2025/10/nominations-and-withdrawal-sent-to-the-senate/"
  }
]