[
  {
    "title": "Emergency Declaration for Federal Assistance in Kentucky",
    "summary": "President Donald J. Trump declared an emergency in the Commonwealth of Kentucky due to severe storms, straight-line winds, flooding, and landslides that began on February 14, 2025. This declaration authorizes federal assistance to enhance the response efforts of state and local authorities in managing the emergency conditions resulting from these severe weather events.",
    "link": "https://www.whitehouse.gov/presidential-actions/2025/02/president-donald-j-trump-approves-kentucky-emergency-declaration/"
  },
  {
    "title": "Establishment of the National Energy Dominance Council",
    "summary": "This executive order establishes the National Energy Dominance Council, which is tasked with overseeing the management and development of the United States' natural resources. The order highlights the nation's leadership in energy technologies and innovation, emphasizing the importance of these resources for economic growth and national security. The Council will aim to streamline regulatory processes and enhance infrastructure for energy production and distribution to ensure the United States remains a global leader in energy dominance.",
    "link": "https://www.whitehouse.gov/presidential-actions/2025/02/establishing-the-national-energy-dominance-council/"
  },
  {
    "title": "Nominations to Key Positions at Health and Human Services, Labor, and Veterans Affairs Submitted to the Senate",
    "summary": "This document outlines the nominations submitted to the U.S. Senate for key positions within various federal agencies. The nominees include Gary Andres for Assistant Secretary of Health and Human Services, Daniel Aronowitz for Assistant Secretary of Labor, and James Baehr for General Counsel at the Department of Veterans Affairs. Additionally, Kirsten Baesler is nominated to serve as Assistant Secretary for Elementary and Secondary Education. These nominations are part of the administration's efforts to fill important roles within the government to ensure effective operation of these departments.",
    "link": "https://www.whitehouse.gov/presidential-actions/2025/02/nominations-sent-to-the-senate/"
  },
  {
    "title": "Proclamation on Adjusting Aluminum Imports into the United States",
    "summary": "This proclamation outlines the findings and recommendations from a January 19, 2018 report submitted by the Secretary of Commerce regarding the impact of aluminum imports on U.S. national security. The report stems from an investigation conducted under section 232 of the Trade Expansion Act of 1962, which examines the effects that specific goods, particularly aluminum, may have on ensuring national security. The proclamation aims to address these findings through adjustments to U.S. import policies for aluminum.",
    "link": "https://www.whitehouse.gov/presidential-actions/2025/02/adjusting-imports-of-aluminum-into-the-united-states/"
  },
  {
    "title": "Announcement of Members for the President's Intelligence Advisory Board",
    "summary": "President Donald J. Trump has announced the establishment of the President's Intelligence Advisory Board (PIAB), which will consist of selected individuals who will provide advice to the President regarding national security matters. The board is tasked with addressing the nation’s key security challenges and ensuring that the activities of the Intelligence Community align with the President’s policy objectives. This advisory group is expected to contribute to the effectiveness of intelligence operations and strategies.",
    "link": "https://www.whitehouse.gov/presidential-actions/2025/02/president-trump-announces-the-presidents-intelligence-advisory-board/"
  },
  {
    "title": "Presidential Proclamation on Adjusting Steel Imports to Address National Security Concerns",
    "summary": "This proclamation addresses the findings of a report submitted by the Secretary of Commerce regarding the impact of steel mill article imports on the national security of the United States. The report was conducted under section 232 of the Trade Expansion Act and outlines considerations for regulating these imports to protect national security interests. The proclamation reflects the administration's approach to ensuring that the level of steel imports aligns with national security priorities.",
    "link": "https://www.whitehouse.gov/presidential-actions/2025/02/adjusting-imports-of-steel-into-the-united-states/"
  }
]