[
  {
    "title": "National Security Presidential Memorandum 8 on Advancing United States Leadership in 6G Technology",
    "summary": "This National Security Presidential Memorandum (NSPM-8) directs multiple federal departments and agencies to develop and implement policy actions aimed at accelerating research, development, and deployment of sixth-generation wireless technology (6G). The document seeks to strengthen United States leadership in 6G by ensuring secure and resilient supply chains, coordinating efforts on standards and interoperability with international partners, and safeguarding national security interests. The memo assigns responsibilities to agencies including the Department of State, Department of Defense, Department of Commerce, Department of Transportation, Department of Energy, Department of Homeland Security, the Office of Management and Budget, the Director of National Intelligence, the Chairman of the Federal Communications Commission, and senior White House policy offices, with requirements for cross-agency collaboration, progress reporting, and established timelines. The White House post accompanying the memorandum, titled Winning the 6G Race, explains the policy objectives and anticipated outcomes.",
    "link": "https://www.whitehouse.gov/presidential-actions/2025/12/national-security-presidential-memorandum-nspm-8-0bda/"
  },
  {
    "title": "Proclamation Designating Bill of Rights Day, 2025",
    "summary": "The President issues a proclamation designating Bill of Rights Day, 2025, to recognize the adoption and enduring protections of the rights enumerated in the first ten amendments to the Constitution. The Bill of Rights protects fundamental freedoms including speech, religion, press, assembly, and petition, as well as due process and protection against unreasonable searches and seizures. The proclamation acknowledges the historical roots of liberty and self-government and emphasizes the ongoing responsibility of the federal government to safeguard civil liberties. It invites observances by federal agencies and the public, encourages education about constitutional rights, and highlights the principles of justice and equal protection under the law as central to the nation's commitment to individual rights.",
    "link": "https://www.whitehouse.gov/presidential-actions/2025/12/bill-of-rights-day-2025/"
  },
  {
    "title": "Executive Order Designating Fentanyl as a Weapon of Mass Destruction",
    "summary": "Presidential Executive Order designates illicit fentanyl as a weapon of mass destruction for purposes of federal policy. It states that illicit fentanyl is closer to a chemical weapon than a narcotic and references a representative quantity of two milligrams to illustrate potency. The order establishes the policy framework under Section 1, Purpose and Policy, and directs relevant federal agencies to coordinate actions to counter fentanyl trafficking, production, and misuse as part of national security and public safety efforts.",
    "link": "https://www.whitehouse.gov/presidential-actions/2025/12/designating-fentanyl-as-a-weapon-of-mass-destruction/"
  },
  {
    "title": "Executive Order Addressing Foreign-Owned Proxy Advisory Firms and Investor Influence",
    "summary": "This presidential executive order asserts the president's authority to address concerns about the influence of two foreign-owned proxy advisory firms, Institutional Shareholder Services Inc. and Glass, Lewis & Co., LLC, on policies and priorities related to American investors. It describes the purpose of the order and notes the aim of addressing the influence these firms may have on U.S. corporate governance and investment-related decision-making.",
    "link": "https://www.whitehouse.gov/presidential-actions/2025/12/protecting-american-investors-from-foreign-owned-and-politically-motivated-proxy-advisors/"
  },
  {
    "title": "Executive Order Establishing a National Policy Framework for Artificial Intelligence",
    "summary": "This presidential executive order, issued under the President's constitutional and statutory authority, establishes a national policy framework for artificial intelligence. The order states that United States leadership in AI is intended to promote national and economic security and leadership across multiple domains. It cites Executive Order 14179 dated January 23 and begins with a Section 1 titled 'Purpose.' The document frames the policy objective as guiding the United States' AI development and deployment at the national level, reflecting an effort to align actions with broader national interests in AI.",
    "link": "https://www.whitehouse.gov/presidential-actions/2025/12/eliminating-state-law-obstruction-of-national-artificial-intelligence-policy/"
  }
]