[
  {
    "title": "Proclamation of National Volunteer Week, 2025",
    "summary": "This proclamation recognizes National Volunteer Week, a designated time to honor and appreciate the contributions of volunteers across the United States. It acknowledges the efforts of individuals who provide their time, skills, and resources in service to their communities, emphasizing the positive impact such service has on neighbors and community welfare. The proclamation aims to promote and encourage volunteerism and community involvement.",
    "link": "https://www.whitehouse.gov/presidential-actions/2025/04/national-volunteer-week-2025/"
  },
  {
    "title": "Establishment of Initiatives for Artificial Intelligence Education Targeting American Youth",
    "summary": "This executive order outlines the objectives and initiatives aimed at improving artificial intelligence education for the youth in the United States. It recognizes the rapid advancement of AI technologies and their significant impact on innovation, productivity, and daily life. The order seeks to enhance the understanding and skills related to artificial intelligence among younger generations to equip them for future opportunities in a tech-driven workforce.",
    "link": "https://www.whitehouse.gov/presidential-actions/2025/04/advancing-artificial-intelligence-education-for-american-youth/"
  },
  {
    "title": "Executive Order on Equality of Opportunity and Merit-Based Systems",
    "summary": "This executive order emphasizes the principle of equality under the law as a fundamental aspect of American governance. It outlines the commitment to ensuring that all citizens have equal opportunities without guaranteeing equal outcomes. The order advocates for meritocracy as a means to uphold these values and seeks to clarify the standards and practices related to this principle in various sectors.",
    "link": "https://www.whitehouse.gov/presidential-actions/2025/04/restoring-equality-of-opportunity-and-meritocracy/"
  },
  {
    "title": "Reinstatement of Classroom Safety and Discipline Policies",
    "summary": "This executive order outlines the administration's commitment to ensuring safety and order within educational environments by addressing known risks to children's safety and well-being in classrooms. The document establishes a framework for reinstating discipline policies aimed at enhancing safety measures in schools across the United States, reflecting a comprehensive approach to managing potential threats to the educational experience.",
    "link": "https://www.whitehouse.gov/presidential-actions/2025/04/reinstating-common-sense-school-discipline-policies/"
  },
  {
    "title": "Proclamation for Holocaust Remembrance Day 2025",
    "summary": "This proclamation designates Yom HaShoah, also known as Holocaust Remembrance Day, as a time for reflection and remembrance of the victims of the Holocaust. It emphasizes the importance of honoring the memory of the six million Jewish individuals who were murdered during the Holocaust by the Nazi regime and their collaborators. The proclamation serves to raise awareness about the Holocaust and encourages educational efforts to promote understanding and prevent future atrocities.",
    "link": "https://www.whitehouse.gov/presidential-actions/2025/04/days-of-remembrance-of-victims-of-the-holocaust-2025/"
  },
  {
    "title": "Proclamation for National Park Week 2025",
    "summary": "This proclamation acknowledges National Park Week, a designated time to recognize the natural beauty and historical significance of national parks in the United States. The events of this week will commence with a special observance of the 250th anniversary of the Battles of Lexington and Concord, marking the initial confrontations of the American Revolutionary War. The proclamation emphasizes the importance of preserving these parks for future generations.",
    "link": "https://www.whitehouse.gov/presidential-actions/2025/04/national-park-week-2025/"
  },
  {
    "title": "Executive Order on Preparing Americans for High-Paying Skilled Trade Jobs of the Future",
    "summary": "This Executive Order outlines the initiative by the President to enhance the skills of the American workforce in order to support the nation's reindustrialization efforts and facilitate economic growth. The goal is to equip workers with the necessary training and resources to produce high-quality products and adopt advanced technologies in their respective fields. The order emphasizes the importance of preparing Americans for skilled trade jobs that are expected to be in high demand in the future economy.",
    "link": "https://www.whitehouse.gov/presidential-actions/2025/04/preparing-americans-for-high-paying-skilled-trade-jobs-of-the-future/"
  }
]