[
  {
    "title": "Executive Order on Enhancing American Seafood Industry Competitiveness",
    "summary": "This Executive Order outlines actions aimed at improving the competitive position of the American seafood industry. It highlights the significance of the United States' extensive ocean resources, specifically focusing on over 4 million square miles of fishing grounds. The order calls for initiatives to enhance the sustainability and economic viability of the seafood sector, fostering job creation and supporting local fisheries through measured regulatory reforms and increased cooperation among federal, state, and local agencies.",
    "link": "https://www.whitehouse.gov/presidential-actions/2025/04/restoring-american-seafood-competitiveness/"
  },
  {
    "title": "Proclamation of the 250th Anniversary of the Battles of Lexington and Concord",
    "summary": "This proclamation commemorates the 250th anniversary of the Battles of Lexington and Concord, which were significant early conflicts in the American Revolutionary War. The proclamation recognizes the historical importance of these events and honors the memory of those who participated in the struggles for freedom during this pivotal time in American history.",
    "link": "https://www.whitehouse.gov/presidential-actions/2025/04/250th-anniversary-of-the-battles-of-lexington-and-concord/"
  },
  {
    "title": "Extension of Federal Hiring Freeze",
    "summary": "This memorandum from the President announces the extension of the hiring freeze for Federal civilian employees until July 15, 2025. It is intended to maintain the current hiring limits within the Executive Branch of the U.S. Government, impacting all executive departments and agencies during this period.",
    "link": "https://www.whitehouse.gov/presidential-actions/2025/04/extension-of-hiring-freeze/"
  },
  {
    "title": "Proclamation on the Management of Commercial Fishing in the Pacific Remote Islands Marine National Monument",
    "summary": "This proclamation addresses the management of commercial fishing activities within the Pacific Remote Islands Marine National Monument, which was originally established in 2009 and expanded in 2014. The proclamation outlines objectives related to fishing regulations in the area, aiming to balance commercial fishing interests with environmental conservation efforts. It presents a framework for how commercial fishing will be conducted in the region while adhering to existing environmental protections.",
    "link": "https://www.whitehouse.gov/presidential-actions/2025/04/unleashing-american-commercial-fishing-in-the-pacific/"
  },
  {
    "title": "Executive Order on Improving Federal Office Space Management",
    "summary": "This executive order outlines measures aimed at enhancing the efficiency and cost-effectiveness of federal office space management across various regions in the United States. The order emphasizes the importance of providing high-quality services to the American population, which is distributed over a diverse range of urban, suburban, and rural areas. The federal government is tasked with evaluating and reforming its office space utilization strategies to achieve better operational outcomes.",
    "link": "https://www.whitehouse.gov/presidential-actions/2025/04/restoring-common-sense-to-federal-office-space-management/"
  },
  {
    "title": "National Security and Economic Resilience Actions on Processed Critical Minerals",
    "summary": "This executive order outlines the policy for ensuring national security through economic resilience by utilizing Section 232 of the Trade Expansion Act of 1962. It highlights the importance of maintaining a strong economy and price stability as foundational elements for national defense. The order emphasizes the need for actions regarding processed critical minerals and derivative products to safeguard national interests and enhance economic stability.",
    "link": "https://www.whitehouse.gov/presidential-actions/2025/04/ensuring-national-security-and-economic-resilience-through-section-232-actions-on-processed-critical-minerals-and-derivative-products/"
  },
  {
    "title": "Executive Order on Reducing Prescription Drug Prices",
    "summary": "This executive order describes actions taken during the President's first term aimed at lowering prescription drug prices for American patients. It emphasizes the administration's commitment to creating policies that prioritize access to affordable medications. The order outlines the government's role in regulating drug prices and the intended impact of these measures on healthcare costs for individuals.",
    "link": "https://www.whitehouse.gov/presidential-actions/2025/04/lowering-drug-prices-by-once-again-putting-americans-first/"
  },
  {
    "title": "Enhancing Efficiency in Federal Procurement Practices",
    "summary": "This executive order aims to improve the efficiency and cost-effectiveness of federal procurement processes. Recognizing that the federal government is the largest purchaser of goods and services globally, the order addresses existing inefficiencies that make it challenging for businesses to engage with federal entities. The order emphasizes the need for reforms that streamline procurement activities, thereby facilitating better access and participation for suppliers.",
    "link": "https://www.whitehouse.gov/presidential-actions/2025/04/restoring-common-sense-to-federal-procurement/"
  },
  {
    "title": "Memorandum on Restrictions Regarding Social Security Benefits for Non-Citizens",
    "summary": "This memorandum addresses the prevention of non-citizens, specifically illegal aliens, from accessing benefits under the Social Security Act. The document outlines directives to various government officials including the Attorney General, Secretary of Labor, Secretary of Health and Human Services, Secretary of Homeland Security, Commissioner of Social Security, and the Inspector General of the Social Security Administration. It emphasizes the enforcement of existing laws, ensuring that eligibility criteria for Social Security benefits are strictly adhered to, particularly regarding the status of applicants.",
    "link": "https://www.whitehouse.gov/presidential-actions/2025/04/preventing-illegal-aliens-from-obtaining-social-security-act-benefits/"
  }
]