[
  {
    "title": "Directives for the Enhancement and Safety of Washington, D.C.",
    "summary": "This executive order outlines the goals and initiatives aimed at improving the safety, aesthetics, and overall quality of life in Washington, D.C. It emphasizes the city's unique status as the Federal capital and an emblematic site for all Americans, directing resources and planning towards making it a welcoming and secure environment for residents and visitors alike.",
    "link": "https://www.whitehouse.gov/presidential-actions/2025/03/making-the-district-of-columbia-safe-and-beautiful/"
  },
  {
    "title": "Proclamation on Adjusting Automobile and Automobile Parts Imports",
    "summary": "This proclamation addresses the findings from a Department of Commerce report regarding the effects of imports of passenger vehicles and light trucks on the U.S. national security. The report evaluates the impact of such imports, which include sedans, sport utility vehicles, crossover utility vehicles, minivans, cargo vans, and light trucks, on the economy. Based on this information, the proclamation outlines the intended adjustments to the importation of these vehicles and their parts to ensure the protection and enhancement of U.S. economic interests.",
    "link": "https://www.whitehouse.gov/presidential-actions/2025/03/adjusting-imports-of-automobiles-and-autombile-parts-into-the-united-states/"
  },
  {
    "title": "Presidential Pardon Granted to Devon Archer",
    "summary": "On this date, the President of the United States, Donald J. Trump, exercised his constitutional authority to grant a full and unconditional pardon to Devon Archer for specific offenses. This executive action is carried out under the provisions outlined in Article II, Section 2, Clause 1 of the U.S. Constitution, which empowers the President to issue pardons. The details of the offenses for which the pardon is granted were not specified.",
    "link": "https://www.whitehouse.gov/presidential-actions/2025/03/executive-grant-of-clemency-for-devon-archer/"
  }
]