[
  {
    "title": "Presidential Proclamation Designating National Day of Remembrance for Charlie Kirk",
    "summary": "A presidential proclamation issued on September 10, 2025 designates a National Day of Remembrance in response to the assassination of Charlie Kirk. The proclamation designates a national observance to honor Charlie Kirk's memory and to reflect on the incident and its impact. It specifies that appropriate national actions and acknowledgments accompany the observance and references the publication of the proclamation on the White House website.",
    "link": "https://www.whitehouse.gov/presidential-actions/2025/10/national-day-of-remembrance-for-charlie-kirk/"
  },
  {
    "title": "Proclamation on the 250th Anniversary of the Founding of the United States Navy",
    "summary": "This document is a presidential proclamation commemorating the 250th anniversary of the founding of the United States Navy. It notes the Navy's origins in actions by the Second Continental Congress and its evolution into the nation's maritime armed force. The proclamation acknowledges the Navy's historical contributions to national defense and security and designates appropriate observances and recognition by federal entities and the public in connection with the anniversary.",
    "link": "https://www.whitehouse.gov/presidential-actions/2025/10/250th-anniversary-of-the-founding-of-the-united-states-navy/"
  },
  {
    "title": "Proclamation on General Pulaski Memorial Day, 2025",
    "summary": "A presidential proclamation by the President of the United States designating General Casimir Pulaski Memorial Day for 2025. The proclamation describes Pulaski as a brigadier general who joined the American Revolutionary War from Poland, commonly referred to as the Soldier of Liberty and the Father of the American Cavalry, and it notes the importance of commemorating his contributions to American independence and to the development of the United States Cavalry, inviting reflections on his legacy and the service of Polish-born Americans in support of the Nation.",
    "link": "https://www.whitehouse.gov/presidential-actions/2025/10/general-pulaski-memorial-day-2025/"
  },
  {
    "title": "Proclamation by the President Declaring National Breast Cancer Awareness Month",
    "summary": "A presidential proclamation recognizing National Breast Cancer Awareness Month. The document notes the impact of breast cancer on Americans and their families, acknowledges the resilience and courage of those affected, and states the President’s commitment to addressing breast cancer during the observance period.",
    "link": "https://www.whitehouse.gov/presidential-actions/2025/10/presidential-message-on-national-breast-cancer-awareness-month/"
  }
]