[
  {
    "title": "Nomination Sent to Senate: William J. Crain and Alexander C. Van Hook for U.S. District Judgeships in Louisiana, and Brian Barber for U.S. Marshal in the Middle District of Louisiana",
    "summary": "The President has transmitted to the Senate nominations for federal positions in Louisiana. William J. Crain, of Louisiana, is nominated to be United States District Judge for the Eastern District of Louisiana, to fill the vacancy created by the retirement of Eldon E. Fallon. Alexander C. Van Hook, of Louisiana, is nominated to be United States District Judge for the Western District of Louisiana, to fill the vacancy created by the retirement of Elizabeth Erny Foote. Brian Barber, of Louisiana, is nominated to be United States Marshal for the Middle District of Louisiana. These nominations are presented to the Senate for consideration and confirmation.",
    "link": "https://www.whitehouse.gov/presidential-actions/2025/10/nomination-sent-to-the-senate-f090/"
  },
  {
    "title": "Proclamation Designating October 2025 as National Energy Dominance Month",
    "summary": "This presidential proclamation designates October 2025 as National Energy Dominance Month and describes the role of domestic energy resources in the nation's economy and energy security, referencing resources such as oil, coal, minerals, and natural gas and the historical significance of energy abundance.",
    "link": "https://www.whitehouse.gov/presidential-actions/2025/10/national-energy-dominance-month-2025/"
  },
  {
    "title": "Proclamation: National Cybersecurity Awareness Month, 2025",
    "summary": "This Presidential Proclamation designates October 2025 as National Cybersecurity Awareness Month. Issued by the President, it outlines a renewed commitment to strengthening the United States' cybersecurity to improve the safety and well-being of Americans, defend national sovereignty, and protect the rights of citizens. The proclamation notes that recent advancements in cybersecurity have introduced new threats to national defense and critical infrastructure. It urges government agencies, private sector entities, and the public to participate in awareness activities and to promote resilience, threat awareness, risk mitigation, and collaboration in response to evolving cyber threats.",
    "link": "https://www.whitehouse.gov/presidential-actions/2025/10/national-cybersecurity-awareness-month-2025/"
  },
  {
    "title": "Proclamation Adjusting Imports of Medium- and Heavy-Duty Vehicles, Medium- and Heavy-Duty Vehicle Parts, and Buses Into the United States",
    "summary": "This proclamation authorizes adjustments to the importation of medium- and heavy-duty vehicles, their parts, and buses into the United States based on the findings of a Department of Commerce investigation into the impact of these imports on national security. The President acted following the Secretary of Commerce's transmission of a report on the investigation to the President approximately three weeks earlier.",
    "link": "https://www.whitehouse.gov/presidential-actions/2025/10/adjusting-imports-of-medium-and-heavy-duty-vehicles-medium-and-heavy-duty-vehicle-parts-and-buses-into-the-united-states/"
  },
  {
    "title": "Use of Available Department of War Funds for Military Pay and Allowances During a Lapse in Annual Appropriations",
    "summary": "This memorandum, addressed to the Secretary of War and the Director of the Office of Management and Budget, directs the Department of War to utilize funds that are available to cover military pay and allowances during a lapse in annual appropriations. The directive clarifies the authority to apply existing funds to maintain payment for military personnel and related allowances when standard annual appropriations are not in effect, and outlines the scope and implementation considerations for applying such funds during funding gaps.",
    "link": "https://www.whitehouse.gov/presidential-actions/2025/10/national-security-presidential-memorandum-nspm-8/"
  },
  {
    "title": "Executive Order: Ensuring Continued Accountability in Federal Hiring",
    "summary": "This presidential action, issued under the President's constitutional and statutory authority, describes the purpose and background of the order. It notes that within eight months the administration reduced the size of the federal workforce and aimed to improve the efficiency of government service delivery, while prioritizing hiring related to national security. The document establishes the policy objective of ensuring continued accountability in federal hiring and outlines the scope of the executive action to apply these accountability measures across federal agencies.",
    "link": "https://www.whitehouse.gov/presidential-actions/2025/10/ensuring-continued-accountability-in-federal-hiring/"
  },
  {
    "title": "Declaration for Enduring Peace and Prosperity Related to the Trump Peace Agreement",
    "summary": "The White House announces a declaration, titled The Trump Declaration for Enduring Peace and Prosperity, in which multiple signatories commit to implementing the Trump Peace Agreement. The document describes the agreement as ending more than two years of hardship and loss in the region and establishing a framework aimed at security, peace, and prosperity. It conveys support for President Trump and outlines the goals of enduring peace and regional prosperity as part of the declared commitment.",
    "link": "https://www.whitehouse.gov/presidential-actions/2025/10/the-trump-declaration-for-enduring-peace-and-prosperity/"
  }
]