[
  {
    "title": "Executive Order Modifying the Scope of Tariffs on the Government of Brazil",
    "summary": "The action asserts presidential authority under the International Emergency Economic Powers Act, the National Emergencies Act, and section 604 of the Trade Act of 1974 to modify the scope of tariffs applicable to imports from the Government of Brazil. The order specifies that federal agencies implement the revised tariff coverage and rates, and directs administrative steps necessary to enforce the changes. The document provides the legal basis for the modification and defines the scope and administrative procedures to carry out the tariffs adjustment, effective upon issuance unless stated otherwise.",
    "link": "https://www.whitehouse.gov/presidential-actions/2025/11/modifying-the-scope-of-tariffs-on-the-government-of-brazil/"
  },
  {
    "title": "Presidential Action Modifying the Scope of the Reciprocal Tariff for Certain Agricultural Products",
    "summary": "This executive action revises the scope of the United States reciprocal tariff as it applies to designated agricultural products. Issued under authorities including the International Emergency Economic Powers Act, the National Emergencies Act, and section 604 of the Trade Act of 1974, the order adjusts which agricultural products are covered by the reciprocal tariff program and may modify related coverage, exemptions, or administration. The action describes the specific changes to product coverage and the implementation details as provided in the order.",
    "link": "https://www.whitehouse.gov/presidential-actions/2025/11/modifying-the-scope-of-the-reciprocal-tariff-with-respect-to-certain-agricultural-products/"
  },
  {
    "title": "Presidential Proclamation on Veterans Day, 2025",
    "summary": "Declares November 11, 2025 as Veterans Day, recognizing the enduring contributions and sacrifices of United States military veterans in defense of the nation, the preservation of democracy, and the maintenance of the Republic. The proclamation invites participation in appropriate ceremonies and observances by federal, state, and local governments, educational institutions, organizations, and citizens, and reiterates the nation's commitment to supporting veterans through programs and policies that aid their well-being, transition to civilian life, and access to benefits.",
    "link": "https://www.whitehouse.gov/presidential-actions/2025/11/veterans-day-2025/"
  },
  {
    "title": "Proclamation on the 250th Anniversary of the Founding of the United States Marine Corps",
    "summary": "This presidential proclamation commemorates the 250th anniversary of the founding of the United States Marine Corps and documents its historical role in national defense and military service. It describes the Marine Corps as a force characterized by courage, discipline, and unity, and it recounts the Corps’ contributions from the Republic’s founding to contemporary operations. The proclamation affirms the importance of honoring service members, veterans, and their families and outlines observances and actions by the federal government to recognize the Marine Corps’ heritage and ongoing service to the nation.",
    "link": "https://www.whitehouse.gov/presidential-actions/2025/11/250th-anniversary-of-the-founding-of-the-united-states-marine-corps/"
  },
  {
    "title": "Nomination of Jared Isaacman to be Administrator of the National Aeronautics and Space Administration",
    "summary": "The White House announced the nomination of Jared Isaacman, a resident of Pennsylvania, to serve as Administrator of the National Aeronautics and Space Administration, succeeding Bill Nelson who has resigned. The nomination has been sent to the Senate for confirmation.",
    "link": "https://www.whitehouse.gov/presidential-actions/2025/11/nomination-sent-to-the-senate-7385/"
  }
]