[
  {
    "title": "Executive Order on Addressing Competition Between Large-Scale Investors and Individual Homebuyers in the Single-Family Residential Real Estate Market",
    "summary": "This executive order directs federal agencies to review and address practices in the residential real estate market that may enable large-scale investors to acquire single-family homes at a rate that reduces availability for individual homebuyers. The policy seeks to promote fair access to homeownership by individual buyers, assess regulatory and programmatic actions across relevant agencies, and consider measures that would increase transparency, oversight, and accountability for investor activity in the housing market. The order emphasizes collaboration with state, local, and tribal authorities as well as housing finance and consumer protection agencies, and it requires reporting on findings and potential actions consistent with applicable laws.",
    "link": "https://www.whitehouse.gov/presidential-actions/2026/01/stopping-wall-street-from-competing-with-main-street-homebuyers/"
  },
  {
    "title": "Proclamation: National Day of Patriotic Devotion, 2026",
    "summary": "The President proclaims a National Day of Patriotic Devotion for 2026, designating a day for observance by the American people. The proclamation references a pledge made one year earlier to reclaim national sovereignty, restore safety, rebalance the scales of justice, and rebuild the country toward greater pride and prosperity, and it outlines the intended observances and any related actions by executive branch agencies.",
    "link": "https://www.whitehouse.gov/presidential-actions/2026/01/national-day-of-patriotic-devotion-2026/"
  },
  {
    "title": "Proclamation by the President on Religious Freedom Day, 2026",
    "summary": "The proclamation designates Religious Freedom Day in 2026 to recognize the United States’ longstanding commitment to protecting the free exercise of religion and the right to worship according to individual conscience. It emphasizes the First Amendment and founding principles as the basis for religious liberty, highlights the inclusive nature of the nation's religious landscape, and invites the public and government institutions to reflect on and uphold religious liberty. The document underscores the historical significance of religious freedom and encourages education, public service, and actions that support the free practice of religion for all Americans.",
    "link": "https://www.whitehouse.gov/presidential-actions/2026/01/religious-freedom-day-2026/"
  },
  {
    "title": "Proclamation Adjusting Imports of Semiconductors, Semiconductor Manufacturing Equipment, and Their Derivative Products into the United States",
    "summary": "A proclamation issued by the President under the authority of the Section 232 national security framework adjusts the import regime for semiconductors, semiconductor manufacturing equipment, and their derivative products entering the United States. This action follows a report transmitted by the Secretary of Commerce on December 22, 2025 detailing the effects of these imports on national security. The proclamation aims to address identified national security considerations related to supply chain resilience, production capacity, and the competitive dynamics of the semiconductor sector by altering the flow of these goods into the United States.",
    "link": "https://www.whitehouse.gov/presidential-actions/2026/01/adjusting-imports-of-semiconductors-semiconductor-manufacturing-equipment-and-their-derivative-products-into-the-united-states/"
  },
  {
    "title": "Establishment of a Second Emergency Board to Investigate Disputes Between the Long Island Rail Road Company and Its Employees Represented by Certain Labor Organizations",
    "summary": "Under the Railway Labor Act, the President established a Second Emergency Board to investigate disputes between the Long Island Rail Road Company and certain of its employees represented by labor organizations, including the Transportation Communications Union, the Brotherhood of Locomotive Engineers and Trainmen, the Brotherhood of Railroad Signalmen, the International Association of Machinists and Aerospace Workers, and the International Brotherhood of Electrical Workers. The Board is authorized to examine the issues in dispute, collect relevant evidence, hear testimony from the parties, and report its findings and recommendations to facilitate a resolution and to help prevent work stoppages that could affect railroad operations.",
    "link": "https://www.whitehouse.gov/presidential-actions/2026/01/establishing-a-second-emergency-board-to-investigate-disputes-between-the-long-island-rail-road-company-and-certain-of-its-employees-represented-by-certain-labor-organizations/"
  },
  {
    "title": "Proclamation on Adjusting Imports of Processed Critical Minerals and Their Derivative Products into the United States",
    "summary": "This proclamation, issued by the President, states that on October 24, 2025, the Secretary of Commerce transmitted to the President a report on a section 232 investigation into the effects of imports of processed critical minerals and their derivative products (PCMDPs) on U.S. national security. Based on that report, the President announces adjustments to imports of PCMDPs and their derivative products into the United States and directs the relevant executive agencies to implement the adjustments in accordance with applicable law.",
    "link": "https://www.whitehouse.gov/presidential-actions/2026/01/adjusting-imports-of-processed-critical-minerals-and-their-derivative-products-into-the-united-states/"
  },
  {
    "title": "Executive Order on Safeguarding Venezuelan Oil Revenue for the Benefit of the American and Venezuelan People",
    "summary": "This presidential action asserts authority under the International Emergency Economic Powers Act and the National Emergencies Act, as well as 3 U.S.C. 301, to implement measures intended to safeguard revenue derived from Venezuelan oil. The stated objective of the order is to protect this revenue and ensure that its use benefits both the American and Venezuelan peoples. The document sets forth the legal basis and scope for the executive branch's actions to enforce these safeguarding measures.",
    "link": "https://www.whitehouse.gov/presidential-actions/2026/01/safeguarding-venezuelan-oil-revenue-for-the-good-of-the-american-and-venezuelan-people/"
  }
]