[
  {
    "title": "Proclamation Designating Anti-Communism Week, 2025",
    "summary": "A proclamation issued by the President designates Anti-Communism Week for 2025 for national observance. The document notes the historical devastation attributed to communist ideologies, stating that regimes based on communism have caused extensive suffering and more than 100 million deaths. It invites appropriate observances, educational efforts, and reflection on these events, and reiterates the United States' commitment to democratic principles and human rights.",
    "link": "https://www.whitehouse.gov/presidential-actions/2025/11/anti-communism-week-2025/"
  },
  {
    "title": "Nominations Sent to the Senate for Daniel E. Burrows, Stevan Pearce, and Douglas Weaver",
    "summary": "The White House announced nominations sent to the Senate to fill three positions: Daniel E. Burrows to be Assistant Attorney General, succeeding Aaron Reitz who resigned; Stevan Pearce to be Director of the Bureau of Land Management, succeeding Tracy Stone-Manning who resigned; and Douglas Weaver to be a Commissioner of the Nuclear Regulatory Commission for the remainder of the term expiring June 30. The communication indicates these nominations were forwarded to the Senate as part of presidential actions.",
    "link": "https://www.whitehouse.gov/presidential-actions/2025/11/nominations-sent-to-the-senate-099e/"
  },
  {
    "title": "Nominations to the Senate: Michael Selig to be Chairman and Commissioner of the Commodity Futures Trading Commission; Withdrawal of Joel Rayburn",
    "summary": "The White House announced nominations to the Senate for the Commodity Futures Trading Commission (CFTC): Michael Selig, of Florida, to serve as Chairman (to succeed Rostin Behnam) and to be a Commissioner (term expiring April 13, 2029, to succeed Christy Goldsmith Romero). The announcement also notes that a withdrawal has been sent to the Senate for Joel Rayburn.",
    "link": "https://www.whitehouse.gov/presidential-actions/2025/10/nominations-and-withdrawal-sent-to-the-senate/"
  },
  {
    "title": "Proclamation on Regulatory Relief for Certain Stationary Sources to Promote American Mineral Security",
    "summary": "The proclamation emphasizes the strategic importance of copper to the United States' energy, defense, and manufacturing sectors and notes the necessity of maintaining and expanding domestic copper smelting capacity to reduce reliance on foreign supply chains. It outlines regulatory relief for certain stationary sources aimed at promoting American mineral security, including the scope and objectives of the relief measures and their anticipated impact on domestic mineral production infrastructure.",
    "link": "https://www.whitehouse.gov/presidential-actions/2025/10/regulatory-relief-for-certain-stationary-sources-to-promote-american-mineral-security/"
  },
  {
    "title": "Nomination of Jennifer Wicks McNamara to be United States Ambassador to the Socialist Republic of Vietnam",
    "summary": "Jennifer Wicks McNamara, a Virginia resident, has been nominated to serve as the United States Ambassador Extraordinary and Plenipotentiary to the Socialist Republic of Vietnam. The White House announced that the nomination has been sent to the Senate for its consideration, as indicated by the Nomination Sent to the Senate post on the White House website.",
    "link": "https://www.whitehouse.gov/presidential-actions/2025/10/nomination-sent-to-the-senate/"
  }
]