[
  {
    "title": "Investigation into Illegal Political Contributions by Straw Donors and Foreign Nationals",
    "summary": "This memorandum outlines the directive for a comprehensive investigation into instances of unlawful political contributions, specifically focusing on the use of 'straw donors'—individuals who contribute to campaigns using another person's name—and contributions made by foreign nationals. These practices are strictly prohibited under federal laws, specifically sections 30121 and 30122, which aim to ensure transparency and integrity in the electoral process. The Secretary of the Treasury, the Attorney General, and the Counsel to the President have been tasked with overseeing this investigation to identify violations and enforce compliance with the law.",
    "link": "https://www.whitehouse.gov/presidential-actions/2025/04/investigation-into-unlawful-straw-donor-and-foreign-contributions-in-american-elections/"
  },
  {
    "title": "Executive Order on Enhancing U.S. Leadership in Offshore Mineral Resources",
    "summary": "This executive order outlines the United States' commitment to maintaining its leadership in deep sea science and technology, as well as the exploration and utilization of seabed mineral resources. The order highlights the national security and economic interests associated with these areas, emphasizing the importance of strategic action to enhance the U.S. position in offshore mineral resource development. It also delineates actions that may be taken to strengthen the country's capabilities in this regard.",
    "link": "https://www.whitehouse.gov/presidential-actions/2025/04/unleashing-americas-offshore-critical-minerals-and-resources/"
  },
  {
    "title": "Enhancing the Probationary Period for Federal Employees",
    "summary": "This executive order aims to improve the effectiveness of the Federal workforce by defining and strengthening the probationary period for new federal employees. Through this measure, the order seeks to ensure that the federal workforce is characterized by high quality, efficiency, and a commitment to serving the public interest. The provisions outlined in this order are designed to support the development of a dedicated workforce that meets the needs and expectations of the American people.",
    "link": "https://www.whitehouse.gov/presidential-actions/2025/04/strengthening-probationary-periods-in-the-federal-service/"
  }
]