[
  {
    "title": "Amendment to Duties Related to Synthetic Opioid Supply Chain in China for Low-Value Imports",
    "summary": "This executive order involves the further amendment of duties targeting the synthetic opioid supply chain originating from the People's Republic of China, specifically as it pertains to low-value imports. The provisions are enacted under the authority of various U.S. laws aimed at regulating international trade and addressing economic emergencies, including the International Emergency Economic Powers Act and the National Emergencies Act. This amendment seeks to strengthen U.S. measures against the importation of synthetic opioids, a key aspect of the ongoing efforts to manage and mitigate the impacts of drug-related issues.",
    "link": "https://www.whitehouse.gov/presidential-actions/2025/04/further-amendment-to-duties-addressing-the-synthetic-opioid-supply-chain-in-the-peoples-republic-of-china-as-applied-to-low-value-imports/"
  },
  {
    "title": "Implementation of Reciprocal Tariffs to Address U.S. Goods Trade Deficits",
    "summary": "This executive order establishes the authority to impose reciprocal tariffs on imports in response to trade practices that are identified as contributing to significant and ongoing trade deficits in goods for the United States. The order cites several legal frameworks that support this action, including the International Emergency Economic Powers Act and the National Emergencies Act. The intended outcome of these measures is to adjust trade conditions in a manner that rectifies the trade imbalance by encouraging fair trading practices among international partners.",
    "link": "https://www.whitehouse.gov/presidential-actions/2025/04/regulating-imports-with-a-reciprocal-tariff-to-rectify-trade-practices-that-contribute-to-large-and-persistent-annual-united-states-goods-trade-deficits/"
  },
  {
    "title": "Proclamation for World Autism Awareness Day, 2025",
    "summary": "This proclamation recognizes World Autism Awareness Day, highlighting the experiences of individuals living with autism spectrum disorder (ASD) in the United States. It emphasizes the resilience and determination demonstrated by those on the autism spectrum and acknowledges their contributions to society. The proclamation also expresses appreciation from the President and the First Lady for the efforts made towards understanding and supporting individuals with ASD.",
    "link": "https://www.whitehouse.gov/presidential-actions/2025/04/world-autism-awareness-day-2025/"
  },
  {
    "title": "Executive Order on Addressing Unfair Practices in the Live Entertainment Industry",
    "summary": "This executive order aims to address and mitigate issues associated with unfair practices in the live concert and entertainment market. The directive identifies concerns regarding middlemen currently involved in the industry, impacting artists and their ability to engage directly with audiences. The order outlines measures to promote fair practices, enhance transparency, and ensure the integrity of the live entertainment sector, ultimately supporting artists and improving their access to stakeholders without undue interference from intermediaries.",
    "link": "https://www.whitehouse.gov/presidential-actions/2025/03/combating-unfair-practices-in-the-live-entertainment-market/"
  },
  {
    "title": "Establishment of the United States Investment Accelerator",
    "summary": "This executive order outlines the establishment of the United States Investment Accelerator, aimed at enhancing the efficiency of the regulatory processes involved in the development and operation of companies. The order recognizes the significance of the U.S. economy and addresses the challenges posed by slow and complex regulations, emphasizing the need for a streamlined approach to foster economic growth and investment.",
    "link": "https://www.whitehouse.gov/presidential-actions/2025/03/establishing-the-united-states-investment-accelerator/"
  }
]