[
  {
    "title": "Proclamation Imposing a Temporary Import Surcharge to Address Fundamental International Payments Problems",
    "summary": "This presidential proclamation asserts authority under the Constitution and specified provisions of title 3, United States Code, to impose a temporary surcharge on imports. The declared objective of the measure is to address fundamental issues in international payments. The document sets forth the legal basis, scope, and purpose of the temporary import surcharge as a policy instrument intended to mitigate international payments problems.",
    "link": "https://www.whitehouse.gov/presidential-actions/2026/02/imposing-a-temporary-import-surcharge-to-address-fundamental-international-payments-problems/"
  },
  {
    "title": "Continuation of Suspension of Duty-Free De Minimis Treatment for All Countries",
    "summary": "This presidential action extends the policy that suspends duty-free de minimis treatment for shipments from all countries. It relies on authorities under the International Emergency Economic Powers Act, the National Emergencies Act, and section 604 of the Trade Act of 1974. The action directs relevant executive agencies to administer and enforce the suspension and to implement necessary administrative measures to maintain the policy. The order indicates that the suspension remains in effect under these authorities and may be altered by future proclamation or statute.",
    "link": "https://www.whitehouse.gov/presidential-actions/2026/02/continuing-the-suspension-of-duty-free-de-minimis-treatment-for-all-countries/"
  },
  {
    "title": "Executive Order Terminating Certain Tariff Actions",
    "summary": "This executive order terminates certain tariff actions previously imposed by the United States and directs federal agencies to implement the termination, unwind related authorities and measures, and coordinate any necessary administrative steps to effectuate the withdrawal of these tariffs. The order cites authority under the International Emergency Economic Powers Act, the National Emergencies Act, and section 604 of the Trade Act of 1974 as the legal basis for the action. It instructs relevant agencies to take the necessary steps to discontinue the tariffs, ensure appropriate notifications to affected parties, and provide reports detailing implementation and any required regulatory changes.",
    "link": "https://www.whitehouse.gov/presidential-actions/2026/02/ending-certain-tariff-actions/"
  },
  {
    "title": "Executive Order Promoting National Defense by Ensuring an Adequate Supply of Elemental Phosphorus and Glyphosate-Based Herbicides",
    "summary": "This executive order, issued under the President's constitutional and statutory authorities including the Defense Production Act of 1950 (as amended) and Section 301 of Title 3, United States Code, establishes policy to promote national defense by ensuring an adequate domestic supply of elemental phosphorus and glyphosate-based herbicides. It references Section 1's policy and findings and directs relevant federal agencies to assess supply chains for these materials and to take appropriate actions under the Defense Production Act to secure and improve their production, procurement, and distribution as required to support national defense.",
    "link": "https://www.whitehouse.gov/presidential-actions/2026/02/promoting-the-national-defense-by-ensuring-an-adequate-supply-of-elemental-phosphorus-and-glyphosate-based-herbicides/"
  },
  {
    "title": "Presidential Proclamation Honoring George Washington's Birthday, 2026",
    "summary": "This presidential proclamation commemorates George Washington, noting his leadership in the American Revolution and his significance as a foundational figure in American liberty. Issued on Washington's Birthday, the proclamation also marks the 250th anniversary of American independence and expresses the nation's tribute to Washington's contributions to the founding of the United States.",
    "link": "https://www.whitehouse.gov/presidential-actions/2026/02/president-george-washingtons-birthday-2026/"
  },
  {
    "title": "Modification of Import Duties to Address Threats Posed by the Government of the Russian Federation",
    "summary": "Under the authority vested in the President by the Constitution and by U.S. law, including the International Emergency Economic Powers Act, the National Emergencies Act, and section 604 of the Trade Act of 1974, the President issued a measure to modify import duties on goods from the Russian Federation. The action uses emergency powers and trade authorities to adjust tariff rates with the aim of addressing threats to the United States arising from the Government of the Russian Federation. The proclamation applies changes to duties on Russian-origin imports and is intended to address national security and foreign policy concerns related to Russia.",
    "link": "https://www.whitehouse.gov/presidential-actions/2026/02/modifying-duties-to-address-threats-to-the-united-states-by-the-government-of-the-russian-federation-04b2/"
  },
  {
    "title": "Executive Order Establishing a United States Arms Transfer Strategy",
    "summary": "This executive action directs the development and implementation of a comprehensive strategy for transferring defense articles and services, with emphasis on leveraging the United States' domestic military manufacturing base to advance its position in international arms exports. The order articulates a purpose to maximize the competitive advantages of American-made military equipment in export markets and to align arms transfer activities with national security and economic objectives.",
    "link": "https://www.whitehouse.gov/presidential-actions/2026/02/establishing-an-america-first-arms-transfer-strategy/"
  },
  {
    "title": "Executive Order Protecting the National Security and Welfare of the United States and Its Citizens from Criminal Actors and Other Public Safety Threats",
    "summary": "This executive order asserts a policy to safeguard the national security and welfare of the United States and its citizens from criminal actors and other public safety threats. It cites presidential authority including the Constitution and 6 U.S.C. 122(a)(2) and directs federal agencies to coordinate and implement measures aimed at mitigating these threats to public safety and national welfare.",
    "link": "https://www.whitehouse.gov/presidential-actions/2026/02/protecting-the-national-security-and-welfare-of-the-united-states-and-its-citizens-from-criminal-actors-and-other-public-safety-threats/"
  }
]