[
  {
    "title": "Proclamation on Bill of Rights Day, 2025",
    "summary": "This presidential proclamation designates Bill of Rights Day, 2025, and commemorates the ratification of the Bill of Rights. It reflects on the nation's origins in liberty, the protection of individual rights, and the enduring commitments to sovereignty, justice, and self-determination. The document emphasizes the obligation to uphold the constitutional rights guaranteed to all citizens, invites reflection on the responsibilities of citizenship, and encourages civic engagement and education about the rights and liberties guaranteed by the Constitution.",
    "link": "https://www.whitehouse.gov/presidential-actions/2025/12/bill-of-rights-day-2025/"
  },
  {
    "title": "Executive Order Designating Fentanyl as a Weapon of Mass Destruction",
    "summary": "This executive action designates illicit fentanyl as a weapon of mass destruction and outlines the purpose and policy associated with this designation. The document notes that illicit fentanyl is closer to a chemical weapon than a narcotic and provides an illustration using a small quantity to emphasize its potential danger.",
    "link": "https://www.whitehouse.gov/presidential-actions/2025/12/designating-fentanyl-as-a-weapon-of-mass-destruction/"
  },
  {
    "title": "Executive Order Addressing Foreign-Owned and Politically Motivated Proxy Advisory Firms",
    "summary": "This executive order asserts the President's authority to address the influence of proxy advisory firms on U.S. investor policy. It identifies two foreign-owned firms, Institutional Shareholder Services Inc. and Glass, Lewis & Co., LLC, as playing a significant role in shaping policies and priorities affecting American investors. The document presents the purpose of protecting American investors from foreign-owned and politically motivated proxy advisors and indicates that applicable federal agencies will be directed to evaluate the influence of such advisory firms and to undertake actions consistent with safeguarding investor interests. The text references the initial Section 1. Purpose, signaling a formal framework for addressing this issue and establishing the policy objective within the executive branch.",
    "link": "https://www.whitehouse.gov/presidential-actions/2025/12/protecting-american-investors-from-foreign-owned-and-politically-motivated-proxy-advisors/"
  },
  {
    "title": "Executive Order Establishing a National Policy Framework for Artificial Intelligence",
    "summary": "This executive order establishes a national policy framework for artificial intelligence, directing federal agencies to advance United States leadership in AI to support national security, economic security, and competitive standing across multiple domains. It asserts authority under the Constitution and applicable laws and cites Executive Order 14179, dated January 23, as a basis for coordinating policy actions. The order states the purpose of consolidating a national AI strategy and guides development, procurement, standards, governance, and oversight of AI technologies, aiming to align federal efforts and promote secure and responsible use of AI across government and critical sectors.",
    "link": "https://www.whitehouse.gov/presidential-actions/2025/12/eliminating-state-law-obstruction-of-national-artificial-intelligence-policy/"
  },
  {
    "title": "Proclamation on National Pearl Harbor Remembrance Day, 2025",
    "summary": "This proclamation designates December 7, 2025, as National Pearl Harbor Remembrance Day. It recalls the attack on Pearl Harbor, Hawaii, on December 7, 1941, and honors the lives lost, the service of military personnel, veterans, and first responders who defended the Nation. The proclamation invites Americans to observe the day with appropriate ceremonies and moments of remembrance and to reflect on the impact of that day on United States history and on the country’s commitment to democracy and freedom.",
    "link": "https://www.whitehouse.gov/presidential-actions/2025/12/national-pearl-harbor-remembrance-day-2025-17fc/"
  },
  {
    "title": "Presidential Memorandum: Aligning United States Core Childhood Vaccine Recommendations with Best Practices from Peer-Developed Countries",
    "summary": "This memorandum directs the Secretary of Health and Human Services and the Director of the Centers for Disease Control and Prevention to align the United States core childhood vaccination recommendations with the best practices used by peer-developed countries. It references the January 2025 decision to vaccinate all children for 18 diseases, including COVID-19, and directs an assessment of the current vaccination schedule, criteria, and implementation processes to harmonize U.S. recommendations with international standards. The memorandum assigns responsibility for evaluating vaccine safety, effectiveness, and program administration, and calls for coordinated reporting on proposed adjustments and timelines for implementation.",
    "link": "https://www.whitehouse.gov/presidential-actions/2025/12/aligning-united-states-core-childhood-vaccine-recommendations-with-best-practices-from-peer-developed-countries/"
  }
]