[
  {
    "title": "Executive Order on Continuance of the Federal Emergency Management Agency Review Council",
    "summary": "This executive order continues the Federal Emergency Management Agency Review Council, a federal advisory committee created to provide independent advice on matters related to the Federal Emergency Management Agency (FEMA). The order is issued under the authority of the Constitution and applicable statutes, including title 5, United States Code, chapter 10 (the Federal Advisory Committee Act), and specifies the council's continuation as established by a prior executive action. The order directs the council to continue its functions as set forth in the enabling action.",
    "link": "https://www.whitehouse.gov/presidential-actions/2026/01/continuance-of-the-federal-emergency-management-agency-review-council/"
  },
  {
    "title": "Proclamation Designating Martin Luther King, Jr., Federal Holiday for 2026",
    "summary": "This presidential proclamation designates the Martin Luther King, Jr., Federal Holiday for the year 2026. It acknowledges Reverend Dr. Martin Luther King, Jr.'s commitment to justice and equality, references the principles of the Declaration of Independence, and renews the nation's pledge to realize the American promise while observing the holiday in 2026.",
    "link": "https://www.whitehouse.gov/presidential-actions/2026/01/martin-luther-king-jr-federal-holiday-2026/"
  },
  {
    "title": "Nominations Sent to the Senate for United States Director of the African Development Bank and General Counsel of the Federal Labor Relations Authority",
    "summary": "The White House released information announcing nominations to the Senate for several positions. The slate includes Ademola Adewale-Sadik of New York to serve a five-year term as United States Director of the African Development Bank, succeeding Oren E. Whyche-Shaw, and Charlton Allen of North Carolina to serve a five-year term as General Counsel of the Federal Labor Relations Authority, succeeding Julia Akins Clark. The release also references additional nominees, including Matthew Anderson, with more nominations implied but not fully listed in the excerpt. The full details are provided in the linked White House press release.",
    "link": "https://www.whitehouse.gov/presidential-actions/2026/01/nominations-sent-to-the-senate-078c/"
  }
]