[
  {
    "title": "Proclamation on the 250th Anniversary of the Founding of the United States Navy",
    "summary": "This presidential proclamation marks the 250th anniversary of the founding of the United States Navy, tracing its origins to actions taken by the Second Continental Congress during the American Revolutionary era. It describes the Navy's development into a national maritime force and outlines its ongoing role in defending the nation's interests at sea. The proclamation acknowledges the historical significance of the Navy and recognizes the contributions of current and former Navy personnel and civilian staff in service to the country.",
    "link": "https://www.whitehouse.gov/presidential-actions/2025/10/250th-anniversary-of-the-founding-of-the-united-states-navy/"
  },
  {
    "title": "Proclamation on General Pulaski Memorial Day, 2025",
    "summary": "This presidential proclamation designates General Casimir Pulaski Memorial Day for 2025 and honors Casimir Pulaski, a Polish nobleman who traveled to America in 1777 to support the fight for independence. It notes Pulaski's leadership as a brigadier general and his lasting legacy as a pioneer of American cavalry, and it invites observance of the day with appropriate ceremonies and actions recognizing his contributions to the American cause and the founding of the U.S. military.",
    "link": "https://www.whitehouse.gov/presidential-actions/2025/10/general-pulaski-memorial-day-2025/"
  },
  {
    "title": "Presidential Proclamation on National Breast Cancer Awareness Month",
    "summary": "This document is a proclamation issued by the President recognizing National Breast Cancer Awareness Month. It notes that breast cancer affects many Americans and their families and acknowledges the resilience and courage of those affected. The proclamation states the President’s reaffirmation of the administration’s commitment to addressing breast cancer and supporting efforts during the observance of National Breast Cancer Awareness Month.",
    "link": "https://www.whitehouse.gov/presidential-actions/2025/10/presidential-message-on-national-breast-cancer-awareness-month/"
  },
  {
    "title": "Nomination of Lee Lipton to be Ambassador Extraordinary and Plenipotentiary of the United States to the Republic of the Philippines",
    "summary": "The White House announced that Lee Lipton of Florida has been nominated to serve as the United States Ambassador Extraordinary and Plenipotentiary to the Republic of the Philippines. The nomination has been sent to the Senate for confirmation as part of a routine batch of nominations reported by the White House.",
    "link": "https://www.whitehouse.gov/presidential-actions/2025/10/nominations-sent-to-the-senate-85f4/"
  },
  {
    "title": "Decision of the President Approving AIDEA Ambler Road Appeal Under ANILCA Section 1106(a) and Approving the 2016 Revised Consolidated Application for the Ambler Road Project",
    "summary": "The President approves the appeal filed by the Alaska Industrial Development and Export Authority on June 6, 2025 under section 1106(a) of the Alaska National Interest Lands Conservation Act. The decision also approves AIDEA’s 2016 revised consolidated application for the Ambler Road transportation system. The reasons for the approval are stated in the accompanying statement of reasons linked to the decision.",
    "link": "https://www.whitehouse.gov/presidential-actions/2025/10/decision-of-the-president-and-statement-of-reasons-on-2025-ambler-road-appeal/"
  }
]