[
  {
    "title": "Thanksgiving Day, 2025 Proclamation",
    "summary": "The President issues a proclamation designating Thanksgiving Day 2025 as a day of national observance. The document cites the historical origin of the Thanksgiving tradition dating to 1789, when President George Washington proclaimed a day of thanksgiving, and describes the ongoing practice of recognizing blessings and expressing gratitude. It calls on the American people to observe the day in a manner consistent with national customs, to reflect on providence and the nation’s achievements, and to engage in activities that acknowledge gratitude and support the greater good.",
    "link": "https://www.whitehouse.gov/presidential-actions/2025/11/thanksgiving-day-2025/"
  },
  {
    "title": "Proclamation on Regulatory Relief for Certain Stationary Sources to Promote American Coke Oven Processing Security",
    "summary": "This proclamation, issued by the President, designates regulatory relief for certain stationary sources to support secure and reliable coke oven processing in the United States. It notes the essential role of steel in the U.S. economy and infrastructure and outlines the regulatory adjustments and safety considerations associated with these sources.",
    "link": "https://www.whitehouse.gov/presidential-actions/2025/11/regulatory-relief-for-certain-stationary-sources-to-promote-american-coke-oven-processing-security/"
  },
  {
    "title": "Nominations Sent to the Senate: Nominees for ATF Director, EEOC General Counsel, and CFPB Director",
    "summary": "The White House announced nominations sent to the Senate, including Robert Cekada to be Director of the Bureau of Alcohol, Tobacco, Firearms, and Explosives; Carter Crow to be General Counsel of the Equal Employment Opportunity Commission for a four-year term; Stuart Levenbach to be Director of the Bureau of Consumer Financial Protection for a five-year term; and David Clay Fowlkes, among other nominees listed in the notice.",
    "link": "https://www.whitehouse.gov/presidential-actions/2025/11/nominations-sent-to-the-senate-d2ae/"
  },
  {
    "title": "Proclamation by the President of the United States Declaring National Adoption Month, 2025",
    "summary": "A presidential proclamation designating November 2025 as National Adoption Month. It notes that every child deserves a safe and nurturing home, emphasizes adoption as a means to provide stability and belonging for children, and recognizes adoptive families. The proclamation invites continued support for adoption and related services and acknowledges the contributions of parents and guardians who provide permanent loving homes.",
    "link": "https://www.whitehouse.gov/presidential-actions/2025/11/national-adoption-month-2025/"
  },
  {
    "title": "Executive Order on Supporting Family Stability and the Foster Care System",
    "summary": "This executive order articulates the president's policy to support families by empowering parents to raise children in safe and loving homes and to address the foster care system during times when such family arrangements are disrupted by crises. It states the administration's commitment to family well-being and describes the scope of federal action intended to promote safe, stable, and nurturing environments for children, and to coordinate related measures across relevant agencies.",
    "link": "https://www.whitehouse.gov/presidential-actions/2025/11/fostering-the-future-for-american-children-and-families/"
  }
]