[
  {
    "title": "Executive action to implement the United States-Israel Agreement on Trade in Agricultural Products and for Other Purposes",
    "summary": "This presidential action implements the United States-Israel Agreement on Trade in Agricultural Products, which is part of the United States-Israel Free Trade Area framework established by the agreement signed on April 22, 1985. Congress approved the United States-Israel Free Trade Area Implementation Act, including section 3 that authorized its implementation. The action specifies measures to carry out the agreement’s provisions related to trade in agricultural products and other purposes under USIFTA.",
    "link": "https://www.whitehouse.gov/presidential-actions/2025/12/to-implement-the-united-states-israel-agreement-on-trade-in-agricultural-products-and-for-other-purposes/"
  },
  {
    "title": "Executive Order Adjusting Rates of Basic Pay for Statutory Pay Systems",
    "summary": "This executive order establishes the adjusted rates of basic pay for employees covered by statutory pay systems, as defined in 5 U.S.C. 5302(1). Issued under the authority of 5 U.S.C. 5303, it sets the updated pay rates and outlines the scope and implementation of the adjustments across applicable federal pay schedules.",
    "link": "https://www.whitehouse.gov/presidential-actions/2025/12/adjustments-of-certain-rates-of-pay/"
  },
  {
    "title": "Executive Order on Ensuring American Space Superiority",
    "summary": "This executive order establishes the purpose and rationale for pursuing and maintaining United States space superiority. It states that space superiority reflects national vision and willpower, and that the technologies developed to achieve space capabilities contribute to the nation’s strength, security, and prosperity. The document, beginning with Section 1: Purpose, is issued by the President and outlines initial objectives and directed actions within the executive branch to advance U.S. space capabilities.",
    "link": "https://www.whitehouse.gov/presidential-actions/2025/12/ensuring-american-space-superiority/"
  },
  {
    "title": "Executive Order Providing for the Closure of Executive Departments and Agencies of the Federal Government on December 24, 2025, and December 26, 2025",
    "summary": "This executive order directs all federal executive departments and agencies to close on December 24, 2025, and December 26, 2025, and to excuse their employees from duty on those dates. The action establishes a government-wide closure for these specified days and outlines the general framework for employee leave, including considerations for essential personnel and continuity of government as described in the order.",
    "link": "https://www.whitehouse.gov/presidential-actions/2025/12/providing-for-the-closure-of-executive-departments-and-agencies-of-the-federal-government-on-december-24-2025-and-december-26-2025/"
  },
  {
    "title": "Executive Action to Increase Medical Marijuana and Cannabinoid Research",
    "summary": "This executive action, issued by the President, directs interagency coordination to expand federal support for medical marijuana and cannabidiol (CBD) research and to strengthen the infrastructure for such research. It cites the FDA's 2023 review as a basis for pursuing increased research activity and outlines the policy in Section 1, which states that Americans should have access to advanced medical treatments and a robust research framework. The order seeks to advance the objectives of improving medical research related to marijuana and cannabinoids and to facilitate related research activities across federal agencies.",
    "link": "https://www.whitehouse.gov/presidential-actions/2025/12/increasing-medical-marijuana-and-cannabidiol-research/"
  },
  {
    "title": "Executive Order Restricting and Limiting the Entry of Foreign Nationals to Protect the Security of the United States",
    "summary": "This executive order reinstates prior policies restricting the entry of certain foreign nationals into the United States to address national security and public safety concerns at the borders. It notes that the Supreme Court upheld previous restrictions and references Executive Order 14161, issued January 20, 2025, titled Protecting the United States From Foreign Terrorists and Other National Security Threats. The order directs federal agencies to implement and enforce entry limitations, clarifies categories of foreign nationals subject to restrictions, and outlines mechanisms for travel screening and border enforcement aimed at mitigating identified threats while maintaining accordance with existing legal authorities.",
    "link": "https://www.whitehouse.gov/presidential-actions/2025/12/restricting-and-limiting-the-entry-of-foreign-nationals-to-protect-the-security-of-the-united-states/"
  }
]