[
  {
    "title": "Proclamation designating Leif Erikson Day, 2025",
    "summary": "A presidential proclamation designating October 9, 2025, as Leif Erikson Day. The document acknowledges Leif Erikson as an early European explorer and highlights the historical significance of Norse exploration in North America. It invites federal agencies, communities, and educational institutions to observe the day and to recognize the contributions of Nordic heritage to the United States, including education about exploration, trade, and cross-cultural exchange.",
    "link": "https://www.whitehouse.gov/presidential-actions/2025/10/leif-erikson-day-2025/"
  },
  {
    "title": "Proclamation on Columbus Day, 2025",
    "summary": "This document is a presidential proclamation declaring Columbus Day, 2025, and recognizing Christopher Columbus as a historical figure associated with early American history and Western civilization. It designates observance of Columbus Day and invites reflection on the events and contributions linked to the holiday.",
    "link": "https://www.whitehouse.gov/presidential-actions/2025/10/columbus-day-2025/"
  },
  {
    "title": "Presidential Memorandum on Construction of Arctic Security Cutters",
    "summary": "A presidential memorandum issued under the President's constitutional and statutory authority concerns the construction of Arctic Security Cutters. The memorandum is addressed to the Secretary of Homeland Security, the Director of the Office of Management and Budget, the Assistant to the President for National Security Affairs, and the Assistant to the President and Homeland Security Advisor. It identifies the authority under which the construction is to proceed and specifies the officials responsible for implementing the actions described.",
    "link": "https://www.whitehouse.gov/presidential-actions/2025/10/construction-of-arctic-security-cutters/"
  },
  {
    "title": "Proclamation: Fire Prevention Week, 2025",
    "summary": "A presidential proclamation issued during Fire Prevention Week 2025 designates the week as a time to focus on fire prevention. It calls on every household and community to prioritize fire prevention by taking steps to reduce risks and strengthen safety. The proclamation also acknowledges and honors the steadfast courage and dedication of firefighters and first responders who protect lives and property across the United States.",
    "link": "https://www.whitehouse.gov/presidential-actions/2025/10/fire-prevention-week-2025/"
  },
  {
    "title": "Proclamation Designating National Manufacturing Day, 2025",
    "summary": "The President proclaims National Manufacturing Day, 2025 to recognize the contributions of the manufacturing sector to the United States economy, communities, independence, and national security, and to encourage public awareness and appreciation of manufacturing achievements. The proclamation notes the sector's historical role from early mills to today's advanced industries and calls on federal agencies, state and local governments, schools, and private sector partners to observe the day and support policies, programs, and initiatives that strengthen manufacturing, workforce development, innovation, and resilience.",
    "link": "https://www.whitehouse.gov/presidential-actions/2025/10/national-manufacturing-day-2025/"
  }
]