[
  {
    "title": "Proclamation Regarding Tren de Aragua as a Foreign Terrorist Organization",
    "summary": "This proclamation designates the Tren de Aragua (TdA) as a Foreign Terrorist Organization due to its substantial membership and activities that reportedly pose a threat to the United States. The document outlines the concern that numerous members of TdA have unlawfully entered the United States and are involved in irregular warfare and hostile actions against the country. It calls attention to the group's operations in cooperation with other criminal organizations and highlights the need for measures to address this security concern.",
    "link": "https://www.whitehouse.gov/presidential-actions/2025/03/invocation-of-the-alien-enemies-act-regarding-the-invasion-of-the-united-states-by-tren-de-aragua/"
  },
  {
    "title": "Memorandum on the Enforcement of Federal Rule of Civil Procedure 65(c)",
    "summary": "This memorandum addresses the implementation and enforcement of Federal Rule of Civil Procedure 65(c) concerning injunctions issued by activist organizations. It highlights concerns about the issuance of wide-ranging injunctions that may exceed the intended scope of relief permitted under the rules. The memorandum is directed to the heads of executive departments and agencies to ensure consistent adherence to these judicial standards.",
    "link": "https://www.whitehouse.gov/presidential-actions/2025/03/ensuring-the-enforcement-of-federal-rule-of-civil-procedure-65c/"
  },
  {
    "title": "Nominations Submitted to the Senate for Various Positions",
    "summary": "The document outlines a list of presidential nominations submitted to the Senate for confirmation, including Richard Anderson to serve as Assistant Secretary of the Air Force, and John Arrigo as Ambassador Extraordinary and Plenipotentiary to the Portuguese Republic. Additional nominations are mentioned, indicating prospective appointments to various diplomatic and governmental roles.",
    "link": "https://www.whitehouse.gov/presidential-actions/2025/03/nominations-sent-to-the-senate-8355/"
  },
  {
    "title": "Restoration of the Public Service Loan Forgiveness Program",
    "summary": "This executive order reaffirms the commitment to the Public Service Loan Forgiveness (PSLF) Program, which was established by Congress in 2007. The PSLF Program aims to incentivize individuals to pursue careers in public service by offering loan forgiveness for those who qualify. The order outlines the objectives and implementation strategies to ensure that the program effectively serves its purpose and continues to support professionals in the public sector.",
    "link": "https://www.whitehouse.gov/presidential-actions/2025/03/restoring-public-service-loan-forgiveness/"
  },
  {
    "title": "Establishment of the White House Task Force for the FIFA World Cup 2026",
    "summary": "This executive order establishes a task force within the White House to support the planning and execution of the FIFA World Cup 2026, for which the United States will serve as a host nation. The order aims to ensure coordinated efforts across various federal agencies and engage with relevant stakeholders to facilitate the successful organization of the event. The task force will focus on addressing logistical, security, and other related considerations in anticipation of both the FIFA Club World Cup 2025 and the FIFA World Cup 2026.",
    "link": "https://www.whitehouse.gov/presidential-actions/2025/03/establishing-the-white-house-task-force-on-the-fifa-world-cup-2026/"
  }
]