[
  {
    "title": "Continuation of Federal Bureaucracy Reduction",
    "summary": "This executive order extends the efforts to decrease the size and scope of the Federal bureaucracy. The President identifies certain elements of the bureaucracy as unnecessary and outlines measures for further reduction. The order aims to streamline government operations by eliminating redundant or ineffective components within federal agencies. Specific provisions and exceptions to these reductions are included to ensure essential functions and services continue without disruption.",
    "link": "https://www.whitehouse.gov/presidential-actions/2025/03/continuing-the-reduction-of-the-federal-bureaucracy/"
  },
  {
    "title": "Addressing Legal Risks Associated with Global Law Firms",
    "summary": "This executive order addresses concerns regarding the influence and activities of global law firms, particularly focusing on their potential impact on the judicial process and foundational principles of the United States. It outlines the government's intent to assess the role these firms play and implement measures to mitigate any identified risks to the legal system.",
    "link": "https://www.whitehouse.gov/presidential-actions/2025/03/addressing-risks-from-paul-weiss/"
  },
  {
    "title": "Rescission of Certain Executive Orders and Actions",
    "summary": "This Executive Order outlines the rescission of additional presidential orders and memoranda that were previously enacted. It builds upon Executive Order 14148, which was issued on January 20, 2025, and which rescinded a total of 78 executive orders and memoranda from the prior administration. The purpose of this order is to further eliminate actions deemed to be harmful or unnecessary in the context of the current administration's goals and policy directions.",
    "link": "https://www.whitehouse.gov/presidential-actions/2025/03/additional-recissions-of-harmful-executive-orders-and-actions/"
  },
  {
    "title": "Proclamation Designating U.S. Hostage and Wrongful Detainee Day, 2025",
    "summary": "This presidential proclamation establishes a national observance known as U.S. Hostage and Wrongful Detainee Day for the year 2025. It emphasizes solidarity with Americans who are being held captive or wrongfully detained abroad. The proclamation expresses a commitment to support these individuals and their families, ensuring that their situations remain recognized and addressed.",
    "link": "https://www.whitehouse.gov/presidential-actions/2025/03/u-s-hostage-and-wrongful-detainee-day-2025/"
  },
  {
    "title": "Establishment of the Strategic Bitcoin Reserve and United States Digital Asset Stockpile",
    "summary": "This executive order establishes a Strategic Bitcoin Reserve and outlines the creation of a United States Digital Asset Stockpile. The order recognizes Bitcoin as a significant cryptocurrency with a fixed supply of 21 million coins. The directive aims to create a framework for managing digital assets in a secure and strategic manner, ensuring the protection and utilization of these resources within the economy and to enhance national interests related to digital currencies.",
    "link": "https://www.whitehouse.gov/presidential-actions/2025/03/establishment-of-the-strategic-bitcoin-reserveand-united-states-digital-asset-stockpile/"
  },
  {
    "title": "Modification of Duties to Address Illicit Drug Trafficking at the Southern Border",
    "summary": "This executive order outlines adjustments to existing customs duties aimed at mitigating the flow of illicit drugs entering the United States through the southern border. The order is enacted under the President's authority derived from various U.S. laws, including the International Emergency Economic Powers Act and the National Emergencies Act. The changes are intended to enhance border security measures related to drug trafficking and facilitate more effective enforcement of drug-related laws.",
    "link": "https://www.whitehouse.gov/presidential-actions/2025/03/amendment-to-duties-to-address-the-flow-of-illicit-drugs-across-our-southern-border/"
  }
]