[
  {
    "title": "Executive Order Restoring the United States Department of War",
    "summary": "This executive order, issued by the President, restores the United States Department of War. It cites historical context by noting that on August 7, 1789, President George Washington signed into law the bill establishing the department. The order asserts the authority of the President under the Constitution and federal law and states the purpose of the restoration, including reestablishing the department to oversee its operation and maintenance. It outlines initial directives in Section 1, Purpose, to implement the restoration and to realign the department's responsibilities accordingly.",
    "link": "https://www.whitehouse.gov/presidential-actions/2025/09/restoring-the-united-states-department-of-war/"
  },
  {
    "title": "Executive Action Modifying Reciprocal Tariffs and Establishing Procedures for Implementing Trade and Security Agreements",
    "summary": "This executive action, issued by the President, utilizes authorities including the International Emergency Economic Powers Act, the National Emergencies Act, and section 232 of the Trade Expansion Act of 1962 to alter the scope of reciprocal tariffs and to establish procedures for implementing trade and security agreements. The action defines the scope of reciprocal tariffs and outlines procedural steps for negotiating, adopting, and enforcing related trade and security agreements.",
    "link": "https://www.whitehouse.gov/presidential-actions/2025/09/modifying-the-scope-of-reciprocal-tariffs-and-establishing-procedures-for-implementing-trade-and-security-agreements/"
  },
  {
    "title": "Executive Order to Strengthen U.S. Government Efforts to Protect Nationals from Wrongful Detention Abroad",
    "summary": "This Executive Order, issued under the Constitution and the Robert Levinson Hostage Recovery and Hostage-Taking Accountability Act (22 U.S.C. 1741 et seq.) (Levinson Act), establishes the policy of the United States to strengthen protections for U.S. nationals abroad who are detained or at risk of wrongful detention. It directs federal departments and agencies to coordinate policy and actions to prevent wrongful detention, provide timely consular assistance, and pursue accountability for hostage-taking or wrongful detention. The order requires review and enhancement of existing procedures, including interagency information sharing and data collection, improves communication with families and the public, and designates a lead mechanism to oversee implementation and ensure compliance and transparency.",
    "link": "https://www.whitehouse.gov/presidential-actions/2025/09/strengthening-efforts-to-protect-u-s-nationals-from-wrongful-detention-abroad/"
  },
  {
    "title": "Nominations Sent to the Senate for Commissioner of Labor Statistics, Federal Maritime Commissioner, and Assistant Secretary",
    "summary": "The White House announced nominations to the Senate for three federal appointments. Erwin Antoni, of Pennsylvania, is nominated to be Commissioner of Labor Statistics, Department of Labor, for a four-year term, succeeding Erika L. McEntarfer. Laura DiBella, of Florida, is nominated to be Federal Maritime Commissioner for a term expiring June 30, 2028, succeeding L. E. Sola. Steven Haines, of Virginia, is nominated to be an Assistant Secretary.",
    "link": "https://www.whitehouse.gov/presidential-actions/2025/09/nominations-sent-to-the-senate-f7c7/"
  },
  {
    "title": "Executive Action on Federal Civic Architecture and Public Building Design",
    "summary": "This presidential action states the purpose of emphasizing federal civic architecture and cites the Founders’ view that public buildings should inspire citizens and reflect national civic values. It directs federal agencies to apply defined design principles to federal buildings, with the aim of ensuring that new construction and major renovations are carried out in a manner that is respectful of history, clear in form, and capable of publicly engaging audiences. The order calls for interagency coordination to implement these principles and monitor progress toward improving the appearance and perceived quality of federal architecture.",
    "link": "https://www.whitehouse.gov/presidential-actions/2025/08/making-federal-architecture-beautiful-again/"
  },
  {
    "title": "Proclamation Designating Overdose Prevention Week, 2025",
    "summary": "The President proclaims a national observance named Overdose Prevention Week, 2025, to draw attention to the drug overdose crisis as a significant public health concern and to recognize its impact on individuals, families, and communities. The proclamation designates Overdose Prevention Week, 2025, to promote awareness of overdose prevention resources and to encourage collaboration among federal, state, and local governments, healthcare providers, and community organizations to support prevention efforts, increase access to treatment and recovery services, and disseminate information on evidence-based strategies for reducing overdose deaths. It emphasizes the safety, health, and well-being of the American people as essential to the nation's resilience and calls for coordinated actions across agencies to address this crisis.",
    "link": "https://www.whitehouse.gov/presidential-actions/2025/08/overdose-prevention-week-2025/"
  },
  {
    "title": "Proclamation on Labor Day, 2025",
    "summary": "This proclamation designates Labor Day, 2025, as a national observance to recognize the contributions of American workers to the nation's progress. It highlights the continuity of labor through American history, noting the role of workers from the earliest settlers to the builders of national infrastructure like railroads, and emphasizes the ongoing importance of workers across industries in shaping the country's development. The document serves to acknowledge the skill, determination, and resilience of the American workforce and to call for appropriate observances that reflect on their achievements and the current importance of a strong and resilient labor force.",
    "link": "https://www.whitehouse.gov/presidential-actions/2025/08/labor-day-2025/"
  },
  {
    "title": "Memorandum Directing Investigations Into Use of Federal Grant Funds for Illegal Lobbying and Partisan Political Activity by Federal Grantees",
    "summary": "A presidential memorandum directed to the Attorney General to oversee investigations into the use of appropriated funds by federal grantees for illegal lobbying and partisan political activity. It directs the Department of Justice to examine compliance with applicable laws and policies, determine whether grant funds have been used improperly, and take appropriate enforcement or corrective actions as needed. The memorandum references Section 1, titled Investigations Into Use of Federal Grant Funds, outlining the scope of authority and investigative procedures related to federal grant fund usage.",
    "link": "https://www.whitehouse.gov/presidential-actions/2025/08/use-of-appropriated-funds-for-illegal-lobbying-and-partisan-political-activity-by-federal-grantees/"
  }
]