[
  {
    "title": "Further Amendment to Import Duties on Synthetic Opioid Supply Chain from China",
    "summary": "This executive order amends existing import duties related to the synthetic opioid supply chain from the People's Republic of China. It is issued under the authority of the President and in accordance with the International Emergency Economic Powers Act, the National Emergencies Act, and relevant trade laws. The amendment aims to address and regulate the flow of synthetic opioids, reflecting ongoing efforts to manage and mitigate the public health crisis associated with these substances.",
    "link": "https://www.whitehouse.gov/presidential-actions/2025/03/further-amendment-to-duties-addressing-the-synthetic-opioid-supply-chain-in-the-peoples-republic-of-china/"
  },
  {
    "title": "Executive Order on National Security Concerns Related to Timber and Lumber Imports",
    "summary": "This executive order, issued by the President under the authority of the Constitution and the Trade Expansion Act of 1962, establishes policy measures aimed at addressing national security risks associated with imports of timber and lumber products. The order outlines specific guidelines and actions intended to protect the domestic wood products industry, which includes timber and lumber and their derivatives. It emphasizes the importance of maintaining the integrity and economic viability of this sector due to its relevance to national security.",
    "link": "https://www.whitehouse.gov/presidential-actions/2025/03/addressing-the-threat-to-national-security-from-imports-of-timber-lumber/"
  },
  {
    "title": "Executive Order on the Expansion of Timber Production in the United States",
    "summary": "This executive order emphasizes the importance of timber production for various sectors, including construction, and outlines the federal government's intent to increase the availability of timber, lumber, paper, bioenergy, and wood products in the United States. It addresses the need for sustainable practices in timber production and aims to enhance the country's capacity to meet domestic demand for these materials, thereby supporting economic growth and human activities reliant on wood products.",
    "link": "https://www.whitehouse.gov/presidential-actions/2025/03/immediate-expansion-of-american-timber-production/"
  },
  {
    "title": "Establishment of English as the Official Language of the United States",
    "summary": "This executive order designates English as the official language of the United States, affirming its historical role in the country since its founding. The order references the usage of English in key governing documents, including the Declaration of Independence and the Constitution, and establishes a policy framework for its implementation as the national language.",
    "link": "https://www.whitehouse.gov/presidential-actions/2025/03/designating-english-as-the-official-language-of-the-united-states/"
  },
  {
    "title": "Improving Healthcare Transparency by Providing Patients with Accessible Pricing Information",
    "summary": "This executive order outlines efforts by the Administration to enhance transparency in healthcare pricing. The primary objective is to provide patients with clear, accurate, and actionable information regarding healthcare costs, contributing to informed decision-making. The initiative incorporates measures aimed at ensuring that individuals can access relevant pricing data, thereby facilitating better healthcare choices and addressing issues related to healthcare affordability.",
    "link": "https://www.whitehouse.gov/presidential-actions/2025/02/making-america-healthy-again-by-empowering-patients-with-clear-accurate-and-actionable-healthcare-pricing-information/"
  },
  {
    "title": "Memorandum on the Suspension of Security Clearances and Evaluation of Government Contracts",
    "summary": "This memorandum outlines the directives regarding the suspension of security clearances for certain individuals and the evaluation of existing government contracts. It addresses the implications for national security and the importance of reviewing current contractual agreements within government agencies. The memorandum is directed to key government officials including the Secretary of State, the Secretary of Defense, and other relevant authorities, emphasizing a coordinated approach to manage security clearances and contracts.",
    "link": "https://www.whitehouse.gov/presidential-actions/2025/02/suspension-of-security-clearances-and-evaluation-of-government-contracts/"
  },
  {
    "title": "Executive Order on National Security and Copper Imports",
    "summary": "This executive order articulates U.S. policy regarding the importation of copper, identified as a critical material for national security. It references the authority under the Trade Expansion Act of 1962 to address concerns related to the sourcing of copper imports and their potential threat to national security. The order aims to establish a framework for assessing and managing risks associated with copper imports.",
    "link": "https://www.whitehouse.gov/presidential-actions/2025/02/addressing-the-threat-to-nationalsecurity-from-imports-of-copper/"
  }
]