[
  {
    "title": "Presidential Executive Order on Addressing Actions of the Republic of South Africa",
    "summary": "This Executive Order outlines the United States government's response to the enactment of the Expropriation Act 13 of 2024 by the Republic of South Africa. It highlights concerns related to the implications of the Act for citizens' rights and sets forth measures to address these issues through diplomatic engagement and policy considerations.",
    "link": "https://www.whitehouse.gov/presidential-actions/2025/02/addressing-egregious-actions-of-the-republic-of-south-africa/"
  },
  {
    "title": "Executive Order on the Protection of Second Amendment Rights",
    "summary": "This executive order aims to affirm the significance of the Second Amendment as a fundamental provision for the security and liberty of American citizens. It outlines the intention to uphold and safeguard the rights granted under this amendment, emphasizing the importance of personal protection for individuals and their families.",
    "link": "https://www.whitehouse.gov/presidential-actions/2025/02/protecting-second-amendment-rights-7b90/"
  },
  {
    "title": "Creation of the White House Faith Office to Support Community Organizations",
    "summary": "This executive order establishes the White House Faith Office, tasked with providing support to faith-based entities, community organizations, and houses of worship. The office aims to strengthen American families, promote work and self-sufficiency, and uphold religious liberty through collaborative efforts with community stakeholders. The initiative seeks to facilitate the engagement of these organizations in addressing social issues and enhancing the well-being of individuals and families.",
    "link": "https://www.whitehouse.gov/presidential-actions/2025/02/establishment-of-the-white-house-faith-office/"
  },
  {
    "title": "Appointments to the White House Faith Office Announced",
    "summary": "President Donald Trump announced the establishment of a new White House Faith Office, appointing Pastor Paula White-Cain as a Special Government Employee and Senior Advisor. White-Cain brings extensive experience, having ministered across nearly 200 countries over the past 40 years, and her role will focus on religious freedom and related initiatives within the White House's framework.",
    "link": "https://www.whitehouse.gov/presidential-actions/2025/02/president-trump-announces-appointments-to-the-white-house-faith-office/"
  },
  {
    "title": "Executive Order on the Second Amendment Rights",
    "summary": "This executive order addresses the importance of the Second Amendment as a fundamental aspect of security and individual liberty in the United States. It emphasizes the right of citizens to protect themselves and their families. The order underscores the administration's intention to uphold and safeguard these rights as part of its constitutional responsibilities.",
    "link": "https://www.whitehouse.gov/presidential-actions/2025/02/protecting-second-amendment-rights/"
  },
  {
    "title": "Imposition of Sanctions on the International Criminal Court",
    "summary": "This executive order implements sanctions against the International Criminal Court (ICC). The order cites authorities granted by various acts, including the International Emergency Economic Powers Act and the National Emergencies Act, to impose measures aimed at restricting the activities of the ICC. The specifics of these sanctions may involve restrictions on financial transactions and other operational capabilities of the court in response to certain actions or investigations involving U.S. personnel.",
    "link": "https://www.whitehouse.gov/presidential-actions/2025/02/imposing-sanctions-on-the-international-criminal-court/"
  },
  {
    "title": "Presidential Executive Order on Protecting Religious Freedoms",
    "summary": "This executive order outlines the policy of the United States aimed at safeguarding the religious freedoms of American citizens. It establishes guidelines intended to eliminate biases against Christian practices and expressions in various sectors, including public discourse and institutional practices. The order seeks to ensure that individuals can freely express their religious beliefs without fear of discrimination or retribution, thereby promoting an environment of tolerance and respect for diverse religious perspectives.",
    "link": "https://www.whitehouse.gov/presidential-actions/2025/02/eradicating-anti-christian-bias/"
  },
  {
    "title": "Guidelines for Evaluating Funding to Nongovernmental Organizations",
    "summary": "This memorandum outlines the policy approach for U.S. government funding provided to Nongovernmental Organizations (NGOs). It emphasizes the need for careful consideration regarding the actions of these organizations and their potential impact on U.S. security, prosperity, and safety. The memorandum serves to instruct the heads of executive departments and agencies on how to assess the alignment of NGO activities with national interests before approving funding.",
    "link": "https://www.whitehouse.gov/presidential-actions/2025/02/memorandum-for-the-heads-of-executive-departments-and-agencies/"
  },
  {
    "title": "Executive Order on Women's Participation in Sports",
    "summary": "This executive order outlines the policy aimed at ensuring that women and girls have the opportunity to compete in sports in a fair and safe environment. It addresses recent trends in educational institutions and athletic associations regarding athletic participation and aims to establish clear guidelines to protect women's sports. The order emphasizes the importance of maintaining separate divisions for male and female athletes, thereby seeking to create equitable competitive opportunities.",
    "link": "https://www.whitehouse.gov/presidential-actions/2025/02/keeping-men-out-of-womens-sports/"
  }
]