[
  {
    "title": "Imposition of Tariffs on Imports of Venezuelan Oil",
    "summary": "This executive order establishes tariffs on countries that import oil from Venezuela. The order is issued under the authority of several U.S. laws, including the International Emergency Economic Powers Act and the National Emergencies Act. The measure aims to regulate trade practices related to Venezuelan oil imports in response to specified economic conditions.",
    "link": "https://www.whitehouse.gov/presidential-actions/2025/03/imposing-tariffs-on-countries-importing-venezuelan-oil/"
  },
  {
    "title": "Proclamation on Greek Independence Day and Celebration of Greek and American Democracy, 2025",
    "summary": "This proclamation commemorates the 204th anniversary of Greek Independence Day, which marks the beginning of Greece's war for independence against the Ottoman Empire on March 25, 1821. The proclamation recognizes the significance of this historical event in establishing a sovereign Greek state and emphasizes the values of democracy that both Greece and the United States share. The document serves to honor the contributions of Greek Americans and the enduring relationship between Greece and the United States.",
    "link": "https://www.whitehouse.gov/presidential-actions/2025/03/greek-independence-day-a-national-day-of-celebration-of-greek-and-american-democracy-2025/"
  },
  {
    "title": "Consolidation of Federal Procurement to Reduce Waste and Costs",
    "summary": "This executive order outlines a policy to enhance the efficiency of federal government spending, particularly focusing on the approximately $490 billion allocated annually for contracts related to common goods and services. The order aims to streamline procurement processes, eliminate unnecessary expenditures, and promote better financial management in government purchasing practices. By consolidating procurement efforts, the order seeks to reduce waste and ensure taxpayer dollars are used more effectively.",
    "link": "https://www.whitehouse.gov/presidential-actions/2025/03/eliminating-waste-and-saving-taxpayer-dollars-by-consolidating-procurement/"
  },
  {
    "title": "Executive Order on Enhancing Domestic Mineral Production",
    "summary": "This executive order establishes a framework aimed at increasing the production of mineral resources in the United States. It acknowledges the country's significant mineral reserves and the potential benefits of developing these resources, which include job creation, economic growth, and reduced dependency on external sources for minerals. The order outlines immediate measures to promote and streamline mineral production activities in order to support national economic objectives.",
    "link": "https://www.whitehouse.gov/presidential-actions/2025/03/immediate-measures-to-increase-american-mineral-production/"
  },
  {
    "title": "Executive Order on Enhancing Educational Outcomes through Parental and Community Involvement",
    "summary": "This executive order establishes a framework to empower families, teachers, and communities in order to improve educational outcomes for students. It emphasizes the importance of collaboration among various stakeholders in the educational process to ensure the success of students. The policy aims to create robust support systems that enable parents and communities to actively engage in educational practices, promoting beneficial academic environments.",
    "link": "https://www.whitehouse.gov/presidential-actions/2025/03/improving-education-outcomes-by-empowering-parents-states-and-communities/"
  }
]