[
  {
    "title": "Presidential Action Declaring Enduring Peace and Prosperity Pursuant to the Trump Peace Agreement",
    "summary": "The White House notice describes a presidential action endorsing and implementing the Trump Peace Agreement. It characterizes the agreement as ending more than two years of suffering and loss and as opening a new chapter aimed at regional peace, security, and shared prosperity. The document states support for the agreement and outlines the administration's plan to advance its provisions, coordinate with involved parties, and monitor progress toward lasting peace and prosperity in the region.",
    "link": "https://www.whitehouse.gov/presidential-actions/2025/10/the-trump-declaration-for-enduring-peace-and-prosperity/"
  },
  {
    "title": "Proclamation on Leif Erikson Day, 2025",
    "summary": "This proclamation designates Leif Erikson Day for 2025 and commemorates Leif Erikson's voyage to the New World, recognizing his role as the first known European to set foot in North America. It invites Americans to observe the day with ceremonies and educational activities that highlight Scandinavian heritage and exploration.",
    "link": "https://www.whitehouse.gov/presidential-actions/2025/10/leif-erikson-day-2025/"
  },
  {
    "title": "Columbus Day, 2025 Proclamation",
    "summary": "This presidential proclamation designates Columbus Day, 2025 as a day of national observance. It recognizes Christopher Columbus's historical role in the exploration and early history of the United States and invites the American people to observe the day with reflection on the nation's heritage and shared history.",
    "link": "https://www.whitehouse.gov/presidential-actions/2025/10/columbus-day-2025/"
  },
  {
    "title": "Presidential Memorandum on the Construction of Arctic Security Cutters",
    "summary": "A presidential memorandum addressed to the Secretary of Homeland Security, the Director of the Office of Management and Budget, the Assistant to the President for National Security Affairs, and the Assistant to the President and Homeland Security Advisor. It states that the President, by constitutional and statutory authority, directs actions related to the construction of Arctic Security Cutters and assigns responsibilities to coordinate its implementation.",
    "link": "https://www.whitehouse.gov/presidential-actions/2025/10/construction-of-arctic-security-cutters/"
  },
  {
    "title": "Proclamation Designating Fire Prevention Week, 2025",
    "summary": "This proclamation designates Fire Prevention Week, 2025, and calls on individuals, households, and communities to prioritize fire prevention by implementing measures to reduce fire risks and improve safety. It acknowledges and honors the courage and dedication of firefighters and first responders who protect lives and property nationwide.",
    "link": "https://www.whitehouse.gov/presidential-actions/2025/10/fire-prevention-week-2025/"
  },
  {
    "title": "Proclamation Declaring National Manufacturing Day, 2025",
    "summary": "This presidential proclamation designates National Manufacturing Day, 2025, and underscores the historic and ongoing importance of the manufacturing sector to the United States. It notes how manufacturing has contributed to the nation's prosperity, community strength, independence, and overall national leadership, and it invites recognition and engagement by the public and private sectors in support of manufacturing.",
    "link": "https://www.whitehouse.gov/presidential-actions/2025/10/national-manufacturing-day-2025/"
  }
]