[
  {
    "title": "Initiation of Federal Bureaucracy Reduction Efforts",
    "summary": "This executive order outlines the intent of the administration to significantly decrease the size of the Federal Government while enhancing its accountability to the citizens of the United States. The order establishes the groundwork for policies and actions aimed at achieving these objectives, signaling a shift in the administration's approach to federal governance.",
    "link": "https://www.whitehouse.gov/presidential-actions/2025/02/commencing-the-reduction-of-the-federal-bureaucracy/"
  },
  {
    "title": "Executive Order on Regulatory Enforcement and Government Efficiency Initiative",
    "summary": "This executive order establishes the policy of the Administration to prioritize enforcement resources on regulations authorized by federal statutes. The order outlines the purpose of ensuring that the executive branch operates in a manner that is consistent with lawful governance while promoting efficiency in government operations. It aims to implement a regulatory initiative focused on enhancing the effectiveness of government oversight and management of resources.",
    "link": "https://www.whitehouse.gov/presidential-actions/2025/02/ensuring-lawful-governance-and-implementing-the-presidents-department-of-government-efficiency-regulatory-initiative/"
  },
  {
    "title": "Commemoration of the 80th Anniversary of the Battle of Iwo Jima",
    "summary": "This proclamation marks the 80th anniversary of the Battle of Iwo Jima, which began on February 19, 1945. It acknowledges the significance of the battle as a key event in the Second World War, emphasizing the challenges faced by United States Marines during the 36-day military engagement on the island. The proclamation serves as a recognition of the sacrifices made by service members and the impact of the campaign on the course of the war.",
    "link": "https://www.whitehouse.gov/presidential-actions/2025/02/80th-anniversary-of-the-battle-of-iwo-jima/"
  },
  {
    "title": "Announcement of New Appointments to the Council of Governors",
    "summary": "President Donald J. Trump has announced new appointments to the Council of Governors, which is a bipartisan group that includes state leaders. The Council's primary role is to enhance collaboration between state and federal governments, particularly on matters related to national security, disaster response, and military coordination. Established by the National Defense Authorization Act of 2008, the Council of Governors aims to strengthen partnerships within these critical areas. This announcement highlights the ongoing effort to address issues that require cooperative engagement among various levels of government.",
    "link": "https://www.whitehouse.gov/presidential-actions/2025/02/president-trump-announces-appointments-to-the-council-of-governors/"
  },
  {
    "title": "Executive Order on Accountability for Federal Agencies",
    "summary": "This executive order outlines the authority of the President to ensure that all federal agencies operate with accountability and transparency in their execution of laws and policies. It includes provisions for oversight and aims to improve the effectiveness and efficiency of governmental operations. The order emphasizes the necessity for agencies to comply with established procedures and to implement measures that enhance accountability in their functions.",
    "link": "https://www.whitehouse.gov/presidential-actions/2025/02/ensuring-accountability-for-all-agencies/"
  },
  {
    "title": "Establishment of Policies to Enhance Access to In Vitro Fertilization Services",
    "summary": "This executive order aims to address the challenges faced by couples seeking to start a family, specifically those facing infertility issues. It recognizes that a significant portion of couples, approximately one in seven, experience difficulties in conceiving. The order outlines the intent to improve access to in vitro fertilization (IVF) services, enhancing support for individuals and couples undergoing fertility treatments. Various measures and guidelines may be implemented to facilitate easier access to these procedures, thereby assisting those in need of reproductive health services.",
    "link": "https://www.whitehouse.gov/presidential-actions/2025/02/expanding-access-to-in-vitro-fertilization/"
  }
]