[
  {
    "title": "Executive Order to Accelerate AI-Driven Advances in Pediatric Cancer Prevention and Treatment",
    "summary": "This executive action articulates the administration's policy to leverage artificial intelligence to prevent and treat pediatric diseases, with a special focus on pediatric cancer. It states the purpose and policy of the order, identifies pediatric cancer as a priority, and outlines a plan to promote cross-agency coordination, support research and innovation, enable data sharing, and address governance, safety, and privacy considerations in the use of AI to accelerate cures.",
    "link": "https://www.whitehouse.gov/presidential-actions/2025/09/unlocking-cures-for-pediatric-cancer-with-artificial-intelligence/"
  },
  {
    "title": "Executive Order to Assure the Security of the State of Qatar",
    "summary": "This executive order sets forth a policy to strengthen and maintain the bilateral security relationship between the United States and the State of Qatar, reflecting their long‑standing alliance. It directs executive branch departments and agencies to pursue actions that enhance security cooperation, coordinate defense and security‑related activities, and address shared security concerns to contribute to Qatar's security and regional stability. The order establishes a framework for implementing these objectives in accordance with U.S. law and international obligations.",
    "link": "https://www.whitehouse.gov/presidential-actions/2025/09/assuring-the-security-of-the-state-of-qatar/"
  },
  {
    "title": "National Security Presidential Memorandum 7: Countering Domestic Terrorism and Organized Political Violence",
    "summary": "This National Security Presidential Memorandum directs the Secretary of State, the Secretary of the Treasury, the Attorney General, and the Secretary of Homeland Security to coordinate and implement a government-wide policy framework aimed at countering domestic terrorism and organized political violence. The memorandum establishes that the executive branch will establish priorities, enable interagency collaboration, and enhance information sharing to address related threats, reflecting the President's authority to guide national security policy and actions across relevant departments.",
    "link": "https://www.whitehouse.gov/presidential-actions/2025/09/countering-domestic-terrorism-and-organized-political-violence/"
  },
  {
    "title": "Proclamation: Gold Star Mother's and Family's Day, 2025",
    "summary": "The President proclaims Gold Star Mother's and Family's Day for 2025, designating a day to recognize the memory of U.S. service members who died in the line of duty and to acknowledge and support the families who have lost loved ones. The proclamation describes the nation's obligation to memorialize fallen service members and encourages official observances and expressions of gratitude nationwide, including ceremonies and activities that involve Gold Star families.",
    "link": "https://www.whitehouse.gov/presidential-actions/2025/09/gold-star-mothers-and-familys-day-2025/"
  },
  {
    "title": "Presidential Action Designating Antifa as a Domestic Terrorist Organization",
    "summary": "This presidential action designates Antifa as a domestic terrorist organization and describes the group as advocating the overthrow of the United States government and law enforcement authorities. It notes that Antifa employs illegal means to organize and conduct a nationwide campaign of violence and terrorism, and it outlines the scope and potential enforcement and policy implications of the designation.",
    "link": "https://www.whitehouse.gov/presidential-actions/2025/09/designating-antifa-as-a-domestic-terrorist-organization/"
  },
  {
    "title": "Proclamation by the President Declaring National Hispanic Heritage Month, 2025",
    "summary": "A presidential proclamation designates National Hispanic Heritage Month and acknowledges the contributions of Hispanic-American citizens, both past and present. The proclamation describes their resilience and commitment to shared American values and notes the involvement of Hispanic-American patriots who have served in the U.S. military as part of their broader contributions to American society.",
    "link": "https://www.whitehouse.gov/presidential-actions/2025/09/national-hispanic-heritage-month-2025/"
  }
]