[
  {
    "title": "National Security Presidential Memorandum on Advancing 6G Technology and U.S. Global Competitiveness",
    "summary": "This memorandum directs federal departments and agencies to coordinate policy and actions to accelerate the research, development, and deployment of sixth-generation (6G) wireless technology in the United States. It addresses national security considerations, supply chain resilience, protection of critical infrastructure, and collaboration on standards and spectrum management. The memorandum also establishes interagency coordination mechanisms and timelines to promote international engagement and maintain U.S. leadership in 6G technology.",
    "link": "https://www.whitehouse.gov/presidential-actions/2025/12/national-security-presidential-memorandum-nspm-8-0bda/"
  },
  {
    "title": "Proclamation on Bill of Rights Day, 2025",
    "summary": "The President proclaims December 15, 2025, as Bill of Rights Day, acknowledging the historical significance of the Bill of Rights and the protections of civil liberties provided by the first ten amendments. The proclamation highlights the foundational role of these rights in promoting justice and self-government, and encourages education about the Constitution and its enduring principles, as well as observance of the day with activities that reflect on the protection of individual rights and the responsibilities of citizens and government.",
    "link": "https://www.whitehouse.gov/presidential-actions/2025/12/bill-of-rights-day-2025/"
  },
  {
    "title": "Executive Order Designating Fentanyl as a Weapon of Mass Destruction",
    "summary": "This executive action designates illicit fentanyl as a weapon of mass destruction, establishing the policy that illicit fentanyl is closer to a chemical weapon than a narcotic and invoking national security and law enforcement authorities to address its production, distribution, and use. The order references a small, trace quantity—two milligrams—as an example of the drug's potency and potential lethality. It directs federal agencies to take coordinated actions to counter illicit fentanyl as a WMD threat, including enforcement, regulatory, and interagency measures, and to implement the policy through subsequent rules and actions.",
    "link": "https://www.whitehouse.gov/presidential-actions/2025/12/designating-fentanyl-as-a-weapon-of-mass-destruction/"
  },
  {
    "title": "Executive Order to Address Foreign-Owned and Politically Motivated Proxy Advisory Firms and Protect American Investors",
    "summary": "The executive order establishes a policy to address concerns about proxy advisory firms that are owned by foreign entities and that may be politically motivated in their influence on U.S. investor voting decisions. It directs federal agencies to assess potential risks to American investors, review current regulatory frameworks governing proxy advisory firms, and consider steps to enhance transparency and accountability of these firms. The order aims to safeguard investor interests by examining the impact of proxy advisory recommendations on corporate governance and market integrity and to report findings with recommendations for any necessary regulatory or policy actions.",
    "link": "https://www.whitehouse.gov/presidential-actions/2025/12/protecting-american-investors-from-foreign-owned-and-politically-motivated-proxy-advisors/"
  },
  {
    "title": "Eliminating State Law Obstruction of a National Artificial Intelligence Policy",
    "summary": "This presidential action establishes a national policy framework for artificial intelligence and directs efforts to remove state laws that obstruct the national AI policy. It references Section 1, which states that United States leadership in artificial intelligence should promote national and economic security and leadership across multiple domains, and notes that the action is taken pursuant to Executive Order 14179 of January 23. The measure aims to coordinate federal AI policy and reduce legal barriers at the state level that impede implementation of the national AI policy.",
    "link": "https://www.whitehouse.gov/presidential-actions/2025/12/eliminating-state-law-obstruction-of-national-artificial-intelligence-policy/"
  }
]