[
  {
    "title": "Modifying Import Duties on Goods from the Government of the Russian Federation",
    "summary": "This presidential action modifies the tariff treatment of imports from the Government of the Russian Federation. It is issued under authorities including the International Emergency Economic Powers Act, the National Emergencies Act, and section 604 of the Trade Act of 1974. The action authorizes changes to duties and tariffs applicable to such imports as a response to national security and policy concerns related to the Government of the Russian Federation.",
    "link": "https://www.whitehouse.gov/presidential-actions/2026/02/modifying-duties-to-address-threats-to-the-united-states-by-the-government-of-the-russian-federation-04b2/"
  },
  {
    "title": "Executive Order Establishing a Strategy for United States Arms Transfers",
    "summary": "This executive order establishes a government-wide strategy to coordinate and prioritize the transfer and export of United States-made military equipment. It states the purpose of leveraging U.S.-made defense articles to support national security and economic objectives and to maximize the use of American-made defense articles in international arms transfers. The order provides policy direction and assigns interagency coordination to implement a comprehensive arms transfer strategy.",
    "link": "https://www.whitehouse.gov/presidential-actions/2026/02/establishing-an-america-first-arms-transfer-strategy/"
  },
  {
    "title": "Executive Order on Protecting the National Security and Welfare of the United States and Its Citizens from Criminal Actors and Other Public Safety Threats",
    "summary": "The executive order asserts the policy, grounded in presidential authority and statutory authority including 6 U.S.C. 122(a)(2), to safeguard the national security and welfare of the United States and its citizens from criminal actors and other public safety threats. It directs federal agencies to implement actions and measures aligned with this policy to protect public safety and national welfare.",
    "link": "https://www.whitehouse.gov/presidential-actions/2026/02/protecting-the-national-security-and-welfare-of-the-united-states-and-its-citizens-from-criminal-actors-and-other-public-safety-threats/"
  },
  {
    "title": "Administration Actions Governing Commercial Fishing in the Atlantic Ocean",
    "summary": "Describes February 2026 actions by the U.S. administration related to commercial fishing in the Atlantic Ocean. The page outlines policy changes, regulatory adjustments, and guidance intended to shape management of Atlantic fisheries, including considerations for industry activity, coastal economies, and environmental conservation.",
    "link": "https://www.whitehouse.gov/presidential-actions/2026/02/unleashing-american-commercial-fishing-in-the-atlantic/"
  },
  {
    "title": "Proclamation: Ensuring Affordable Beef for the American Consumer",
    "summary": "This presidential proclamation outlines the administration's policy objective to ensure affordable beef for American consumers. It notes the historical role of cattle ranchers in the United States and emphasizes the ongoing importance of beef in the American diet, while describing the purpose and scope of the related federal actions intended to promote affordability and maintain a stable beef supply.",
    "link": "https://www.whitehouse.gov/presidential-actions/2026/02/ensuring-affordable-beef-for-the-american-consumer/"
  },
  {
    "title": "Nomination of Michael McDonald to be Chairperson of the National Endowment for the Humanities for a four-year term, succeeding Shelly C. Lowe",
    "summary": "The White House announced that Michael McDonald, a resident of the District of Columbia, has been nominated to serve as chairperson of the National Endowment for the Humanities for a four-year term, succeeding Shelly C. Lowe. The nomination has been sent to the Senate as part of the president's nominations package.",
    "link": "https://www.whitehouse.gov/presidential-actions/2026/02/nominations-sent-to-the-senate-2f25/"
  }
]