[
  {
    "title": "Executive Order to Address Competition Between Large Investors and Main Street Homebuyers in the Residential Real Estate Market",
    "summary": "Issued January 2026, this executive action articulates the President's policy to reduce the competitive advantage of large institutional and Wall Street buyers in acquiring residential properties. It directs federal agencies to take coordinated actions to monitor and address effects on access to homeownership for individual buyers, and to implement steps that promote fair competition within the housing market. The order outlines sections including purpose and policy and calls for interagency collaboration to carry out related measures.",
    "link": "https://www.whitehouse.gov/presidential-actions/2026/01/stopping-wall-street-from-competing-with-main-street-homebuyers/"
  },
  {
    "title": "Proclamation designating National Day of Patriotic Devotion, 2026",
    "summary": "A presidential proclamation designating a National Day of Patriotic Devotion for 2026, noting the President's stated goals to reclaim national sovereignty, restore safety, rebalance the scales of justice, and rebuild the country, and encouraging government and citizens to observe the day with ceremonies and reflections.",
    "link": "https://www.whitehouse.gov/presidential-actions/2026/01/national-day-of-patriotic-devotion-2026/"
  },
  {
    "title": "Proclamation on Religious Freedom Day, 2026",
    "summary": "This Presidential Proclamation designates January 16, 2026 as Religious Freedom Day and reiterates the United States' commitment to protecting the free exercise of religion. It references 250 years of national history during which individuals have the right to practice their faith, follow their conscience, and worship freely and without fear. The proclamation emphasizes religious liberty as a foundational principle of the United States and calls for continued safeguarding of this right for all people.",
    "link": "https://www.whitehouse.gov/presidential-actions/2026/01/religious-freedom-day-2026/"
  },
  {
    "title": "Proclamation Adjusting Imports of Semiconductors, Semiconductor Manufacturing Equipment, and Their Derivative Products into the United States",
    "summary": "This proclamation notes that, pursuant to a Section 232 investigation, the Secretary of Commerce transmitted to the President on December 22, 2025 a report examining the national security effects of imports of semiconductors, semiconductor manufacturing equipment, and their derivative products. Based on the findings in that report, the President directs adjustments to imports of these items into the United States to address identified national security concerns.",
    "link": "https://www.whitehouse.gov/presidential-actions/2026/01/adjusting-imports-of-semiconductors-semiconductor-manufacturing-equipment-and-their-derivative-products-into-the-united-states/"
  },
  {
    "title": "Establishment of a Second Emergency Board to Investigate Disputes Between the Long Island Rail Road Company and Employees Represented by Specific Labor Organizations",
    "summary": "The action establishes a second emergency board under the Railway Labor Act to investigate and report on labor disputes between the Long Island Rail Road Company and certain of its employees represented by specified labor organizations. The board is authorized to examine the issues, gather and review relevant information, and issue findings and recommendations intended to facilitate a resolution of the disputes. The labor organizations named include the Transportation Communications Union, the Brotherhood of Locomotive Engineers and Trainmen, the Brotherhood of Railroad Signalmen, and the International Association of Machinists and Aerospace Workers, among others.",
    "link": "https://www.whitehouse.gov/presidential-actions/2026/01/establishing-a-second-emergency-board-to-investigate-disputes-between-the-long-island-rail-road-company-and-certain-of-its-employees-represented-by-certain-labor-organizations/"
  },
  {
    "title": "Proclamation Adjusting Imports of Processed Critical Minerals and Their Derivative Products into the United States",
    "summary": "A proclamation issued by the President under section 232 to adjust the importation of processed critical minerals and their derivative products into the United States. The action follows a report from the Secretary of Commerce, transmitted on October 24, 2025, evaluating the effects of such imports on national security. The proclamation implements measures to adjust import policies for processed critical minerals and their derivative products in order to address identified national security considerations.",
    "link": "https://www.whitehouse.gov/presidential-actions/2026/01/adjusting-imports-of-processed-critical-minerals-and-their-derivative-products-into-the-united-states/"
  },
  {
    "title": "Executive Order to Safeguard Venezuelan Oil Revenue Under the International Emergency Economic Powers Act and the National Emergencies Act",
    "summary": "This executive order, issued by the President, relies on authorities provided by the International Emergency Economic Powers Act (IEEPA), the National Emergencies Act (NEA), and section 301 of title 3 of the United States Code to implement measures aimed at safeguarding the revenue generated from Venezuela's oil sector. The order directs relevant federal agencies to take actions to protect the integrity of Venezuelan oil revenues and to ensure they are managed in a manner consistent with U.S. policy toward Venezuela and in the interests of the American and Venezuelan people. It outlines the scope of the authorities granted, potential enforcement tools, and the framework for implementing and supervising the measures.",
    "link": "https://www.whitehouse.gov/presidential-actions/2026/01/safeguarding-venezuelan-oil-revenue-for-the-good-of-the-american-and-venezuelan-people/"
  }
]