[
  {
    "title": "Proclamation on Religious Freedom Day, 2026",
    "summary": "This presidential proclamation designates Religious Freedom Day for 2026 and acknowledges the United States' longstanding commitment to religious liberty. It states that every person has the right to practice their faith, follow their conscience, and worship freely and without fear. The document references the nation's 250-year history of protecting this freedom and expresses the administration's intent to honor and support the free exercise of religion across the country.",
    "link": "https://www.whitehouse.gov/presidential-actions/2026/01/religious-freedom-day-2026/"
  },
  {
    "title": "Proclamation Adjusting Imports of Semiconductors, Semiconductor Manufacturing Equipment, and Their Derivative Products into the United States",
    "summary": "A presidential proclamation issued under Section 232 of the Trade Expansion Act of 1962. It notes that on December 22, 2025, the Secretary of Commerce transmitted to the President a report evaluating the national security implications of imports of semiconductors, semiconductor manufacturing equipment, and their derivative products. Based on the findings, the proclamation declares adjustments to the importation of these items into the United States to address the identified national security considerations and directs applicable federal agencies to implement and enforce the measures. The proclamation outlines the scope, timing, and any transitional provisions associated with the adjustments as permitted by law.",
    "link": "https://www.whitehouse.gov/presidential-actions/2026/01/adjusting-imports-of-semiconductors-semiconductor-manufacturing-equipment-and-their-derivative-products-into-the-united-states/"
  },
  {
    "title": "Establishing a Second Emergency Board to Investigate Disputes Involving the Long Island Rail Road Company and Employees Represented by Specified Labor Organizations",
    "summary": "Under the Railway Labor Act, the President establishes a second emergency board to investigate the disputes between the Long Island Rail Road Company and certain of its employees who are represented by the Transportation Communications Union, the Brotherhood of Locomotive Engineers and Trainmen, the Brotherhood of Railroad Signalmen, the International Association of Machinists and Aerospace Workers, and the International Brotherhood of Electrical Workers. The board is authorized to examine the issues in dispute, gather relevant information, potentially hear testimony, and prepare a report with findings and recommendations intended to facilitate resolution of the disputes and inform subsequent negotiations or actions.",
    "link": "https://www.whitehouse.gov/presidential-actions/2026/01/establishing-a-second-emergency-board-to-investigate-disputes-between-the-long-island-rail-road-company-and-certain-of-its-employees-represented-by-certain-labor-organizations/"
  },
  {
    "title": "Proclamation Adjusting Imports of Processed Critical Minerals and Their Derivative Products into the United States",
    "summary": "This presidential proclamation implements adjustments to the importation of processed critical minerals and their derivative products (PCMDPs) into the United States, based on the Secretary of Commerce's report on the effects of such imports on national security transmitted to the President on October 24, 2025, under section 232. The proclamation describes the scope of the adjustments and the rationale rooted in national security considerations, reflecting the administration's response to the ongoing section 232 investigation.",
    "link": "https://www.whitehouse.gov/presidential-actions/2026/01/adjusting-imports-of-processed-critical-minerals-and-their-derivative-products-into-the-united-states/"
  },
  {
    "title": "Executive Order to Safeguard Venezuelan Oil Revenue for the Benefit of the American and Venezuelan People",
    "summary": "The executive order asserts the President's authority under the International Emergency Economic Powers Act (IEEPA), the National Emergencies Act (NEA), and section 301 of title 3, United States Code, to take actions aimed at safeguarding revenue from Venezuelan oil. It directs applicable federal agencies to implement and enforce measures intended to protect such revenue and to ensure that it is used in accordance with U.S. policy to support the welfare of the American and Venezuelan people. The order establishes the framework for interagency coordination, enforcement, and the actions necessary to carry out these objectives.",
    "link": "https://www.whitehouse.gov/presidential-actions/2026/01/safeguarding-venezuelan-oil-revenue-for-the-good-of-the-american-and-venezuelan-people/"
  },
  {
    "title": "Executive Order Under the Defense Production Act Regarding the Acquisition of Certain Assets of Emcore Corporation by Hiefo Corporation",
    "summary": "Under the authority vested in the President by the Constitution and the Defense Production Act of 1950, as amended (section 721), this executive order directs the acquisition by Hiefo Corporation of certain assets of Emcore Corporation. The order includes a Findings section indicating there is credible evidence supporting the action. It directs relevant federal agencies to take the necessary measures to effectuate the transfer of the specified assets, establishes any conditions or restrictions as required, and ensures compliance with applicable laws and regulations. The order also calls for oversight, reporting, and coordination to address national security, defense, or critical economic interests related to the assets involved.",
    "link": "https://www.whitehouse.gov/presidential-actions/2026/01/regarding-the-acquisition-of-certain-assets-of-emcore-corporation-by-hiefo-corporation/"
  }
]