[
  {
    "title": "Proclamation on the Designation of Tren de Aragua as a Foreign Terrorist Organization",
    "summary": "This proclamation states that Tren de Aragua (TdA) has been identified as a Foreign Terrorist Organization by the U.S. government. It notes that the group has a significant number of members who have allegedly entered the United States unlawfully and are accused of engaging in various hostile activities against the country. Additionally, the proclamation outlines the perceived threats posed by TdA's operations in conjunction with other criminal organizations.",
    "link": "https://www.whitehouse.gov/presidential-actions/2025/03/invocation-of-the-alien-enemies-act-regarding-the-invasion-of-the-united-states-by-tren-de-aragua/"
  },
  {
    "title": "Memorandum on the Enforcement of Federal Rule of Civil Procedure 65(c)",
    "summary": "This memorandum addresses the enforcement of Federal Rule of Civil Procedure 65(c), highlighting concerns regarding the issuance of broad injunctions by activist organizations. It emphasizes the need for adherence to the established guidelines set forth by the Federal Rules in order to ensure that relief granted is within the appropriate scope. The memorandum outlines the role of executive departments and agencies in maintaining the integrity of this legal provision.",
    "link": "https://www.whitehouse.gov/presidential-actions/2025/03/ensuring-the-enforcement-of-federal-rule-of-civil-procedure-65c/"
  },
  {
    "title": "Nominations for Various Government Positions Submitted to the Senate",
    "summary": "This document details the nominations forwarded to the Senate for confirmation. Included are Richard Anderson, nominated to serve as Assistant Secretary of the Air Force, and John Arrigo, nominated to be the Ambassador Extraordinary and Plenipotentiary to the Portuguese Republic, among others. The nominations are part of the standard process for filling key government roles and require Senate confirmation to take effect.",
    "link": "https://www.whitehouse.gov/presidential-actions/2025/03/nominations-sent-to-the-senate-8355/"
  },
  {
    "title": "Restoration of the Public Service Loan Forgiveness Program",
    "summary": "This executive order aims to restore and enhance the Public Service Loan Forgiveness (PSLF) Program, originally established by Congress in 2007. The PSLF Program was designed to incentivize individuals to pursue careers in public service by offering student loan forgiveness after specific conditions are met. The order outlines the administration's commitment to support public service professionals and improve access to loan forgiveness, thereby encouraging more Americans to choose careers that support their communities.",
    "link": "https://www.whitehouse.gov/presidential-actions/2025/03/restoring-public-service-loan-forgiveness/"
  },
  {
    "title": "Creation of the White House Task Force for the FIFA World Cup 2026",
    "summary": "This executive order establishes a task force within the White House to coordinate efforts and preparations for the FIFA World Cup 2026, which the United States will co-host. The task force is intended to ensure effective planning and collaboration among various government agencies and stakeholders in anticipation of the event. It highlights the significance of the FIFA Club World Cup 2025 and the FIFA World Cup 2026 as major international sporting events taking place in the United States.",
    "link": "https://www.whitehouse.gov/presidential-actions/2025/03/establishing-the-white-house-task-force-on-the-fifa-world-cup-2026/"
  }
]