[
  {
    "title": "Memorandum on Addressing Misleading Direct-to-Consumer Prescription Drug Advertisements",
    "summary": "This White House memorandum notes that the Food and Drug Administration has had authority to regulate prescription drug advertising since 1962. It highlights concerns that direct-to-consumer advertisements can mislead consumers about a drug's risks and benefits, encourage medication use over lifestyle changes, inappropriately affect the physician-patient relationship, and favor more expensive drugs over cheaper alternatives. The memorandum directs federal health agencies to assess current practices and consider steps to address these issues to improve accuracy, consumer protection, and regulatory effectiveness.",
    "link": "https://www.whitehouse.gov/presidential-actions/2025/09/memorandum-for-the-secretary-of-health-and-human-services-the-commissioner-of-food-and-drugs/"
  },
  {
    "title": "Executive Order to Restore the United States Department of War",
    "summary": "This presidential action directs the restoration of the United States Department of War, outlining the rationale and historical context for reestablishing the department. The document notes that, on August 7, 1789, President George Washington signed legislation establishing the department to oversee its operations and maintenance, and it describes the steps and authorities involved in reestablishing the department's status within the federal government.",
    "link": "https://www.whitehouse.gov/presidential-actions/2025/09/restoring-the-united-states-department-of-war/"
  },
  {
    "title": "Executive Order Modifying the Scope of Reciprocal Tariffs and Establishing Procedures for Implementing Trade and Security Agreements",
    "summary": "This presidential action, issued under authorities including the International Emergency Economic Powers Act, the National Emergencies Act, and section 232 of the Trade Expansion Act of 1962, modifies the scope of reciprocal tariffs and establishes the procedures for implementing trade and security agreements. The action defines the framework and responsibilities for applying reciprocal tariff measures and for implementing related trade and security arrangements, outlining the agencies involved and the process by which such measures and agreements are developed, coordinated, and implemented.",
    "link": "https://www.whitehouse.gov/presidential-actions/2025/09/modifying-the-scope-of-reciprocal-tariffs-and-establishing-procedures-for-implementing-trade-and-security-agreements/"
  },
  {
    "title": "Executive Order to Strengthen Protection of U.S. Nationals from Wrongful Detention Abroad",
    "summary": "An executive order issued by the President under the Constitution and the Levinson Hostage Recovery and Hostage-Taking Accountability Act (22 U.S.C. 1741 et seq.) to authorize and guide federal government efforts to protect U.S. nationals from wrongful detention abroad. The portion of the text provided includes Section 1, titled Purpose, which states that the United States must strengthen efforts to protect U.S. nationals from wrongful detention abroad. The order signals an intent to enhance policy, coordination, and response capabilities across relevant federal agencies to deter, prevent, and respond to wrongful detentions, consistent with the Levinson Act's objectives. The full set of measures is not detailed in the excerpt.",
    "link": "https://www.whitehouse.gov/presidential-actions/2025/09/strengthening-efforts-to-protect-u-s-nationals-from-wrongful-detention-abroad/"
  },
  {
    "title": "Nominations Sent to the Senate for Commissioner of Labor Statistics, Federal Maritime Commissioner, and Assistant Secretary Positions",
    "summary": "The White House announced nominations sent to the Senate for three positions: Erwin Antoni, of Pennsylvania, to be Commissioner of the Bureau of Labor Statistics, Department of Labor, for a four-year term, succeeding Erika L. McEntarfer; Laura DiBella, of Florida, to be Federal Maritime Commissioner for a term expiring June 30, 2028, succeeding L. E. Sola; and Steven Haines, of Virginia, to be an Assistant Secretary. The information was published on the White House website in the Nominations Sent to the Senate post.",
    "link": "https://www.whitehouse.gov/presidential-actions/2025/09/nominations-sent-to-the-senate-f7c7/"
  },
  {
    "title": "Executive Action on Federal Civic Architecture and Design",
    "summary": "A presidential action that asserts the authority to establish policy regarding the design and aesthetics of federal civic architecture. It references the Founders' emphasis on public buildings and states the purpose to have federal architecture inspire the American people and support civic life. The document begins with a section labeled 'Section 1. Purpose' and outlines the rationale for pursuing changes to how federal architecture is presented and implemented, with the aim of guiding subsequent policy and actions related to the appearance of federal facilities.",
    "link": "https://www.whitehouse.gov/presidential-actions/2025/08/making-federal-architecture-beautiful-again/"
  },
  {
    "title": "Proclamation on Overdose Prevention Week, 2025",
    "summary": "The President proclaims Overdose Prevention Week 2025 as a national observance addressing the overdose crisis as a significant public health issue. The proclamation emphasizes the safety, health, and well-being of the American people and outlines efforts to raise awareness, disseminate prevention resources, support evidence-based treatment and recovery services, and coordinate with federal, state, and local partners to reduce overdose deaths and assist affected families.",
    "link": "https://www.whitehouse.gov/presidential-actions/2025/08/overdose-prevention-week-2025/"
  },
  {
    "title": "Labor Day, 2025 Proclamation",
    "summary": "The President proclaims Labor Day, 2025 as a day to recognize and honor the contributions of American workers. The proclamation notes that the nation's progress has been shaped by the skill, determination, and resilience of workers—from the earliest settlers to pioneers and innovators—and calls for nationwide observance and reflection on the importance of workers' contributions to the country's development and prosperity.",
    "link": "https://www.whitehouse.gov/presidential-actions/2025/08/labor-day-2025/"
  }
]