[
  {
    "title": "Executive Order on Promoting Safe and Stable Families and Strengthening Foster Care",
    "summary": "This presidential executive order establishes the administration's policy to empower mothers and fathers to raise their children in safe and loving homes and to address circumstances in which crises disrupt family life. It delineates the purpose and policy section, emphasizing support for families and the strengthening of the foster care system to assist American children and families during times of instability. The order directs federal agencies to take actions aligned with stabilizing family environments, improving foster care processes, and coordinating related resources to promote the well-being of children and families across the nation.",
    "link": "https://www.whitehouse.gov/presidential-actions/2025/11/fostering-the-future-for-american-children-and-families/"
  },
  {
    "title": "Proclamation: Anti-Communism Week, 2025",
    "summary": "The proclamation designates Anti-Communism Week for 2025 and states that the United States observes this period to reflect on the historical consequences associated with communist ideologies. It references that more than 100 million lives have been claimed by regimes that pursued communist governance. The document frames the observance as a national moment for remembrance and historical reflection.",
    "link": "https://www.whitehouse.gov/presidential-actions/2025/11/anti-communism-week-2025/"
  },
  {
    "title": "Nominations Sent to the Senate for Assistant Attorney General, Bureau of Land Management Director, and Nuclear Regulatory Commission Member",
    "summary": "The White House announced that three nominations have been sent to the United States Senate for consideration. Daniel E. Burrows, of Colorado, is nominated to be an Assistant Attorney General, to fill the vacancy created by the resignation of Aaron Reitz. Stevan Pearce, of New Mexico, is nominated to be Director of the Bureau of Land Management, to fill the vacancy created by the resignation of Tracy Stone-Manning. Douglas Weaver, of Maryland, is nominated to be a member of the Nuclear Regulatory Commission for the remainder of the term expiring June 30, with the exact year not specified in the excerpt. This action is part of the administration's process of filling high-level civil service positions subject to Senate confirmation, and the notice is titled Nominations Sent to the Senate.",
    "link": "https://www.whitehouse.gov/presidential-actions/2025/11/nominations-sent-to-the-senate-099e/"
  },
  {
    "title": "Nominations of Michael Selig for Chairman and Commissioner of the Commodity Futures Trading Commission; Withdrawal of Joel Rayburn from Senate consideration",
    "summary": "The White House announced nominations to the Senate for Michael Selig, of Florida, to be Chairman of the Commodity Futures Trading Commission, to succeed Rostin Behnam, and to be a Commissioner of the CFTC for a term expiring April 13, 2029, to succeed Christy Goldsmith Romero (term expired). The release also notes a withdrawal sent to the Senate for Joel Rayburn.",
    "link": "https://www.whitehouse.gov/presidential-actions/2025/10/nominations-and-withdrawal-sent-to-the-senate/"
  },
  {
    "title": "Proclamation by the President on Regulatory Relief for Certain Stationary Sources to Promote American Mineral Security",
    "summary": "This proclamation discusses the importance of copper to the United States' energy, defense, and manufacturing sectors, including its role in the electric grid and in semiconductors. It asserts that maintaining and expanding domestic copper smelting capacity is essential to reduce dependence on foreign supply chains. The proclamation outlines the use of regulatory relief for certain stationary sources as a policy tool to support American mineral security, with the stated objective of facilitating domestic mineral production while maintaining applicable health, safety, and environmental protections to the extent practicable. It directs relevant federal agencies to consider and implement measures to streamline permitting, compliance, or other regulatory processes for eligible stationary sources as part of efforts to bolster resilience of critical infrastructure and supply chains. The proclamation emphasizes coordination with stakeholders to ensure transparent and orderly implementation.",
    "link": "https://www.whitehouse.gov/presidential-actions/2025/10/regulatory-relief-for-certain-stationary-sources-to-promote-american-mineral-security/"
  }
]