[
  {
    "title": "Executive Order on Enhancing American Seafood Industry Competitiveness",
    "summary": "This executive order addresses the management and enhancement of the United States' seafood industry, which encompasses over 4 million square miles of fishing grounds. The order outlines the federal government's role in strengthening the competitiveness of American seafood producers and ensuring sustainable practices within the industry. It supports efforts to improve economic opportunities for those involved in seafood production and seeks to bolster the overall framework for seafood harvesting and processing in the United States.",
    "link": "https://www.whitehouse.gov/presidential-actions/2025/04/restoring-american-seafood-competitiveness/"
  },
  {
    "title": "Proclamation for the 250th Anniversary of the Battles of Lexington and Concord",
    "summary": "This proclamation marks the 250th anniversary of the Battles of Lexington and Concord, significant events in American history that took place during the early stages of the Revolutionary War. It acknowledges the role of early American patriots who engaged in these battles and recognizes their contributions to the pursuit of independence. The proclamation reflects on the historical importance of these battles and honors the memories of those who fought for freedom.",
    "link": "https://www.whitehouse.gov/presidential-actions/2025/04/250th-anniversary-of-the-battles-of-lexington-and-concord/"
  },
  {
    "title": "Extension of Federal Civilian Employee Hiring Freeze",
    "summary": "This memorandum issued by the President extends the existing hiring freeze for Federal civilian employees until July 15, 2025. The action is taken under the authority of the President, as provided by the U.S. Constitution and federal laws. The memorandum directs heads of executive departments and agencies to continue adhering to the hiring restrictions during this period.",
    "link": "https://www.whitehouse.gov/presidential-actions/2025/04/extension-of-hiring-freeze/"
  },
  {
    "title": "Proclamation on the Pacific Remote Islands Marine National Monument",
    "summary": "This proclamation addresses the Pacific Remote Islands Marine National Monument (PRIMNM), which was originally established on January 6, 2009, and later expanded on September 25, 2014. The proclamation aims to provide context regarding the monument's establishment and its significance in the management of marine resources in the region.",
    "link": "https://www.whitehouse.gov/presidential-actions/2025/04/unleashing-american-commercial-fishing-in-the-pacific/"
  },
  {
    "title": "Executive Order on Federal Office Space Management",
    "summary": "This Executive Order outlines the objectives and framework for the management of federal office space across the United States, addressing the need for efficient and cost-effective service delivery to the American populace. It emphasizes the importance of adapting federal space usage to accommodate the diverse needs of citizens in various geographic areas, including urban, suburban, and rural locations. The order aims to improve the quality and efficiency of federal services through effective space management practices.",
    "link": "https://www.whitehouse.gov/presidential-actions/2025/04/restoring-common-sense-to-federal-office-space-management/"
  },
  {
    "title": "Executive Order on National Security and Economic Resilience Regarding Processed Critical Minerals",
    "summary": "This Executive Order outlines the policy aimed at strengthening national defense through improved economic resilience and price stability, specifically addressing processed critical minerals and their derivative products. It invokes the authority granted by the Constitution and the Trade Expansion Act of 1962 to implement actions under Section 232, focusing on measures to secure the supply and enhance the processing of these minerals vital for national security.",
    "link": "https://www.whitehouse.gov/presidential-actions/2025/04/ensuring-national-security-and-economic-resilience-through-section-232-actions-on-processed-critical-minerals-and-derivative-products/"
  },
  {
    "title": "Executive Order to Address Prescription Drug Prices",
    "summary": "This executive order outlines the administration's commitment to reducing prescription drug prices for American patients. It highlights previous actions taken during the President's first term aimed at making medications more affordable and emphasizes ongoing efforts to prioritize the health and well-being of Americans. The order establishes new measures and strategies to continue progress towards lowering drug costs, targeting issues related to accessibility and affordability.",
    "link": "https://www.whitehouse.gov/presidential-actions/2025/04/lowering-drug-prices-by-once-again-putting-americans-first/"
  },
  {
    "title": "Improving Efficiency in Federal Procurement Processes",
    "summary": "This Executive Order aims to address the inefficiencies and high costs associated with federal procurement by the United States government, which is recognized as the largest buyer of goods and services globally. The order emphasizes the need for reforms to streamline procurement practices, making it easier and more efficient for businesses to engage in contracts with the federal government. The overarching goal is to create a more effective procurement system that encourages participation and enhances the overall effectiveness of federal spending.",
    "link": "https://www.whitehouse.gov/presidential-actions/2025/04/restoring-common-sense-to-federal-procurement/"
  },
  {
    "title": "Directive on Restrictions for Social Security Benefits Related to Immigration Status",
    "summary": "This memorandum addresses measures aimed at preventing individuals without legal immigration status from receiving Social Security Act benefits. It outlines the responsibilities of various federal departments and agencies, including the Attorney General and the Secretaries of Labor, Health and Human Services, and Homeland Security, to ensure compliance with this directive. The memorandum emphasizes the need for cooperation among these agencies to implement effective policies pertaining to the eligibility criteria for Social Security benefits in relation to immigration status.",
    "link": "https://www.whitehouse.gov/presidential-actions/2025/04/preventing-illegal-aliens-from-obtaining-social-security-act-benefits/"
  }
]