[
  {
    "title": "Proclamation: Regulatory Relief for Certain Stationary Sources to Promote American Mineral Security",
    "summary": "The proclamation emphasizes the critical role of copper in the energy, defense, and manufacturing sectors of the United States and its importance for national security. It notes the goal of maintaining and increasing domestic copper smelting capacity to reduce dependence on foreign supply chains and describes regulatory relief for certain stationary sources as a measure to promote American mineral security and to support domestic mineral production and processing.",
    "link": "https://www.whitehouse.gov/presidential-actions/2025/10/regulatory-relief-for-certain-stationary-sources-to-promote-american-mineral-security/"
  },
  {
    "title": "Nomination of Jennifer Wicks McNamara to serve as Ambassador Extraordinary and Plenipotentiary of the United States to the Socialist Republic of Vietnam",
    "summary": "Jennifer Wicks McNamara, of Virginia, has been nominated by the President to serve as the United States ambassador to the Socialist Republic of Vietnam. The nomination has been transmitted to the United States Senate for its advice and consent, and would authorize her to represent the United States as ambassador there upon approval.",
    "link": "https://www.whitehouse.gov/presidential-actions/2025/10/nomination-sent-to-the-senate/"
  },
  {
    "title": "Proclamation Declaring National Day of Remembrance for Charlie Kirk",
    "summary": "The President issued a proclamation declaring a National Day of Remembrance in response to the death of Charlie Kirk on September 10, 2025. The proclamation designates a day for national observance intended to reflect on the life of Charlie Kirk, acknowledge the impact of the events, and directs federal and local authorities to facilitate appropriate observances and communications.",
    "link": "https://www.whitehouse.gov/presidential-actions/2025/10/national-day-of-remembrance-for-charlie-kirk/"
  }
]