[
  {
    "title": "Presidential Proclamation Honoring the Memory of Charlie Kirk and Directing the Flag to be Flown at Half-Staff",
    "summary": "A presidential proclamation issued under the authority of the Constitution and laws of the United States to recognize the memory of Charlie Kirk. The proclamation directs that the flag of the United States be flown at half-staff for a designated period as a mark of respect.",
    "link": "https://www.whitehouse.gov/presidential-actions/2025/09/honoring-the-memory-of-charlie-kirk/"
  },
  {
    "title": "Presidential Action Implementing the United States–Japan Agreement",
    "summary": "This presidential action announces the implementation of the United States–Japan Agreement under authorities including the International Emergency Economic Powers Act, the National Emergencies Act, and section 232 of the Trade Expansion Act of 1962. It directs the heads of relevant federal agencies to take the necessary steps to carry out the agreement, including issuing implementing measures such as regulations and licenses, coordinating related regulatory actions, and reporting on the status of implementation. The action situates the measures within existing legal authorities and provides the general framework for administering and enforcing the agreement.",
    "link": "https://www.whitehouse.gov/presidential-actions/2025/09/implementing-the-united-states-japan-agreement/"
  },
  {
    "title": "Tammy Bruce Nominated as Deputy Representative of the United States to the United Nations with Ambassadorial Rank",
    "summary": "The White House announces a nomination of Tammy Bruce, of California, to serve as Deputy Representative of the United States to the United Nations, with the rank and status of Ambassador Extraordinary and Plenipotentiary. The nomination also designates her as the Deputy Representative of the United States to the United Nations Security Council and contemplates concurrent service in another role without additional compensation, though the exact nature of that concurrent role is not specified in the provided excerpt. The nomination has been sent to the Senate for consideration.",
    "link": "https://www.whitehouse.gov/presidential-actions/2025/09/nominations-sent-to-the-senate-8a96/"
  }
]