[
  {
    "title": "Establishment of a Strategic Bitcoin Reserve and United States Digital Asset Stockpile",
    "summary": "This executive order outlines the establishment of a Strategic Bitcoin Reserve, aimed at creating a stockpile of digital assets for the United States. It presents the rationale for this initiative, emphasizing the specifics of Bitcoin as a cryptocurrency, including its capped supply and security features. The order seeks to enhance the government's approach to digital assets and cryptocurrency management, ensuring a strategic framework is developed for their oversight and utilization.",
    "link": "https://www.whitehouse.gov/presidential-actions/2025/03/establishment-of-the-strategic-bitcoin-reserveand-united-states-digital-asset-stockpile/"
  },
  {
    "title": "Modification of Import Duties to Tackle Illicit Drug Trafficking at the Southern Border",
    "summary": "This executive order announces changes to the import duties imposed on certain goods as part of efforts to address the trafficking of illicit drugs across the southern border of the United States. The order is issued under the authority granted by multiple laws designed to manage economic emergencies, and aims to enhance enforcement measures combating drug-related issues in the region. The specific adjustments to duties are intended to mitigate the flow of illegal substances while ensuring compliance with existing trade regulations.",
    "link": "https://www.whitehouse.gov/presidential-actions/2025/03/amendment-to-duties-to-address-the-flow-of-illicit-drugs-across-our-southern-border/"
  },
  {
    "title": "Executive Order on Examining Activities of Perkins Coie LLP",
    "summary": "This executive order addresses concerns related to the law firm Perkins Coie LLP, citing allegations of improper conduct that have purportedly influenced the political landscape over several years. The order highlights specific instances and outlines the administration's intentions to investigate and address the associated risks stemming from the firm's activities.",
    "link": "https://www.whitehouse.gov/presidential-actions/2025/03/addressing-risks-from-perkins-coie-llp/"
  },
  {
    "title": "Amendment to Customs Duties to Mitigate Illicit Drug Trafficking Across the Northern Border",
    "summary": "This executive order, issued by the President of the United States, outlines amendments to existing customs duties aimed at addressing the flow of illicit drugs entering the country via the northern border. The action is taken under the authority of several federal laws, including the International Emergency Economic Powers Act and the National Emergencies Act. The order is part of a broader effort to enhance border security measures and public health initiatives in relation to substance abuse and trafficking.",
    "link": "https://www.whitehouse.gov/presidential-actions/2025/03/amendment-to-duties-to-address-the-flow-of-illicit-drugs-across-our-northern-border-0c3c/"
  },
  {
    "title": "Executive Order on Immigration Policy Changes",
    "summary": "This Executive Order outlines a new approach to immigration policy, reflecting a shift from the previous administration's strategies. It highlights the intention to address issues caused by past immigration policies, which are stated to have resulted in negative impacts and suffering within the nation. The order sets forth the administration's commitment to reforming immigration practices to better serve the needs of the nation and its citizens.",
    "link": "https://www.whitehouse.gov/presidential-actions/2025/03/honoring-jocelyn-nungaray/"
  },
  {
    "title": "Amendment to Duties Regarding Conditions at the Southern Border",
    "summary": "This executive order outlines amendments to the responsibilities and processes related to addressing the circumstances at the southern border of the United States. It is issued under various legal authorities, including the International Emergency Economic Powers Act and the National Emergencies Act, among others. The order emphasizes federal measures aimed at managing the situation effectively and may include provisions for resource allocation and coordination among federal agencies.",
    "link": "https://www.whitehouse.gov/presidential-actions/2025/03/amendment-to-duties-to-address-the-situation-at-our-southern-border/"
  },
  {
    "title": "Amendment to Customs Duties Related to Illicit Drug Trafficking along the Northern Border",
    "summary": "This executive order outlines amendments to customs duties intended to combat the trafficking of illicit drugs across the northern border of the United States. It highlights the legal authority granted to the President to implement measures aimed at addressing this issue under various federal laws, including the International Emergency Economic Powers Act and the National Emergencies Act. The order emphasizes the government's commitment to curbing drug flow and enhancing border security through strategic adjustments to customs regulations.",
    "link": "https://www.whitehouse.gov/presidential-actions/2025/03/amendment-to-duties-to-address-the-flow-of-illicit-drugs-across-our-northern-border/"
  }
]