[
  {
    "title": "Nominations Sent to the Senate for Federal Agency Leadership Positions",
    "summary": "The White House announced multiple nominations to the Senate for appointment to federal leadership roles. The nominations listed include Robert Cekada for Director of the Bureau of Alcohol, Tobacco, Firearms, and Explosives; Carter Crow for General Counsel of the Equal Employment Opportunity Commission for a four-year term; Stuart Levenbach for Director of the Bureau of Consumer Financial Protection for a five-year term; and David Clay Fowlkes, among additional nominees.",
    "link": "https://www.whitehouse.gov/presidential-actions/2025/11/nominations-sent-to-the-senate-d2ae/"
  },
  {
    "title": "Proclamation: National Adoption Month, 2025",
    "summary": "The proclamation designates November 2025 as National Adoption Month. It states that every child deserves a safe and nurturing home, and that adoption provides stability and belonging for children in need. The proclamation commends adoptive parents and families and outlines a role for federal agencies in promoting adoption, supporting prospective and current adoptive families, and advancing related policies and resources. It also encourages communities and individuals to participate in activities and programs that support adoption and to recognize the contributions of adoptive families.",
    "link": "https://www.whitehouse.gov/presidential-actions/2025/11/national-adoption-month-2025/"
  },
  {
    "title": "Executive Order to Promote Safe and Loving Homes for Children and Strengthen Foster Care",
    "summary": "This executive order establishes federal policy to support parents in raising children in safe and loving homes and directs federal agencies to address situations where crises disrupt family caregiving by supporting and reforming the foster care system to safeguard the well-being of children.",
    "link": "https://www.whitehouse.gov/presidential-actions/2025/11/fostering-the-future-for-american-children-and-families/"
  },
  {
    "title": "Proclamation: Anti-Communism Week, 2025",
    "summary": "This presidential proclamation designates Anti-Communism Week for 2025 and calls for nationwide observance and reflection on the impacts of communist ideologies. It notes that communism has caused severe suffering and loss of life across continents and generations, citing a figure of more than 100 million deaths attributed to regimes associated with communism, and it emphasizes remembering the victims and acknowledging the consequences of these regimes.",
    "link": "https://www.whitehouse.gov/presidential-actions/2025/11/anti-communism-week-2025/"
  },
  {
    "title": "Nominations Sent to the Senate for Confirmation: Daniel E. Burrows for Assistant Attorney General; Stevan Pearce for Director of the Bureau of Land Management; Douglas Weaver for Nuclear Regulatory Commission",
    "summary": "The White House announced nominations to be transmitted to the Senate for confirmation to fill three federal positions: Daniel E. Burrows, of Colorado, for Assistant Attorney General; Stevan Pearce, of New Mexico, for Director of the Bureau of Land Management; and Douglas Weaver, of Maryland, for a seat on the Nuclear Regulatory Commission for the remainder of the term expiring June 30. The nominations were transmitted to the Senate for consideration.",
    "link": "https://www.whitehouse.gov/presidential-actions/2025/11/nominations-sent-to-the-senate-099e/"
  }
]