[
  {
    "title": "Amendment to Duties Regarding Border Management",
    "summary": "This executive order outlines amendments to various duties related to managing and addressing issues at the southern border of the United States. It is issued under the authority of the President and cites several legal frameworks that support the actions being taken. The order aims to enhance the government's ability to respond to the current situation at the border, aligning with national security and economic considerations as governed by existing laws.",
    "link": "https://www.whitehouse.gov/presidential-actions/2025/03/amendment-to-duties-to-address-the-situation-at-our-southern-border/"
  },
  {
    "title": "Amendment to Customs Duties to Manage Illicit Drug Trafficking at the Northern Border",
    "summary": "This executive order issued by the President addresses the flow of illicit drugs across the northern border of the United States. It highlights the legal authority under which the order is enacted, specifically referencing the International Emergency Economic Powers Act, the National Emergencies Act, and relevant sections of the Trade Act of 1974. The order outlines measures aimed at adjusting customs duties as a means to enhance enforcement against drug trafficking activities and mitigate their impact on public health and safety.",
    "link": "https://www.whitehouse.gov/presidential-actions/2025/03/amendment-to-duties-to-address-the-flow-of-illicit-drugs-across-our-northern-border/"
  },
  {
    "title": "Initiation of Cost Efficiency Initiative for Federal Government Spending",
    "summary": "This executive order outlines the establishment of a new initiative aimed at transforming federal spending practices related to contracts, grants, and loans. The purpose of this order is to enhance the transparency of government spending and ensure accountability among government employees to the public. The order signifies a commitment to improving cost efficiency and optimizing resource allocation within the federal government.",
    "link": "https://www.whitehouse.gov/presidential-actions/2025/02/implementing-the-presidents-department-of-government-efficiency-cost-efficiency-initiative/"
  }
]