[
  {
    "title": "Enhancing Healthcare Transparency through Patient Empowerment",
    "summary": "This executive order aims to improve transparency in healthcare pricing to assist patients in making informed decisions regarding their healthcare. The initiative is focused on providing clear, accurate, and actionable information about healthcare costs, thereby enabling patients to understand their financial responsibilities in accessing medical services. It reflects the administration's commitment to addressing longstanding issues within the healthcare system related to pricing and patient empowerment.",
    "link": "https://www.whitehouse.gov/presidential-actions/2025/02/making-america-healthy-again-by-empowering-patients-with-clear-accurate-and-actionable-healthcare-pricing-information/"
  },
  {
    "title": "Suspension of Security Clearances and Review of Government Contracts",
    "summary": "This memorandum addresses the temporary suspension of security clearances for certain personnel and outlines the procedure for evaluating government contracts. It is directed to various key officials, including the Secretary of State, Secretary of Defense, Attorney General, and others involved in national security and government operations. The intent is to assess the implications of these suspensions on national security and operational effectiveness as well as to ensure compliance with relevant regulations and standards.",
    "link": "https://www.whitehouse.gov/presidential-actions/2025/02/suspension-of-security-clearances-and-evaluation-of-government-contracts/"
  },
  {
    "title": "Executive Order on National Security and Copper Imports",
    "summary": "This executive order establishes a policy framework regarding the importation of copper, highlighting its significance as a critical material for national security. The order is issued under the authority provided by the Constitution and the Trade Expansion Act of 1962, indicating the administration's intent to address the implications of copper imports on national security interests. Specific measures and actions related to monitoring and regulation of copper imports may be outlined to mitigate potential risks associated with dependence on foreign sources.",
    "link": "https://www.whitehouse.gov/presidential-actions/2025/02/addressing-the-threat-to-nationalsecurity-from-imports-of-copper/"
  },
  {
    "title": "Presidential Major Disaster Declaration for Kentucky Following Severe Storms and Flooding",
    "summary": "On a specified date, President Donald J. Trump issued a Major Disaster Declaration for the Commonwealth of Kentucky in response to the severe storms and flooding that caused significant damage in the area. This declaration allows for the provision of federal funding to assist individuals and businesses affected by the disaster. The financial assistance may encompass grants for temporary housing and other recovery programs aimed at helping those impacted regain stability and resilience following the natural disaster.",
    "link": "https://www.whitehouse.gov/presidential-actions/2025/02/president-trump-takes-decisive-action-to-deliver-relief-to-kentucky/"
  }
]