[
  {
    "title": "Directive for Promoting Cost-Effective Practices in Federal Contracts",
    "summary": "This directive establishes an administration-wide approach to promote cost-effective federal contracting practices. The objective is to reduce unnecessary spending of taxpayer funds by adhering to statutory preferences and improving the management of federal contracts. It emphasizes accountability and the adoption of commercially viable solutions to enhance efficiency in the use of federal resources. The directive aims to streamline contracting processes while ensuring adherence to legal frameworks.",
    "link": "https://www.whitehouse.gov/presidential-actions/2025/04/ensuring-commercial-cost-effective-solutions-in-federal-contracts/"
  },
  {
    "title": "Clarification of Exceptions Under Executive Order 14257",
    "summary": "This memorandum provides additional clarification regarding the exceptions outlined in Executive Order 14257, which was issued on April 2, 2025, and subsequently amended. The clarified details are directed towards key officials including the Secretaries of State, Treasury, Commerce, Homeland Security, and several other relevant senior advisors. The purpose is to ensure proper understanding and implementation of the specified executive order within the applicable governmental departments and sectors.",
    "link": "https://www.whitehouse.gov/presidential-actions/2025/04/clarification-of-exceptions-under-executive-order-14257-of-april-2-2025-as-amended/"
  },
  {
    "title": "Adjusting Tariff Rates in Response to Trading Partner Actions",
    "summary": "This executive order authorizes modifications to reciprocal tariff rates based on actions taken by trading partners in retaliation or alignment with U.S. trade policies. It is enacted under the authority of several legislative acts, including the International Emergency Economic Powers Act and the National Emergencies Act. The order aims to adjust tariffs to ensure that they reflect the current trading environment and address unfair trade practices.",
    "link": "https://www.whitehouse.gov/presidential-actions/2025/04/modifying-reciprocal-tariff-rates-to-reflect-trading-partner-retaliation-and-alignment/"
  }
]