[
  {
    "title": "Proclamation Implementing the United States–Japan Agreement",
    "summary": "This presidential action proclaims the implementation of the United States–Japan Agreement, asserting authority from the Constitution and U.S. law, including the International Emergency Economic Powers Act, the National Emergencies Act, and section 232 of the Trade Expansion Act of 1962. The action delineates the legal basis and scope for implementing the agreement and directs the steps or measures necessary to carry out the agreement's provisions. The action is published on the White House website as a presidential action dated September 2025.",
    "link": "https://www.whitehouse.gov/presidential-actions/2025/09/implementing-the-united-states-japan-agreement/"
  },
  {
    "title": "Nomination of Tammy Bruce to be Deputy Representative of the United States to the United Nations with the rank and status of Ambassador Extraordinary and Plenipotentiary, and Deputy Representative to the UN Security Council",
    "summary": "The White House announced nominations sent to the Senate, including Tammy Bruce of California for appointment as Deputy Representative of the United States to the United Nations, with the rank and status of Ambassador Extraordinary and Plenipotentiary, and for service as Deputy Representative to the United Nations Security Council. The nomination indicates that she would serve concurrently in an additional capacity without receiving additional compensation.",
    "link": "https://www.whitehouse.gov/presidential-actions/2025/09/nominations-sent-to-the-senate-8a96/"
  },
  {
    "title": "Proclamation Honoring the Victims of the Tragedy in Minneapolis, Minnesota",
    "summary": "A presidential proclamation issued by the President of the United States to honor and express respect for the victims of the violence that occurred on August 27, 2025, in Minneapolis, Minnesota. The proclamation is issued under the President's constitutional and legal authority and outlines the formal expression of condolences and observance by the United States.",
    "link": "https://www.whitehouse.gov/presidential-actions/2025/08/honoring-the-victims-of-the-tragedy-in-minneapolis-minnesota/"
  }
]