[
  {
    "title": "Proclamation by the President: National Pearl Harbor Remembrance Day, 2025",
    "summary": "On December 7, 1941, Japan's attack on Pearl Harbor led to the United States' entry into World War II. This proclamation designates December 7, 2025, as National Pearl Harbor Remembrance Day and requests that the Nation observe the day with appropriate ceremonies and moments of remembrance. It honors the lives lost, recognizes the service and sacrifice of veterans and active duty personnel, and reflects on the historical significance of the attack and the resilience of the American people.",
    "link": "https://www.whitehouse.gov/presidential-actions/2025/12/national-pearl-harbor-remembrance-day-2025-17fc/"
  },
  {
    "title": "Memorandum for the Secretary of Health and Human Services and the Director of the Centers for Disease Control and Prevention: Aligning United States Core Childhood Vaccine Recommendations with Best Practices from Peer, Developed Countries",
    "summary": "This memorandum directs the Secretary of Health and Human Services and the Director of the Centers for Disease Control and Prevention to align the United States' core childhood vaccine recommendations with best practices observed in peer, developed countries. It references the January 2025 decision to vaccinate all children against 18 diseases, including COVID-19, and tasks the two agencies with coordinating to implement alignment with international standards, assess differences between U.S. recommendations and international benchmarks, and ensure consistency across the national immunization schedule. It places the action within the context of presidential directives and notes the memorandum is published on The White House website as a presidential action.",
    "link": "https://www.whitehouse.gov/presidential-actions/2025/12/aligning-united-states-core-childhood-vaccine-recommendations-with-best-practices-from-peer-developed-countries/"
  },
  {
    "title": "Proclamation on National Pearl Harbor Remembrance Day, 2025",
    "summary": "This proclamation designates December 7, 2025 as National Pearl Harbor Remembrance Day. It commemorates the attack on Pearl Harbor on December 7, 1941, when forces of the Empire of Japan attacked the United States Pacific Fleet at Pearl Harbor. The document honors the service and sacrifice of those who defended the nation and calls for appropriate observances, reflection, and educational activities across the country to preserve the memory of the events and the lessons learned.",
    "link": "https://www.whitehouse.gov/presidential-actions/2025/12/national-pearl-harbor-remembrance-day-2025/"
  },
  {
    "title": "Nominations Sent to the Senate for United States Attorney for the Middle District of North Carolina and Federal Judicial Positions",
    "summary": "This White House announcement lists three individuals nominated to federal positions: James Bishop to be United States Attorney for the Middle District of North Carolina for a four-year term; Megan Blair Benton to be United States District Judge for the Western District of Missouri; and Christopher Michael De Bono to be an Associate Judge. The post is part of the 'Nominations Sent to the Senate' series published on the White House website.",
    "link": "https://www.whitehouse.gov/presidential-actions/2025/12/nominations-sent-to-the-senate-a9f3/"
  },
  {
    "title": "Proclamation by the President on Thanksgiving Day, 2025",
    "summary": "This proclamation designates Thanksgiving Day for the year 2025. It recalls the origin of the National Day of Thanksgiving, noting that President George Washington in 1789 declared a day for the nation to acknowledge Providence, to honor the Almighty, and to be grateful. It invites the American people to observe the day with gratitude for the blessings of the year and to engage in acts of charity and service in keeping with the holiday's historical purpose.",
    "link": "https://www.whitehouse.gov/presidential-actions/2025/11/thanksgiving-day-2025/"
  }
]