[
  {
    "title": "Adjustment of Tariff Rates in Response to Trading Partner Actions",
    "summary": "This executive order outlines the authority of the President to modify reciprocal tariff rates based on retaliation measures taken by trading partners. The order references relevant legal frameworks enabling such actions, including the International Emergency Economic Powers Act and the National Emergencies Act. The intent is to ensure that U.S. tariff rates align appropriately with the measures adopted by foreign entities in trade relations, thereby promoting fair trading practices.",
    "link": "https://www.whitehouse.gov/presidential-actions/2025/04/modifying-reciprocal-tariff-rates-to-reflect-trading-partner-retaliation-and-alignment/"
  },
  {
    "title": "Executive Order on Legal Firm Conduct Related to National Security",
    "summary": "This Executive Order outlines the authority of the President to regulate the access of lawyers and law firms to national security information based on their conduct. It emphasizes that legal professionals whose activities are deemed harmful to critical American interests should not be granted access to sensitive governmental information. The Order seeks to ensure that taxpayer resources are not utilized to support entities that engage in detrimental actions regarding national interests.",
    "link": "https://www.whitehouse.gov/presidential-actions/2025/04/addressing-risks-from-susman-godfrey/"
  },
  {
    "title": "Executive Order on Revitalizing U.S. Maritime Industry",
    "summary": "This executive order addresses the decline of the United States' commercial shipbuilding capacity and maritime workforce, which has been attributed to prolonged governmental neglect. The order sets out initiatives aimed at revitalizing the maritime industry, strengthening the industrial base, and enhancing the capabilities of the maritime workforce to restore competitiveness and self-sufficiency in shipbuilding and related fields. The objectives include fostering innovation, promoting workforce development, and ensuring sustainable growth within the maritime sector.",
    "link": "https://www.whitehouse.gov/presidential-actions/2025/04/restoring-americas-maritime-dominance/"
  }
]