[
  {
    "title": "Proclamation Honoring the Memory of Pope Francis",
    "summary": "This proclamation issued by the President of the United States declares a national observance in memory of His Holiness Pope Francis. It emphasizes a mark of respect through the order to fly the United States flag at half-staff. The proclamation serves to recognize the contributions and impact of Pope Francis on a global scale.",
    "link": "https://www.whitehouse.gov/presidential-actions/2025/04/honoring-the-memory-of-his-holiness-pope-francis/"
  },
  {
    "title": "Executive Order on Enhancing American Seafood Competitiveness",
    "summary": "This executive order addresses the management and enhancement of the United States' seafood resources, which encompass over 4 million square miles of fishing grounds. It outlines the importance of these resources for economic and environmental reasons, aiming to improve the competitiveness of the American seafood industry. The order emphasizes the need for coordinated efforts among federal agencies to ensure sustainable fishing practices and to strengthen the seafood supply chain.",
    "link": "https://www.whitehouse.gov/presidential-actions/2025/04/restoring-american-seafood-competitiveness/"
  },
  {
    "title": "Proclamation on the 250th Anniversary of the Battles of Lexington and Concord",
    "summary": "This proclamation commemorates the 250th anniversary of the Battles of Lexington and Concord, recognized as significant early confrontations in the American Revolutionary War. It acknowledges the historical importance of these battles and honors the individuals involved in the struggle for Independence. The proclamation serves to reflect on the legacy of freedom and resilience epitomized by the events that took place two and a half centuries ago.",
    "link": "https://www.whitehouse.gov/presidential-actions/2025/04/250th-anniversary-of-the-battles-of-lexington-and-concord/"
  },
  {
    "title": "Extension of Federal Hiring Freeze",
    "summary": "This memorandum issued by the President announces the extension of the freeze on the hiring of Federal civilian employees until July 15, 2025. The directive applies to all federal executive departments and agencies and continues a policy aimed at managing federal workforce levels in accordance with established governmental procedures.",
    "link": "https://www.whitehouse.gov/presidential-actions/2025/04/extension-of-hiring-freeze/"
  },
  {
    "title": "Proclamation on the Management of the Pacific Remote Islands Marine National Monument",
    "summary": "This proclamation addresses the management and regulatory framework of the Pacific Remote Islands Marine National Monument (PRIMNM), originally established in January 2009 and expanded in September 2014. The document outlines the importance of maintaining conservation measures while facilitating the commercial fishing industry within the designated areas of the Pacific Ocean. It aims to balance ecological preservation with economic opportunities related to fishing activities. The proclamation emphasizes the responsible management of fish resources and the necessity of adhering to established guidelines to support sustainable fishing practices.",
    "link": "https://www.whitehouse.gov/presidential-actions/2025/04/unleashing-american-commercial-fishing-in-the-pacific/"
  },
  {
    "title": "Presidential Executive Order on Federal Office Space Management",
    "summary": "This executive order establishes guidelines for managing federal office space across the United States, emphasizing the need for efficient and cost-effective provision of services. It addresses the diverse geographic distribution of the American population and aims to optimize the use of federal office facilities in urban, suburban, and rural areas.",
    "link": "https://www.whitehouse.gov/presidential-actions/2025/04/restoring-common-sense-to-federal-office-space-management/"
  },
  {
    "title": "Presidential Executive Order on National Security and Economic Stability Regarding Processed Critical Minerals",
    "summary": "This Executive Order, issued under the Trade Expansion Act of 1962, emphasizes the connection between national defense and economic strength. It outlines the administration's policy on ensuring a stable supply of processed critical minerals and derivative products to support national security and economic resilience. The order identifies specific measures to be taken under Section 232 of the Act that aim to protect and strengthen the domestic production capabilities of these essential materials, recognizing their importance in maintaining economic and defense operations.",
    "link": "https://www.whitehouse.gov/presidential-actions/2025/04/ensuring-national-security-and-economic-resilience-through-section-232-actions-on-processed-critical-minerals-and-derivative-products/"
  },
  {
    "title": "Executive Order on Reducing Prescription Drug Prices",
    "summary": "This executive order outlines actions taken during the President's first term aimed at reducing the cost of prescription drugs for American patients. It emphasizes the importance of making prescription medications more affordable and accessible, reflecting the administration's ongoing commitment to this issue.",
    "link": "https://www.whitehouse.gov/presidential-actions/2025/04/lowering-drug-prices-by-once-again-putting-americans-first/"
  },
  {
    "title": "Improving Efficiency in Federal Procurement Processes",
    "summary": "This executive order aims to enhance the efficiency and cost-effectiveness of the federal procurement system. Recognizing that the federal government is the largest buyer of goods and services globally, the order addresses the complexities and inefficiencies that often hinder businesses from engaging with government contracts. It seeks to streamline processes and reduce barriers, thereby promoting better accessibility and competition in federal purchasing activities.",
    "link": "https://www.whitehouse.gov/presidential-actions/2025/04/restoring-common-sense-to-federal-procurement/"
  }
]