[
  {
    "title": "Proclamation on National Black History Month, 2026",
    "summary": "A presidential proclamation declaring February 2026 as National Black History Month and recognizing the 250th anniversary of U.S. independence. The proclamation notes that Black Americans have made significant contributions to the nation's history over more than two and a half centuries and calls for education, reflection, and activities to honor Black American heritage and achievements.",
    "link": "https://www.whitehouse.gov/presidential-actions/2026/02/national-black-history-month-2026/"
  },
  {
    "title": "Executive Order Recognizing American Motor Racing and INDYCAR",
    "summary": "This executive order states the purpose and policy of the President regarding recognition of American motor racing, highlighting more than a century of INDYCAR competition in the United States and noting that cars in the sport reach speeds over 200 miles per hour. It defines the scope and objectives of the action.",
    "link": "https://www.whitehouse.gov/presidential-actions/2026/01/celebrating-american-greatness-with-american-motor-racing/"
  },
  {
    "title": "Proclamation Declaring National School Choice Week, 2026",
    "summary": "A presidential proclamation declaring National School Choice Week for 2026. The document emphasizes the role of families in choosing educational options and invites participation in events associated with the week, outlining the government's recognition of school choice as a national observance.",
    "link": "https://www.whitehouse.gov/presidential-actions/2026/01/national-school-choice-week-2026/"
  },
  {
    "title": "Executive Order to Address Competition in the Residential Real Estate Market Involving Institutional Investors",
    "summary": "This executive order directs federal agencies to study and address anti-competitive practices by large institutional investors in the residential real estate market. It outlines a policy framework aimed at improving competition and access to homeownership for individual buyers, and calls for interagency coordination, data collection, and consideration of appropriate actions to ensure fair market conditions in home purchases and related transactions.",
    "link": "https://www.whitehouse.gov/presidential-actions/2026/01/stopping-wall-street-from-competing-with-main-street-homebuyers/"
  }
]