[
  {
    "title": "Executive Order Adjusting Rates of Pay for Statutory Pay Systems",
    "summary": "This executive order, issued under the President's constitutional and statutory authority, adjusts the rates of basic pay or salaries for statutory pay systems as defined in 5 U.S.C. 5302(1). The adjustments are made in accordance with 5 U.S.C. 5303, and Section 1 designates the Statutory Pay Systems and specifies that the basic pay rates for these systems are set or modified by the order to reflect the authorized pay adjustments within the statutory framework.",
    "link": "https://www.whitehouse.gov/presidential-actions/2025/12/adjustments-of-certain-rates-of-pay/"
  },
  {
    "title": "Executive Order to Ensure United States Space Superiority",
    "summary": "Issed under the President's constitutional authority, this executive order states the purpose of pursuing space superiority as a national objective. It describes space superiority as a measure of national vision and resolve and asserts that the technologies developed by the United States to achieve it contribute to the nation's strength, security, and prosperity. The document establishes the policy and directives related to achieving or maintaining space superiority and calls for interagency action to advance this objective.",
    "link": "https://www.whitehouse.gov/presidential-actions/2025/12/ensuring-american-space-superiority/"
  },
  {
    "title": "Providing for the Closure of Executive Departments and Agencies of the Federal Government on December 24, 2025, and December 26, 2025",
    "summary": "An executive order directing the temporary closure of all executive departments and agencies of the federal government and excusal of employees from duty on Wednesday, December 24, 2025, and Friday, December 26, 2025, issued under the President's constitutional and statutory authority.",
    "link": "https://www.whitehouse.gov/presidential-actions/2025/12/providing-for-the-closure-of-executive-departments-and-agencies-of-the-federal-government-on-december-24-2025-and-december-26-2025/"
  },
  {
    "title": "Executive Order to Increase Medical Marijuana and Cannabidiol Research",
    "summary": "This presidential action directs federal agencies to expand medical marijuana and cannabidiol (CBD) research, building on the FDA's 2023 review. The order states the goal of improving access to medical treatments and strengthening the nation's research infrastructure and outlines agency coordination to support research-related activities.",
    "link": "https://www.whitehouse.gov/presidential-actions/2025/12/increasing-medical-marijuana-and-cannabidiol-research/"
  },
  {
    "title": "Executive Order Restricting Entry of Foreign Nationals to Protect the Security of the United States",
    "summary": "This executive order directs restrictions on entry of certain foreign nationals into the United States to prevent potential threats to national security and public safety at the borders. It reinstates policies previously implemented by the administration and references the Supreme Court's upholding of those restrictions. Signed January 20, 2025 as Executive Order 14161, the order outlines the scope of restricted categories of foreign nationals, eligibility for exemptions or waivers, and implementation mechanisms to enforce the restrictions.",
    "link": "https://www.whitehouse.gov/presidential-actions/2025/12/restricting-and-limiting-the-entry-of-foreign-nationals-to-protect-the-security-of-the-united-states/"
  }
]