[
  {
    "title": "National Security Presidential Memorandum on Advancing United States Leadership in 6G Technology",
    "summary": "A National Security Presidential Memorandum directed to the Secretary of State, the Secretary of Defense, the Secretary of Commerce, the Secretary of Transportation, the Secretary of Energy, the Secretary of Homeland Security, the Director of the Office of Management and Budget, the Director of National Intelligence, and the Chairman of the Federal Communications Commission, as well as senior White House policy officials. The memorandum directs interagency coordination to accelerate research, development, and deployment of sixth-generation wireless technology (6G). It outlines objectives to strengthen the United States' 6G supply chains, promote secure and resilient technologies, harmonize international standards, and foster collaboration with allied nations, industry, and academia. It assigns responsibilities, sets milestones, and emphasizes national security, economic competitiveness, and technological leadership in 6G.",
    "link": "https://www.whitehouse.gov/presidential-actions/2025/12/national-security-presidential-memorandum-nspm-8-0bda/"
  },
  {
    "title": "Proclamation: Bill of Rights Day, 2025",
    "summary": "The President proclaims Bill of Rights Day, 2025, commemorating the ratification of the Bill of Rights and its role in establishing and protecting individual rights and the fundamental liberties of Americans. The proclamation highlights the nation's founding ideals of liberty, justice, and self-government and calls on the public to observe the day by reflecting on the enduring importance of these rights.",
    "link": "https://www.whitehouse.gov/presidential-actions/2025/12/bill-of-rights-day-2025/"
  },
  {
    "title": "Executive Order Declaring Illicit Fentanyl as a Weapon of Mass Destruction",
    "summary": "This executive order designates illicit fentanyl as a weapon of mass destruction for purposes of federal policy and enforcement. The document opens with Section 1, outlining the purpose and policy by stating that illicit fentanyl is closer to a chemical weapon than a narcotic and noting that extremely small quantities, such as two milligrams, illustrate its potency. The overall aim is to establish the federal government's approach to countering illicit fentanyl through this designation, guiding authority and coordination to address its production, trafficking, and distribution.",
    "link": "https://www.whitehouse.gov/presidential-actions/2025/12/designating-fentanyl-as-a-weapon-of-mass-destruction/"
  },
  {
    "title": "Executive Order Protecting American Investors from Foreign-Owned and Politically Motivated Proxy Advisors",
    "summary": "This executive order authorizes actions to protect U.S. investors from potential influence by foreign-owned proxy advisory firms, naming Institutional Shareholder Services Inc. and Glass, Lewis & Co., LLC as examples. It directs relevant federal agencies to assess risks to investor protection and market integrity posed by foreign ownership or influence in proxy advisory services, and to develop measures to improve transparency, disclose potential conflicts of interest, and consider regulatory actions to mitigate such risks. The order seeks to ensure accountability in proxy voting recommendations affecting U.S. markets and to coordinate agency actions accordingly.",
    "link": "https://www.whitehouse.gov/presidential-actions/2025/12/protecting-american-investors-from-foreign-owned-and-politically-motivated-proxy-advisors/"
  }
]