[
  {
    "title": "Executive Order on the Continued Reduction of Federal Bureaucracy",
    "summary": "This executive order outlines the administration's ongoing efforts to reduce the size and scope of the Federal bureaucracy, as deemed unnecessary. It establishes a framework for continuing to identify and eliminate elements of federal operations that are determined to be redundant or not essential to the functioning of government. The specific measures and procedures for this reduction are detailed within the order to ensure effective implementation.",
    "link": "https://www.whitehouse.gov/presidential-actions/2025/03/continuing-the-reduction-of-the-federal-bureaucracy/"
  },
  {
    "title": "Addressing Potential Issues Related to Legal Practices of Global Law Firms",
    "summary": "This executive order outlines concerns regarding the impact of activities conducted by global law firms on the judicial system and fundamental legal principles in the United States. It emphasizes the need to examine and address the risks associated with these firms, particularly those identified in the context of their practices and operations that may compromise the integrity of the legal process. The order calls for a thorough assessment of the implications of such practices and the development of strategies to mitigate any negative effects on the American judicial framework.",
    "link": "https://www.whitehouse.gov/presidential-actions/2025/03/addressing-risks-from-paul-weiss/"
  },
  {
    "title": "Additional Rescissions of Certain Executive Orders and Actions",
    "summary": "This Executive Order outlines the decision to rescind more Presidential orders and memoranda previously established. It follows up on Executive Order 14148 issued on January 20, 2025, which initially rescinded 78 orders from the previous administration. The purpose of this order is to continue the process of reviewing and dismissing specific executive actions deemed unnecessary or inappropriate.",
    "link": "https://www.whitehouse.gov/presidential-actions/2025/03/additional-recissions-of-harmful-executive-orders-and-actions/"
  },
  {
    "title": "Proclamation on U.S. Hostage and Wrongful Detainee Day, 2025",
    "summary": "This proclamation observes U.S. Hostage and Wrongful Detainee Day, a specific day recognized to express solidarity with American individuals who are being held in captivity abroad, as well as their families and loved ones. The proclamation includes a commitment from the President to remember and support these individuals and their families, reinforcing a pledge to seek their safe return.",
    "link": "https://www.whitehouse.gov/presidential-actions/2025/03/u-s-hostage-and-wrongful-detainee-day-2025/"
  },
  {
    "title": "Establishment of the Strategic Bitcoin Reserve and United States Digital Asset Stockpile",
    "summary": "This executive order aims to establish a Strategic Bitcoin Reserve and a United States Digital Asset Stockpile. The order outlines the importance of Bitcoin as the original cryptocurrency, noting its capped supply of 21 million coins and its security features. The initiative seeks to create a framework for managing and regulating digital assets, highlighting the potential role these assets may play in the economy and national security. The order calls for further development of policies related to digital currencies in connection to existing economic strategies.",
    "link": "https://www.whitehouse.gov/presidential-actions/2025/03/establishment-of-the-strategic-bitcoin-reserveand-united-states-digital-asset-stockpile/"
  }
]