[
  {
    "title": "Nominations Sent to the Senate: Ademola Adewale-Sadik for US Director of the African Development Bank and Charlton Allen for General Counsel of the Federal Labor Relations Authority, with additional nominations",
    "summary": "The White House announced nominations to the Senate for several federal positions. Ademola Adewale-Sadik, of New York, was nominated to be United States Director of the African Development Bank for a five-year term, succeeding Oren E. Whyche-Shaw. Charlton Allen, of North Carolina, was nominated to be General Counsel of the Federal Labor Relations Authority for a five-year term, succeeding Julia Akins Clark. The announcement also notes the nomination of Matthew Anderson, among others.",
    "link": "https://www.whitehouse.gov/presidential-actions/2026/01/nominations-sent-to-the-senate-078c/"
  },
  {
    "title": "Executive Order on Withdrawing the United States from International Organizations, Conventions, and Treaties Contrary to United States Interests",
    "summary": "The order directs the heads of executive departments and agencies to withdraw the United States from participation in specified international organizations, conventions, and treaties that the President determines are contrary to United States interests, and to end funding to those entities. It asserts authority under the President's constitutional and statutory powers and requires implementation steps, timelines, and coordination across federal agencies to unwind participation and funding, with public reporting and compliance measures as part of reorienting international engagement toward stated U.S. interests.",
    "link": "https://www.whitehouse.gov/presidential-actions/2026/01/withdrawing-the-united-states-from-international-organizations-conventions-and-treaties-that-are-contrary-to-the-interests-of-the-united-states/"
  },
  {
    "title": "Executive Order to Prioritize the Warfighter in Defense Contracting",
    "summary": "This presidential executive action asserts the President's constitutional authority and outlines the objective of prioritizing the warfighter in defense contracting. It states the President's intent to ensure the United States military possesses the most lethal warfighting capabilities and directs relevant federal agencies to align defense procurement and contracting practices with this goal. The order establishes the scope of authority and expectations for agencies to implement policies and procedures to enhance warfighter readiness through defense contracting and procurement decisions.",
    "link": "https://www.whitehouse.gov/presidential-actions/2026/01/prioritizing-the-warfighter-in-defense-contracting/"
  },
  {
    "title": "Nominations Sent to the Senate for United States Attorney in Maine and United States District Judge in Missouri, Among Other Nominations",
    "summary": "This White House announcement lists nominations sent to the Senate, including Andrew Benson of Maine to be United States Attorney for the District of Maine for a four-year term, succeeding Darcie N. McElwee; Megan Blair Benton of Missouri to be United States District Judge for the Western District of Missouri, succeeding retiring Judge M. Douglas Harpool; and William Boyle of North Carolina for another federal position, with additional nominations included in the package.",
    "link": "https://www.whitehouse.gov/presidential-actions/2026/01/nominations-sent-to-the-senate-3f7b/"
  }
]